----------------------------------------------------------------------------------------------------------------------------------
      name:  log_10_modeling_idhs17
       log:  D:\RESEARCH & WRITING\master thesis_child mortality\stata\log\10_modeling_idhs17.log
  log type:  text
 opened on:  15 Dec 2021, 16:39:37

. 
. /*
> ================================================================================
> ********************************************************************************
> PROJECT:
> PENELITIAN TESIS
> DEPRIVASI LINGKUNGAN RUMAH TANGGA DAN KEMATIAN BAYI DAN ANAK DI INDONESIA
> 
> SYNTAX:
> 10-LOGISTIK MULTILEVEL HAZARD DISKRIT-KEMATIAN BAYI
> 
> PENULIS:
> ARI PURWANTO SARWO PRASOJO (2006500321)
> MAGISTER EKONOMI KEPENDUDUKAN DAN KETENAGAKERJAAN
> FEB, UNIVERSITAS INDONESIA
> 2021
> ********************************************************************************
> ================================================================================
> */
. 
. 
. 
. /*
> ================================================================================
> PENYIAPAN
> ================================================================================
> */
. 
. clear all

. macro drop _all

. set maxvar 10000


. 
. *direktori kerja
. loc dtadir              "dta"

. *loc outdir             "output"
. 
. *baca data
. loc dta                 "`dtadir'\8-data-model-`idhs'.dta"

. use `dta'
(Dataset pemodelan \ 15 Dec 2021_16:38:05)

. 
. /*
> ================================================================================
> A. NNDEATH                                                                                                      
> ================================================================================
> */
. 
. collect clear

. 
. /*
> ******************************************************************
> ESTIMASI                                                                                                        [done]
> ******************************************************************
> */
. 
. *\Model 1 - baseline hazard
. #delimit ;
delimiter now ;
. collect: melogit nndeath i.interval
>              if data == 1 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -7599.5095  
Iteration 1:   log likelihood = -3640.3663  
Iteration 2:   log likelihood = -3563.0611  
Iteration 3:   log likelihood = -3524.3192  
Iteration 4:   log likelihood = -3524.2189  
Iteration 5:   log likelihood = -3524.2189  

Refining starting values:

Grid node 0:   log likelihood =  -3574.025

Fitting full model:

Iteration 0:   log likelihood =  -3574.025  (not concave)
Iteration 1:   log likelihood = -3521.7959  
Iteration 2:   log likelihood = -3513.8133  
Iteration 3:   log likelihood = -3513.7792  
Iteration 4:   log likelihood = -3513.7792  

Mixed-effects logistic regression               Number of obs     =     69,109
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =          6
                                                              avg =       35.1
                                                              max =        107

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(1)      =     184.41
Log likelihood = -3513.7792                     Prob > chi2       =     0.0000
------------------------------------------------------------------------------
     nndeath | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    interval |
  7-28 hari  |   .2657685   .0259339   -13.58   0.000     .2195042    .3217839
       _cons |   .0120483   .0008289   -64.23   0.000     .0105285    .0137875
-------------+----------------------------------------------------------------
psu          |
   var(_cons)|   .4044881   .1017579                        .24704     .662284
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 20.88       Prob >= chibar2 = 0.0000

. #delimit cr
delimiter now cr
. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |   .1094881   .0245284      .0698463    .1675755
------------------------------------------------------------------------------

. 
. *\Model 2 - tanpa kontrol
. #delimit ;
delimiter now ;
. collect: melogit nndeath i.interval i.depriv
>                  if data == 1 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -7598.7303  
Iteration 1:   log likelihood =  -3633.593  
Iteration 2:   log likelihood = -3557.6691  
Iteration 3:   log likelihood = -3513.9537  
Iteration 4:   log likelihood = -3513.7512  
Iteration 5:   log likelihood = -3513.7511  

Refining starting values:

Grid node 0:   log likelihood = -3564.8565

Fitting full model:

Iteration 0:   log likelihood = -3564.8565  (not concave)
Iteration 1:   log likelihood = -3512.3159  
Iteration 2:   log likelihood = -3504.9871  
Iteration 3:   log likelihood = -3504.9584  
Iteration 4:   log likelihood = -3504.9584  

Mixed-effects logistic regression               Number of obs     =     69,109
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =          6
                                                              avg =       35.1
                                                              max =        107

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(3)      =     202.26
Log likelihood = -3504.9584                     Prob > chi2       =     0.0000
------------------------------------------------------------------------------
     nndeath | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    interval |
  7-28 hari  |   .2657592    .025933   -13.58   0.000     .2194965    .3217727
             |
      depriv |
     Rendah  |   1.299412   .1232464     2.76   0.006     1.078977    1.564882
     Tinggi  |   1.542859   .1659988     4.03   0.000     1.249523    1.905059
             |
       _cons |   .0103899    .000841   -56.42   0.000     .0088656    .0121761
-------------+----------------------------------------------------------------
psu          |
   var(_cons)|   .3714588   .1008562                      .2181714    .6324462
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 17.59       Prob >= chibar2 = 0.0000

. #delimit cr
delimiter now cr
. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |   .1014547   .0247516      .0621918    .1612431
------------------------------------------------------------------------------

. 
. *\Model 3 - kontrol: sosek
. #delimit ;
delimiter now ;
. collect: melogit nndeath i.interval i.depriv
>                  b3.pareduc b2.wealth b1.reside pwdisthfac
>                  if data == 1 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -7598.3064  
Iteration 1:   log likelihood = -3629.9233  
Iteration 2:   log likelihood =  -3554.924  
Iteration 3:   log likelihood = -3508.4635  
Iteration 4:   log likelihood = -3508.1898  
Iteration 5:   log likelihood = -3508.1897  

Refining starting values:

Grid node 0:   log likelihood = -3560.7258

Fitting full model:

Iteration 0:   log likelihood = -3560.7258  (not concave)
Iteration 1:   log likelihood = -3508.6045  
Iteration 2:   log likelihood = -3500.4046  
Iteration 3:   log likelihood = -3500.3507  
Iteration 4:   log likelihood = -3500.3507  

Mixed-effects logistic regression               Number of obs     =     69,109
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =          6
                                                              avg =       35.1
                                                              max =        107

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(10)     =     211.73
Log likelihood = -3500.3507                     Prob > chi2       =     0.0000
------------------------------------------------------------------------------
     nndeath | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    interval |
  7-28 hari  |   .2657859   .0259351   -13.58   0.000     .2195192    .3218039
             |
      depriv |
     Rendah  |   1.233869   .1283517     2.02   0.043     1.006291    1.512914
     Tinggi  |   1.382865   .1814717     2.47   0.014     1.069246    1.788471
             |
     pareduc |
     Rendah  |   1.249743   .1400457     1.99   0.047      1.00331    1.556704
 Ibu < ayah  |   1.108489   .1478127     0.77   0.440     .8535462     1.43958
 Ibu > ayah  |   1.119805   .1467517     0.86   0.388     .8661467    1.447749
             |
      wealth |
     Miskin  |   1.154359   .1687345     0.98   0.326     .8668007    1.537313
   Menengah  |   1.112914   .1481222     0.80   0.422     .8573772    1.444613
             |
      reside |
  Perdesaan  |   .8714562   .0852932    -1.41   0.160      .719341    1.055739
             |
  pwdisthfac |   1.504301   .4440674     1.38   0.167     .8434536    2.682923
       _cons |   .0092566   .0011598   -37.37   0.000      .007241    .0118331
-------------+----------------------------------------------------------------
psu          |
   var(_cons)|   .3485702   .0998381                      .1988325    .6110729
------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 15.68       Prob >= chibar2 = 0.0000

. #delimit cr
delimiter now cr
. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |   .0958021    .024811      .0569933    .1566476
------------------------------------------------------------------------------

. 
. *\Model 4 - kontrol: full
. #delimit ;
delimiter now ;
. collect: melogit nndeath i.interval i.depriv i.chsex b1.bordin b1.mageb
>                  b3.pareduc b2.wealth b1.reside pwdisthfac
>                  if data == 1 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -7595.0051  
Iteration 1:   log likelihood = -3602.0461  
Iteration 2:   log likelihood = -3535.8382  
Iteration 3:   log likelihood = -3470.2977  
Iteration 4:   log likelihood = -3469.7556  
Iteration 5:   log likelihood = -3469.7552  

Refining starting values:

Grid node 0:   log likelihood = -3522.8436

Fitting full model:

Iteration 0:   log likelihood = -3522.8436  (not concave)
Iteration 1:   log likelihood =  -3471.233  
Iteration 2:   log likelihood = -3462.6235  
Iteration 3:   log likelihood =  -3462.558  
Iteration 4:   log likelihood = -3462.5579  

Mixed-effects logistic regression               Number of obs     =     69,109
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =          6
                                                              avg =       35.1
                                                              max =        107

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(18)     =     294.52
Log likelihood = -3462.5579                     Prob > chi2       =     0.0000
-------------------------------------------------------------------------------------
            nndeath | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------------+----------------------------------------------------------------
           interval |
         7-28 hari  |   .2660055   .0259717   -13.56   0.000     .2196761    .3221058
                    |
             depriv |
            Rendah  |   1.200811   .1254528     1.75   0.080     .9784679    1.473678
            Tinggi  |   1.318852   .1742638     2.09   0.036     1.017945    1.708708
                    |
              chsex |
         Laki-laki  |   1.214912   .0981173     2.41   0.016     1.037053    1.423274
                    |
             bordin |
           Pertama  |   1.517278   .1857355     3.41   0.001     1.193622    1.928697
   2 dan <24 bulan  |   1.702274   .3714518     2.44   0.015     1.109914    2.610775
>=3 dan >=24 bulan  |   1.165955   .1466778     1.22   0.222     .9111715    1.491982
 >=3 dan <24 bulan  |   2.599615   .4229978     5.87   0.000     1.889754    3.576126
                    |
              mageb |
               <20  |   1.454827   .2017607     2.70   0.007     1.108571    1.909233
             30-39  |    1.21367   .1267148     1.85   0.064     .9890758    1.489263
             40-49  |   2.508579   .4547826     5.07   0.000      1.75838    3.578845
                    |
            pareduc |
            Rendah  |    1.23598   .1422196     1.84   0.066     .9864314     1.54866
        Ibu < ayah  |   1.105011   .1490567     0.74   0.459     .8482945    1.439417
        Ibu > ayah  |   1.124084   .1477296     0.89   0.373     .8688248    1.454339
                    |
             wealth |
            Miskin  |   1.130366    .166327     0.83   0.405     .8471683    1.508234
          Menengah  |   1.115394   .1489005     0.82   0.413     .8586105    1.448972
                    |
             reside |
         Perdesaan  |   .8760221   .0858069    -1.35   0.177     .7230017    1.061429
                    |
         pwdisthfac |   1.409938   .4161752     1.16   0.244     .7905849    2.514499
              _cons |   .0056413   .0009142   -31.95   0.000     .0041062    .0077503
--------------------+----------------------------------------------------------------
psu                 |
          var(_cons)|   .3333613   .0991955                      .1860504    .5973102
-------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 14.39       Prob >= chibar2 = 0.0001

. #delimit cr
delimiter now cr
. estimate store mdl_a4

. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |   .0920067   .0248587      .0535255    .1536616
------------------------------------------------------------------------------

. 
. *\Model 5 - interaksi periode umur
. #delimit ;
delimiter now ;
. collect: melogit nndeath i.interval i.interval#i.depriv i.chsex b1.bordin 
>                  b1.mageb b3.pareduc b2.wealth b1.reside pwdisthfac
>                  if data == 1 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -7594.8379  
Iteration 1:   log likelihood = -3600.9924  
Iteration 2:   log likelihood = -3533.1204  
Iteration 3:   log likelihood = -3469.5203  
Iteration 4:   log likelihood = -3468.9676  
Iteration 5:   log likelihood = -3468.9673  

Refining starting values:

Grid node 0:   log likelihood = -3522.0445

Fitting full model:

Iteration 0:   log likelihood = -3522.0445  (not concave)
Iteration 1:   log likelihood = -3470.4405  
Iteration 2:   log likelihood = -3461.8334  
Iteration 3:   log likelihood = -3461.7677  
Iteration 4:   log likelihood = -3461.7677  

Mixed-effects logistic regression               Number of obs     =     69,109
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =          6
                                                              avg =       35.1
                                                              max =        107

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(20)     =     291.99
Log likelihood = -3461.7677                     Prob > chi2       =     0.0000
-------------------------------------------------------------------------------------
            nndeath | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------------+----------------------------------------------------------------
           interval |
         7-28 hari  |   .2567963   .0376098    -9.28   0.000     .1927186    .3421795
                    |
    interval#depriv |
   0-6 hari#Rendah  |   1.219529   .1392541     1.74   0.082     .9749809    1.525415
   0-6 hari#Tinggi  |   1.247942   .1794068     1.54   0.123     .9415077    1.654112
  7-28 hari#Rendah  |   1.129118   .2401478     0.57   0.568     .7442187    1.713082
  7-28 hari#Tinggi  |   1.591791   .3631982     2.04   0.042     1.017813    2.489455
                    |
              chsex |
         Laki-laki  |     1.2149   .0981143     2.41   0.016     1.037046    1.423255
                    |
             bordin |
           Pertama  |   1.517112   .1857191     3.40   0.001     1.193485    1.928495
   2 dan <24 bulan  |   1.702645   .3715187     2.44   0.015     1.110174    2.611302
>=3 dan >=24 bulan  |   1.165911   .1466744     1.22   0.222     .9111335     1.49193
 >=3 dan <24 bulan  |   2.599732   .4229926     5.87   0.000     1.889874    3.576221
                    |
              mageb |
               <20  |   1.455094   .2017914     2.70   0.007     1.108784    1.909568
             30-39  |   1.213571    .126704     1.85   0.064     .9889963     1.48914
             40-49  |   2.508456   .4547311     5.07   0.000     1.758333    3.578587
                    |
            pareduc |
            Rendah  |   1.236054    .142223     1.84   0.066     .9864983     1.54874
        Ibu < ayah  |   1.104896   .1490388     0.74   0.460     .8482098    1.439261
        Ibu > ayah  |   1.124148   .1477352     0.89   0.373     .8688775    1.454414
                    |
             wealth |
            Miskin  |   1.130352   .1663414     0.83   0.405     .8471335    1.508258
          Menengah  |   1.115382   .1489137     0.82   0.413     .8585796    1.448995
                    |
             reside |
         Perdesaan  |   .8759628   .0858065    -1.35   0.176     .7229441    1.061369
                    |
         pwdisthfac |   1.409678   .4160225     1.16   0.245     .7905229     2.51377
              _cons |   .0056834   .0009295   -31.61   0.000     .0041248     .007831
--------------------+----------------------------------------------------------------
psu                 |
          var(_cons)|   .3333999   .0991979                      .1860818    .5973475
-------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 14.40       Prob >= chibar2 = 0.0001

. #delimit cr
delimiter now cr
. estimate store mdl_a5

. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |   .0920163   .0248588      .0535341    .1536698
------------------------------------------------------------------------------

. 
. *\\likelihood ratio test model a5 vs model a4
. lrtest mdl_a4 mdl_a5

Likelihood-ratio test
Assumption: mdl_a4 nested within mdl_a5

 LR chi2(2) =   1.58
Prob > chi2 = 0.4537

. 
. /*
> ******************************************************************
> SAVE                                                                                                            [done]
> ******************************************************************
> */
. 
. /*
> ------------------------------------------------------------------
> SE
> ------------------------------------------------------------------
> */
. 
. *samping
. collect style autolevels result _r_b _r_se, clear

. quietly collect layout (colname) (cmdset#result[_r_b stars _r_se])

. collect style _cons first

. collect style cell result[_r_b], nformat(%6,3fc)

. collect style cell result[_r_se], nformat(%6,3fc) sformat("(%s)")

. collect stars _r_p "0.001" "***" "0.01" "**" "0.05" "*"

. collect style column, dups(center)

. collect style header result, level(hide)

. collect style row stack, nobinder delimiter(" x ")

. collect style cell, font( Times New Roman, size(8) )

. collect style cell border_block, border(right, pattern(nil))

. collect preview

---------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                              1                 2                 3                 4                 5        
---------------------------------------------------------------------------------------------------------------------------------------------------------------
Intercept                                                             0,012 *** (0,001) 0,010 *** (0,001) 0,009 *** (0,001) 0,006 *** (0,001) 0,006 *** (0,001)
Interval umur                                                                                                                                                  
  0-6 hari                                                            1,000     (0,000) 1,000     (0,000) 1,000     (0,000) 1,000     (0,000) 1,000     (0,000)
  7-28 hari                                                           0,266 *** (0,026) 0,266 *** (0,026) 0,266 *** (0,026) 0,266 *** (0,026) 0,257 *** (0,038)
var(_cons[psu])                                                       0,404     (0,102) 0,371     (0,101) 0,349     (0,100) 0,333     (0,099) 0,333     (0,099)
Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                                          
  Tidak                                                                                 1,000     (0,000) 1,000     (0,000) 1,000     (0,000)                  
  Rendah                                                                                1,299  ** (0,123) 1,234   * (0,128) 1,201     (0,125)                  
  Tinggi                                                                                1,543 *** (0,166) 1,383   * (0,181) 1,319   * (0,174)                  
Pendidikan orang tua (ibu-ayah)                                                                                                                                
  Rendah                                                                                                  1,250   * (0,140) 1,236     (0,142) 1,236     (0,142)
  Ibu < ayah                                                                                              1,108     (0,148) 1,105     (0,149) 1,105     (0,149)
  Ibu > ayah                                                                                              1,120     (0,147) 1,124     (0,148) 1,124     (0,148)
  Tinggi                                                                                                  1,000     (0,000) 1,000     (0,000) 1,000     (0,000)
Indeks kekayaan rumah tangga                                                                                                                                   
  Miskin                                                                                                  1,154     (0,169) 1,130     (0,166) 1,130     (0,166)
  Menengah                                                                                                1,113     (0,148) 1,115     (0,149) 1,115     (0,149)
  Kaya                                                                                                    1,000     (0,000) 1,000     (0,000) 1,000     (0,000)
Wilayah tempat tinggal                                                                                                                                         
  Perdesaan                                                                                               0,871     (0,085) 0,876     (0,086) 0,876     (0,086)
  Perkotaan                                                                                               1,000     (0,000) 1,000     (0,000) 1,000     (0,000)
% Perempuan yang menyatakan bermasalah menjangkau jarak faskes                                            1,504     (0,444) 1,410     (0,416) 1,410     (0,416)
Jenis kelamin anak                                                                                                                                             
  Perempuan                                                                                                                 1,000     (0,000) 1,000     (0,000)
  Laki-laki                                                                                                                 1,215   * (0,098) 1,215   * (0,098)
Urutan dan jarak kelahiran sebelumnya                                                                                                                          
  Pertama                                                                                                                   1,517 *** (0,186) 1,517 *** (0,186)
  2 dan >=24 bulan                                                                                                          1,000     (0,000) 1,000     (0,000)
  2 dan <24 bulan                                                                                                           1,702   * (0,371) 1,703   * (0,372)
  >=3 dan >=24 bulan                                                                                                        1,166     (0,147) 1,166     (0,147)
  >=3 dan <24 bulan                                                                                                         2,600 *** (0,423) 2,600 *** (0,423)
Umur ibu saat melahirkan                                                                                                                                       
  <20                                                                                                                       1,455  ** (0,202) 1,455  ** (0,202)
  20-29                                                                                                                     1,000     (0,000) 1,000     (0,000)
  30-39                                                                                                                     1,214     (0,127) 1,214     (0,127)
  40-49                                                                                                                     2,509 *** (0,455) 2,508 *** (0,455)
Interval umur x Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                          
  0-6 hari x Tidak                                                                                                                            1,000     (0,000)
  0-6 hari x Rendah                                                                                                                           1,220     (0,139)
  0-6 hari x Tinggi                                                                                                                           1,248     (0,179)
  7-28 hari x Tidak                                                                                                                           1,000     (0,000)
  7-28 hari x Rendah                                                                                                                          1,129     (0,240)
  7-28 hari x Tinggi                                                                                                                          1,592   * (0,363)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

. collect export ".\output\model.xls", as(xls) sheet(nndeath_side_se) replace
(collection default exported to file .\output\model.xls)

. 
. *bawah
. collect style autolevels result _r_b _r_se, clear

. quietly collect layout (colname#result result[chi2 chi2_c N N_g]) (cmdset)

. collect style _cons first

. collect style header result[N chi2 chi2_c N_g], level(label)

. collect label levels result N "Jumlah Observasi" chi2 "Chi2-simultan"           ///
>                 chi2_c "Chi2 vs fix" N_g "Jumlah Komunitas", modify

. collect style cell result[_r_b chi2 chi2_c], nformat(%6,3fc)

. collect style cell result[_r_se], nformat(%6,3fc) sformat("(%s)")

. collect style cell result[N N_g], nformat(%9,0fc)

. collect stars _r_p "0.001" "***" "0.01" "**" "0.05" "*", attach(_r_b)

. collect style column, dups(center)

. collect style row stack, nobinder delimiter(" x ")

. collect style header result, level(hide)

. collect style cell, font( Times New Roman, size(8) )

. collect style cell border_block, border(right, pattern(nil))

. collect preview

------------------------------------------------------------------------------------------------------------------
                                                                             1        2        3        4        5
------------------------------------------------------------------------------------------------------------------
Intercept                                                             0,012*** 0,010*** 0,009*** 0,006*** 0,006***
                                                                       (0,001)  (0,001)  (0,001)  (0,001)  (0,001)
Interval umur                                                                                                     
  0-6 hari                                                               1,000    1,000    1,000    1,000    1,000
                                                                       (0,000)  (0,000)  (0,000)  (0,000)  (0,000)
  7-28 hari                                                           0,266*** 0,266*** 0,266*** 0,266*** 0,257***
                                                                       (0,026)  (0,026)  (0,026)  (0,026)  (0,038)
var(_cons[psu])                                                          0,404    0,371    0,349    0,333    0,333
                                                                       (0,102)  (0,101)  (0,100)  (0,099)  (0,099)
Status deprivasi lingkungan rumah tangga (3 kategori)                                                             
  Tidak                                                                           1,000    1,000    1,000         
                                                                                (0,000)  (0,000)  (0,000)         
  Rendah                                                                        1,299**   1,234*    1,201         
                                                                                (0,123)  (0,128)  (0,125)         
  Tinggi                                                                       1,543***   1,383*   1,319*         
                                                                                (0,166)  (0,181)  (0,174)         
Pendidikan orang tua (ibu-ayah)                                                                                   
  Rendah                                                                                  1,250*    1,236    1,236
                                                                                         (0,140)  (0,142)  (0,142)
  Ibu < ayah                                                                               1,108    1,105    1,105
                                                                                         (0,148)  (0,149)  (0,149)
  Ibu > ayah                                                                               1,120    1,124    1,124
                                                                                         (0,147)  (0,148)  (0,148)
  Tinggi                                                                                   1,000    1,000    1,000
                                                                                         (0,000)  (0,000)  (0,000)
Indeks kekayaan rumah tangga                                                                                      
  Miskin                                                                                   1,154    1,130    1,130
                                                                                         (0,169)  (0,166)  (0,166)
  Menengah                                                                                 1,113    1,115    1,115
                                                                                         (0,148)  (0,149)  (0,149)
  Kaya                                                                                     1,000    1,000    1,000
                                                                                         (0,000)  (0,000)  (0,000)
Wilayah tempat tinggal                                                                                            
  Perdesaan                                                                                0,871    0,876    0,876
                                                                                         (0,085)  (0,086)  (0,086)
  Perkotaan                                                                                1,000    1,000    1,000
                                                                                         (0,000)  (0,000)  (0,000)
% Perempuan yang menyatakan bermasalah menjangkau jarak faskes                             1,504    1,410    1,410
                                                                                         (0,444)  (0,416)  (0,416)
Jenis kelamin anak                                                                                                
  Perempuan                                                                                         1,000    1,000
                                                                                                  (0,000)  (0,000)
  Laki-laki                                                                                        1,215*   1,215*
                                                                                                  (0,098)  (0,098)
Urutan dan jarak kelahiran sebelumnya                                                                             
  Pertama                                                                                        1,517*** 1,517***
                                                                                                  (0,186)  (0,186)
  2 dan >=24 bulan                                                                                  1,000    1,000
                                                                                                  (0,000)  (0,000)
  2 dan <24 bulan                                                                                  1,702*   1,703*
                                                                                                  (0,371)  (0,372)
  >=3 dan >=24 bulan                                                                                1,166    1,166
                                                                                                  (0,147)  (0,147)
  >=3 dan <24 bulan                                                                              2,600*** 2,600***
                                                                                                  (0,423)  (0,423)
Umur ibu saat melahirkan                                                                                          
  <20                                                                                             1,455**  1,455**
                                                                                                  (0,202)  (0,202)
  20-29                                                                                             1,000    1,000
                                                                                                  (0,000)  (0,000)
  30-39                                                                                             1,214    1,214
                                                                                                  (0,127)  (0,127)
  40-49                                                                                          2,509*** 2,508***
                                                                                                  (0,455)  (0,455)
Interval umur x Status deprivasi lingkungan rumah tangga (3 kategori)                                             
  0-6 hari x Tidak                                                                                           1,000
                                                                                                           (0,000)
  0-6 hari x Rendah                                                                                          1,220
                                                                                                           (0,139)
  0-6 hari x Tinggi                                                                                          1,248
                                                                                                           (0,179)
  7-28 hari x Tidak                                                                                          1,000
                                                                                                           (0,000)
  7-28 hari x Rendah                                                                                         1,129
                                                                                                           (0,240)
  7-28 hari x Tinggi                                                                                        1,592*
                                                                                                           (0,363)
Chi2-simultan                                                          184,412  202,256  211,729  294,522  291,989
Chi2 vs fix                                                             20,879   17,586   15,678   14,395   14,399
Jumlah Observasi                                                        69.109   69.109   69.109   69.109   69.109
Jumlah Komunitas                                                         1.970    1.970    1.970    1.970    1.970
------------------------------------------------------------------------------------------------------------------

. collect export ".\output\model.xls", as(xls) sheet(nndeath_down_se, replace) modify
(collection default exported to file .\output\model.xls)

. 
. /*
> ------------------------------------------------------------------
> 95% CI
> ------------------------------------------------------------------
> */
. 
. *samping
. collect style autolevels result _r_b _r_ci, clear

. quietly collect layout (colname) (cmdset#result[_r_b stars _r_ci])

. collect style _cons first

. collect style cell result[_r_b], nformat(%6,2fc)

. collect style cell result[_r_ci], nformat(%6,2fc) sformat("(%s)") cidelimiter("-")

. collect stars _r_p "0.001" "***" "0.01" "**" "0.05" "*"

. collect style column, dups(center)

. collect style header result, level(hide)

. collect style row stack, nobinder delimiter(" x ")

. collect style cell, font( Times New Roman, size(8) )

. collect style cell border_block, border(right, pattern(nil))

. collect preview

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                 1                      2                      3                      4                      5          
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Intercept                                                             0,01 *** (0,01-  0,01) 0,01 *** (0,01-  0,01) 0,01 *** (0,01-  0,01) 0,01 *** (0,00-  0,01) 0,01 *** (0,00-  0,01)
Interval umur                                                                                                                                                                           
  0-6 hari                                                            1,00                   1,00                   1,00                   1,00                   1,00                  
  7-28 hari                                                           0,27 *** (0,22-  0,32) 0,27 *** (0,22-  0,32) 0,27 *** (0,22-  0,32) 0,27 *** (0,22-  0,32) 0,26 *** (0,19-  0,34)
var(_cons[psu])                                                       0,40     (0,25-  0,66) 0,37     (0,22-  0,63) 0,35     (0,20-  0,61) 0,33     (0,19-  0,60) 0,33     (0,19-  0,60)
Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                                                                   
  Tidak                                                                                      1,00                   1,00                   1,00                                         
  Rendah                                                                                     1,30  ** (1,08-  1,56) 1,23   * (1,01-  1,51) 1,20     (0,98-  1,47)                       
  Tinggi                                                                                     1,54 *** (1,25-  1,91) 1,38   * (1,07-  1,79) 1,32   * (1,02-  1,71)                       
Pendidikan orang tua (ibu-ayah)                                                                                                                                                         
  Rendah                                                                                                            1,25   * (1,00-  1,56) 1,24     (0,99-  1,55) 1,24     (0,99-  1,55)
  Ibu < ayah                                                                                                        1,11     (0,85-  1,44) 1,11     (0,85-  1,44) 1,10     (0,85-  1,44)
  Ibu > ayah                                                                                                        1,12     (0,87-  1,45) 1,12     (0,87-  1,45) 1,12     (0,87-  1,45)
  Tinggi                                                                                                            1,00                   1,00                   1,00                  
Indeks kekayaan rumah tangga                                                                                                                                                            
  Miskin                                                                                                            1,15     (0,87-  1,54) 1,13     (0,85-  1,51) 1,13     (0,85-  1,51)
  Menengah                                                                                                          1,11     (0,86-  1,44) 1,12     (0,86-  1,45) 1,12     (0,86-  1,45)
  Kaya                                                                                                              1,00                   1,00                   1,00                  
Wilayah tempat tinggal                                                                                                                                                                  
  Perdesaan                                                                                                         0,87     (0,72-  1,06) 0,88     (0,72-  1,06) 0,88     (0,72-  1,06)
  Perkotaan                                                                                                         1,00                   1,00                   1,00                  
% Perempuan yang menyatakan bermasalah menjangkau jarak faskes                                                      1,50     (0,84-  2,68) 1,41     (0,79-  2,51) 1,41     (0,79-  2,51)
Jenis kelamin anak                                                                                                                                                                      
  Perempuan                                                                                                                                1,00                   1,00                  
  Laki-laki                                                                                                                                1,21   * (1,04-  1,42) 1,21   * (1,04-  1,42)
Urutan dan jarak kelahiran sebelumnya                                                                                                                                                   
  Pertama                                                                                                                                  1,52 *** (1,19-  1,93) 1,52 *** (1,19-  1,93)
  2 dan >=24 bulan                                                                                                                         1,00                   1,00                  
  2 dan <24 bulan                                                                                                                          1,70   * (1,11-  2,61) 1,70   * (1,11-  2,61)
  >=3 dan >=24 bulan                                                                                                                       1,17     (0,91-  1,49) 1,17     (0,91-  1,49)
  >=3 dan <24 bulan                                                                                                                        2,60 *** (1,89-  3,58) 2,60 *** (1,89-  3,58)
Umur ibu saat melahirkan                                                                                                                                                                
  <20                                                                                                                                      1,45  ** (1,11-  1,91) 1,46  ** (1,11-  1,91)
  20-29                                                                                                                                    1,00                   1,00                  
  30-39                                                                                                                                    1,21     (0,99-  1,49) 1,21     (0,99-  1,49)
  40-49                                                                                                                                    2,51 *** (1,76-  3,58) 2,51 *** (1,76-  3,58)
Interval umur x Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                                                   
  0-6 hari x Tidak                                                                                                                                                1,00                  
  0-6 hari x Rendah                                                                                                                                               1,22     (0,97-  1,53)
  0-6 hari x Tinggi                                                                                                                                               1,25     (0,94-  1,65)
  7-28 hari x Tidak                                                                                                                                               1,00                  
  7-28 hari x Rendah                                                                                                                                              1,13     (0,74-  1,71)
  7-28 hari x Tinggi                                                                                                                                              1,59   * (1,02-  2,49)
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. collect export ".\output\model.xls", as(xls) sheet(nndeath_side_ci) modify
(collection default exported to file .\output\model.xls)

. 
. *bawah
. collect style autolevels result _r_b _r_ci, clear

. quietly collect layout (colname#result result[chi2 chi2_c N N_g]) (cmdset)

. collect style _cons first

. collect style header result[N chi2 chi2_c N_g], level(label)

. collect label levels result N "Jumlah Observasi" chi2 "Chi2-simultan"           ///
>                 chi2_c "Chi2 vs fix" N_g "Jumlah Komunitas", modify

. collect style cell result[_r_b chi2 chi2_c], nformat(%6,2fc)

. collect style cell result[_r_ci], nformat(%6,2fc) sformat("(%s)") cidelimiter("-")

. collect style cell result[N N_g], nformat(%9,0fc)

. collect stars _r_p "0.001" "***" "0.01" "**" "0.05" "*", attach(_r_b)

. collect style column, dups(center)

. collect style row stack, nobinder delimiter(" x ")

. collect style header result, level(hide)

. collect style cell, font( Times New Roman, size(8) )

. collect style cell border_block, border(right, pattern(nil))

. collect preview

-------------------------------------------------------------------------------------------------------------------------------------------
                                                                                  1             2             3             4             5
-------------------------------------------------------------------------------------------------------------------------------------------
Intercept                                                                   0,01***       0,01***       0,01***       0,01***       0,01***
                                                                      (0,01-  0,01) (0,01-  0,01) (0,01-  0,01) (0,00-  0,01) (0,00-  0,01)
Interval umur                                                                                                                              
  0-6 hari                                                                     1,00          1,00          1,00          1,00          1,00
  7-28 hari                                                                 0,27***       0,27***       0,27***       0,27***       0,26***
                                                                      (0,22-  0,32) (0,22-  0,32) (0,22-  0,32) (0,22-  0,32) (0,19-  0,34)
var(_cons[psu])                                                                0,40          0,37          0,35          0,33          0,33
                                                                      (0,25-  0,66) (0,22-  0,63) (0,20-  0,61) (0,19-  0,60) (0,19-  0,60)
Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                      
  Tidak                                                                                      1,00          1,00          1,00              
  Rendah                                                                                   1,30**         1,23*          1,20              
                                                                                    (1,08-  1,56) (1,01-  1,51) (0,98-  1,47)              
  Tinggi                                                                                  1,54***         1,38*         1,32*              
                                                                                    (1,25-  1,91) (1,07-  1,79) (1,02-  1,71)              
Pendidikan orang tua (ibu-ayah)                                                                                                            
  Rendah                                                                                                  1,25*          1,24          1,24
                                                                                                  (1,00-  1,56) (0,99-  1,55) (0,99-  1,55)
  Ibu < ayah                                                                                               1,11          1,11          1,10
                                                                                                  (0,85-  1,44) (0,85-  1,44) (0,85-  1,44)
  Ibu > ayah                                                                                               1,12          1,12          1,12
                                                                                                  (0,87-  1,45) (0,87-  1,45) (0,87-  1,45)
  Tinggi                                                                                                   1,00          1,00          1,00
Indeks kekayaan rumah tangga                                                                                                               
  Miskin                                                                                                   1,15          1,13          1,13
                                                                                                  (0,87-  1,54) (0,85-  1,51) (0,85-  1,51)
  Menengah                                                                                                 1,11          1,12          1,12
                                                                                                  (0,86-  1,44) (0,86-  1,45) (0,86-  1,45)
  Kaya                                                                                                     1,00          1,00          1,00
Wilayah tempat tinggal                                                                                                                     
  Perdesaan                                                                                                0,87          0,88          0,88
                                                                                                  (0,72-  1,06) (0,72-  1,06) (0,72-  1,06)
  Perkotaan                                                                                                1,00          1,00          1,00
% Perempuan yang menyatakan bermasalah menjangkau jarak faskes                                             1,50          1,41          1,41
                                                                                                  (0,84-  2,68) (0,79-  2,51) (0,79-  2,51)
Jenis kelamin anak                                                                                                                         
  Perempuan                                                                                                              1,00          1,00
  Laki-laki                                                                                                             1,21*         1,21*
                                                                                                                (1,04-  1,42) (1,04-  1,42)
Urutan dan jarak kelahiran sebelumnya                                                                                                      
  Pertama                                                                                                             1,52***       1,52***
                                                                                                                (1,19-  1,93) (1,19-  1,93)
  2 dan >=24 bulan                                                                                                       1,00          1,00
  2 dan <24 bulan                                                                                                       1,70*         1,70*
                                                                                                                (1,11-  2,61) (1,11-  2,61)
  >=3 dan >=24 bulan                                                                                                     1,17          1,17
                                                                                                                (0,91-  1,49) (0,91-  1,49)
  >=3 dan <24 bulan                                                                                                   2,60***       2,60***
                                                                                                                (1,89-  3,58) (1,89-  3,58)
Umur ibu saat melahirkan                                                                                                                   
  <20                                                                                                                  1,45**        1,46**
                                                                                                                (1,11-  1,91) (1,11-  1,91)
  20-29                                                                                                                  1,00          1,00
  30-39                                                                                                                  1,21          1,21
                                                                                                                (0,99-  1,49) (0,99-  1,49)
  40-49                                                                                                               2,51***       2,51***
                                                                                                                (1,76-  3,58) (1,76-  3,58)
Interval umur x Status deprivasi lingkungan rumah tangga (3 kategori)                                                                      
  0-6 hari x Tidak                                                                                                                     1,00
  0-6 hari x Rendah                                                                                                                    1,22
                                                                                                                              (0,97-  1,53)
  0-6 hari x Tinggi                                                                                                                    1,25
                                                                                                                              (0,94-  1,65)
  7-28 hari x Tidak                                                                                                                    1,00
  7-28 hari x Rendah                                                                                                                   1,13
                                                                                                                              (0,74-  1,71)
  7-28 hari x Tinggi                                                                                                                  1,59*
                                                                                                                              (1,02-  2,49)
Chi2-simultan                                                                184,41        202,26        211,73        294,52        291,99
Chi2 vs fix                                                                   20,88         17,59         15,68         14,39         14,40
Jumlah Observasi                                                             69.109        69.109        69.109        69.109        69.109
Jumlah Komunitas                                                              1.970         1.970         1.970         1.970         1.970
-------------------------------------------------------------------------------------------------------------------------------------------

. collect export ".\output\model.xls", as(xls) sheet(nndeath_down_ci, replace) modify
(collection default exported to file .\output\model.xls)

. 
. 
. /*
> ================================================================================
> B. IDEATH                                                                                                       
> ================================================================================
> */
. 
. collect clear

. 
. /*
> ******************************************************************
> ESTIMASI                                                                                                        [done]
> ******************************************************************
> */
. 
. *\Model 1 - baseline hazard
. #delimit ;
delimiter now ;
. collect: melogit ideath i.interval
>                  if data == 2 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -14363.519  
Iteration 1:   log likelihood = -5921.4864  
Iteration 2:   log likelihood = -5835.1437  
Iteration 3:   log likelihood = -5796.1787  
Iteration 4:   log likelihood = -5796.0762  
Iteration 5:   log likelihood = -5796.0762  

Refining starting values:

Grid node 0:   log likelihood = -5871.2125

Fitting full model:

Iteration 0:   log likelihood = -5871.2125  (not concave)
Iteration 1:   log likelihood = -5791.9767  
Iteration 2:   log likelihood = -5780.4491  
Iteration 3:   log likelihood = -5780.3705  
Iteration 4:   log likelihood = -5780.3705  

Mixed-effects logistic regression               Number of obs     =    137,214
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =         12
                                                              avg =       69.7
                                                              max =        212

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(3)      =     315.55
Log likelihood = -5780.3705                     Prob > chi2       =     0.0000
----------------------------------------------------------------------------------
          ideath | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
        interval |
      7-28 hari  |   .2656665   .0259147   -13.59   0.000     .2194347    .3216387
29 hari-5 bulan  |   .4582302   .0367156    -9.74   0.000      .391635    .5361497
     6-11 bulan  |   .2777338    .026784   -13.28   0.000     .2299011    .3355186
                 |
           _cons |   .0124528    .000725   -75.34   0.000       .01111    .0139579
-----------------+----------------------------------------------------------------
psu              |
       var(_cons)|   .3204278   .0675125                      .2120246    .4842549
----------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 31.41       Prob >= chibar2 = 0.0000

. #delimit cr
delimiter now cr
. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |   .0887539   .0170403      .0605457    .1283092
------------------------------------------------------------------------------

. 
. *\Model 2 - tanpa kontrol
. #delimit ;
delimiter now ;
. collect: melogit ideath i.interval i.depriv
>                  if data == 2 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -14361.723  
Iteration 1:   log likelihood =  -5905.447  
Iteration 2:   log likelihood = -5814.1161  
Iteration 3:   log likelihood = -5766.1324  
Iteration 4:   log likelihood = -5765.9138  
Iteration 5:   log likelihood = -5765.9138  

Refining starting values:

Grid node 0:   log likelihood = -5848.4143

Fitting full model:

Iteration 0:   log likelihood = -5848.4143  (not concave)
Iteration 1:   log likelihood = -5763.2488  
Iteration 2:   log likelihood = -5755.7906  
Iteration 3:   log likelihood = -5755.7118  
Iteration 4:   log likelihood = -5755.7117  

Mixed-effects logistic regression               Number of obs     =    137,214
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =         12
                                                              avg =       69.7
                                                              max =        212

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(5)      =     365.81
Log likelihood = -5755.7117                     Prob > chi2       =     0.0000
----------------------------------------------------------------------------------
          ideath | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
        interval |
      7-28 hari  |   .2655891   .0259071   -13.59   0.000     .2193709    .3215447
29 hari-5 bulan  |   .4580904   .0367042    -9.74   0.000     .3915157    .5359857
     6-11 bulan  |   .2776678   .0267776   -13.29   0.000     .2298464    .3354387
                 |
          depriv |
         Rendah  |   1.434279   .1089236     4.75   0.000     1.235921    1.664472
         Tinggi  |   1.776522   .1507115     6.77   0.000     1.504384    2.097888
                 |
           _cons |   .0102146   .0006937   -67.50   0.000     .0089416    .0116688
-----------------+----------------------------------------------------------------
psu              |
       var(_cons)|   .2603589    .065838                      .1586082    .4273848
----------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 20.40       Prob >= chibar2 = 0.0000

. #delimit cr
delimiter now cr
. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |   .0733358   .0171847      .0459937    .1149733
------------------------------------------------------------------------------

. 
. *\Model 3 - kontrol: sosek
. #delimit ;
delimiter now ;
. collect: melogit ideath i.interval i.depriv
>                  b3.pareduc b2.wealth b1.reside pwdisthfac
>                  if data == 2 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -14360.809  
Iteration 1:   log likelihood = -5897.3363  
Iteration 2:   log likelihood = -5804.7571  
Iteration 3:   log likelihood = -5751.6459  
Iteration 4:   log likelihood = -5751.3323  
Iteration 5:   log likelihood = -5751.3322  

Refining starting values:

Grid node 0:   log likelihood = -5837.2435

Fitting full model:

Iteration 0:   log likelihood = -5837.2435  (not concave)
Iteration 1:   log likelihood = -5747.0917  
Iteration 2:   log likelihood = -5743.1353  
Iteration 3:   log likelihood = -5743.1253  
Iteration 4:   log likelihood = -5743.1253  

Mixed-effects logistic regression               Number of obs     =    137,214
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =         12
                                                              avg =       69.7
                                                              max =        212

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(12)     =     392.56
Log likelihood = -5743.1253                     Prob > chi2       =     0.0000
----------------------------------------------------------------------------------
          ideath | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
        interval |
      7-28 hari  |   .2655771   .0259062   -13.59   0.000     .2193606    .3215309
29 hari-5 bulan  |   .4580359   .0367005    -9.74   0.000      .391468    .5359233
     6-11 bulan  |   .2776868   .0267798   -13.29   0.000     .2298617    .3354626
                 |
          depriv |
         Rendah  |   1.289267    .107365     3.05   0.002     1.095111    1.517845
         Tinggi  |   1.436021   .1482356     3.51   0.000     1.172989    1.758035
                 |
         pareduc |
         Rendah  |   1.327973   .1162694     3.24   0.001      1.11857    1.576578
     Ibu < ayah  |   1.199743   .1238196     1.76   0.078     .9800309    1.468712
     Ibu > ayah  |   1.041944   .1117558     0.38   0.702     .8443976    1.285706
                 |
          wealth |
         Miskin  |   1.231479   .1470123     1.74   0.081     .9745669    1.556117
       Menengah  |   1.104846   .1220352     0.90   0.367     .8897801    1.371895
                 |
          reside |
      Perdesaan  |   .9293393   .0728156    -0.94   0.350     .7970417    1.083597
                 |
      pwdisthfac |   1.636225   .3741332     2.15   0.031     1.045226    2.561389
           _cons |   .0086477   .0009061   -45.34   0.000     .0070423     .010619
-----------------+----------------------------------------------------------------
psu              |
       var(_cons)|   .2317388    .064732                      .1340391     .400651
----------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 16.41       Prob >= chibar2 = 0.0000

. #delimit cr
delimiter now cr
. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |   .0658049   .0171718       .039148    .1085622
------------------------------------------------------------------------------

. 
. *\Model 4 - kontrol: full
. #delimit ;
delimiter now ;
. collect: melogit ideath i.interval i.depriv i.chsex b1.bordin b1.mageb
>                  b3.pareduc b2.wealth b1.reside pwdisthfac
>                  if data == 2 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -14357.807  
Iteration 1:   log likelihood = -5871.0032  
Iteration 2:   log likelihood = -5777.4849  
Iteration 3:   log likelihood = -5706.8793  
Iteration 4:   log likelihood = -5706.2103  
Iteration 5:   log likelihood =   -5706.21  

Refining starting values:

Grid node 0:   log likelihood = -5795.7086

Fitting full model:

Iteration 0:   log likelihood = -5795.7086  (not concave)
Iteration 1:   log likelihood = -5703.0918  
Iteration 2:   log likelihood = -5699.7602  
Iteration 3:   log likelihood = -5699.7538  
Iteration 4:   log likelihood = -5699.7538  

Mixed-effects logistic regression               Number of obs     =    137,214
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =         12
                                                              avg =       69.7
                                                              max =        212

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(20)     =     485.70
Log likelihood = -5699.7538                     Prob > chi2       =     0.0000
-------------------------------------------------------------------------------------
             ideath | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------------+----------------------------------------------------------------
           interval |
         7-28 hari  |   .2657731   .0259334   -13.58   0.000     .2195093    .3217873
   29 hari-5 bulan  |   .4586469   .0367666    -9.72   0.000     .3919614    .5366776
        6-11 bulan  |   .2781218   .0268305   -13.27   0.000     .2302075    .3360089
                    |
             depriv |
            Rendah  |   1.248635   .1042267     2.66   0.008      1.06019    1.470576
            Tinggi  |   1.366121   .1416307     3.01   0.003     1.114916    1.673926
                    |
              chsex |
         Laki-laki  |   1.106573   .0707162     1.58   0.113     .9763004    1.254228
                    |
             bordin |
           Pertama  |   1.399354   .1403228     3.35   0.001     1.149666     1.70327
   2 dan <24 bulan  |   2.021406   .3308012     4.30   0.000     1.466747    2.785813
>=3 dan >=24 bulan  |   1.400042   .1386503     3.40   0.001      1.15304    1.699958
 >=3 dan <24 bulan  |   2.580708   .3370745     7.26   0.000      1.99784    3.333627
                    |
              mageb |
               <20  |    1.39815   .1597203     2.93   0.003     1.117674     1.74901
             30-39  |   1.167228   .0956012     1.89   0.059     .9941188     1.37048
             40-49  |   1.819931   .2775349     3.93   0.000     1.349736    2.453924
                    |
            pareduc |
            Rendah  |   1.277914   .1145714     2.74   0.006     1.071981    1.523408
        Ibu < ayah  |   1.164636   .1214974     1.46   0.144     .9492723    1.428859
        Ibu > ayah  |   1.041133   .1118573     0.38   0.708     .8434408    1.285161
                    |
             wealth |
            Miskin  |   1.218991   .1461906     1.65   0.099     .9636468    1.541995
          Menengah  |   1.120126    .123908     1.03   0.305     .9017939    1.391318
                    |
             reside |
         Perdesaan  |   .9351631   .0729803    -0.86   0.390     .8025266    1.089721
                    |
         pwdisthfac |   1.510333   .3427737     1.82   0.069      .968034    2.356432
              _cons |   .0056092   .0007428   -39.14   0.000      .004327    .0072714
--------------------+----------------------------------------------------------------
psu                 |
          var(_cons)|   .2048346   .0636376                      .1114176    .3765761
-------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 12.91       Prob >= chibar2 = 0.0002

. #delimit cr
delimiter now cr
. estimate store mdl_b4

. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |   .0586129   .0171424      .0327575    .1027088
------------------------------------------------------------------------------

. 
. *\Model 5 - interaksi periode umur
. #delimit ;
delimiter now ;
. collect: melogit ideath i.interval i.interval#i.depriv i.chsex b1.bordin 
>                  b1.mageb b3.pareduc b2.wealth b1.reside pwdisthfac
>                  if data == 2 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -14357.603  
Iteration 1:   log likelihood =  -5869.592  
Iteration 2:   log likelihood = -5768.7134  
Iteration 3:   log likelihood = -5702.3801  
Iteration 4:   log likelihood = -5701.6619  
Iteration 5:   log likelihood = -5701.6612  
Iteration 6:   log likelihood = -5701.6612  

Refining starting values:

Grid node 0:   log likelihood =  -5791.141

Fitting full model:

Iteration 0:   log likelihood =  -5791.141  (not concave)
Iteration 1:   log likelihood = -5698.5333  
Iteration 2:   log likelihood = -5695.1982  
Iteration 3:   log likelihood = -5695.1918  
Iteration 4:   log likelihood = -5695.1918  

Mixed-effects logistic regression               Number of obs     =    137,214
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =         12
                                                              avg =       69.7
                                                              max =        212

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(26)     =     475.88
Log likelihood = -5695.1918                     Prob > chi2       =     0.0000
-----------------------------------------------------------------------------------------
                 ideath | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
------------------------+----------------------------------------------------------------
               interval |
             7-28 hari  |   .2566855   .0375735    -9.29   0.000      .192665    .3419793
       29 hari-5 bulan  |   .3808805    .048137    -7.64   0.000      .297311      .48794
            6-11 bulan  |    .215419    .033984    -9.73   0.000     .1581249    .2934727
                        |
        interval#depriv |
       0-6 hari#Rendah  |   1.141168   .1257588     1.20   0.231     .9194875    1.416295
       0-6 hari#Tinggi  |    1.11061   .1487977     0.78   0.434       .85412    1.444123
      7-28 hari#Rendah  |   1.056574   .2224907     0.26   0.794      .699288    1.596408
      7-28 hari#Tinggi  |   1.415072   .3143246     1.56   0.118     .9155968     2.18702
29 hari-5 bulan#Rendah  |   1.476911   .2369703     2.43   0.015     1.078398    2.022691
29 hari-5 bulan#Tinggi  |   1.666956   .2992379     2.85   0.004     1.172529     2.36987
     6-11 bulan#Rendah  |   1.577293   .3270411     2.20   0.028     1.050562    2.368118
     6-11 bulan#Tinggi  |   1.967173   .4372124     3.04   0.002     1.272505    3.041064
                        |
                  chsex |
             Laki-laki  |   1.106505   .0707076     1.58   0.113     .9762476    1.254141
                        |
                 bordin |
               Pertama  |   1.399296   .1403219     3.35   0.001     1.149611    1.703211
       2 dan <24 bulan  |   2.021533    .330792     4.30   0.000     1.466882    2.785907
    >=3 dan >=24 bulan  |     1.3999    .138639     3.40   0.001     1.152918    1.699792
     >=3 dan <24 bulan  |   2.581505   .3371165     7.26   0.000     1.998551    3.334499
                        |
                  mageb |
                   <20  |   1.398493   .1597444     2.94   0.003     1.117972    1.749402
                 30-39  |    1.16709   .0955873     1.89   0.059     .9940065    1.370313
                 40-49  |    1.81967   .2774505     3.93   0.000     1.349607    2.453454
                        |
                pareduc |
                Rendah  |   1.277998   .1145635     2.74   0.006     1.072077    1.523472
            Ibu < ayah  |   1.164719   .1214977     1.46   0.144     .9493535    1.428941
            Ibu > ayah  |   1.041093   .1118471     0.37   0.708      .843418    1.285097
                        |
                 wealth |
                Miskin  |   1.218981   .1462261     1.65   0.099     .9635825    1.542074
              Menengah  |   1.119994   .1239278     1.02   0.306     .9016329    1.391238
                        |
                 reside |
             Perdesaan  |   .9351599   .0729855    -0.86   0.390     .8025147     1.08973
                        |
             pwdisthfac |   1.510203   .3426335     1.82   0.069     .9680899    2.355891
                  _cons |   .0060614   .0008257   -37.48   0.000     .0046411    .0079164
------------------------+----------------------------------------------------------------
psu                     |
              var(_cons)|   .2049167    .063609                      .1115199    .3765324
-----------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 12.94       Prob >= chibar2 = 0.0002

. #delimit cr
delimiter now cr
. estimate store mdl_b5

. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |    .058635   .0171339      .0327866    .1026981
------------------------------------------------------------------------------

. 
. *\\likelihood ratio test model a5 vs model a4
. lrtest mdl_b4 mdl_b5

Likelihood-ratio test
Assumption: mdl_b4 nested within mdl_b5

 LR chi2(6) =   9.12
Prob > chi2 = 0.1667

. 
. /*
> ******************************************************************
> SAVE                                                                                                            [done]
> ******************************************************************
> */
. 
. /*
> ------------------------------------------------------------------
> SE
> ------------------------------------------------------------------
> */
. 
. *samping
. collect style autolevels result _r_b _r_se, clear

. quietly collect layout (colname) (cmdset#result[_r_b stars _r_se])

. collect style _cons first

. collect style cell result[_r_b], nformat(%6,3fc)

. collect style cell result[_r_se], nformat(%6,3fc) sformat("(%s)")

. collect stars _r_p "0.001" "***" "0.01" "**" "0.05" "*"

. collect style column, dups(center)

. collect style header result, level(hide)

. collect style row stack, nobinder delimiter(" x ")

. collect style cell, font( Times New Roman, size(8) )

. collect style cell border_block, border(right, pattern(nil))

. collect preview

---------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                              1                 2                 3                 4                 5        
---------------------------------------------------------------------------------------------------------------------------------------------------------------
Intercept                                                             0,012 *** (0,001) 0,010 *** (0,001) 0,009 *** (0,001) 0,006 *** (0,001) 0,006 *** (0,001)
Interval umur                                                                                                                                                  
  0-6 hari                                                            1,000     (0,000) 1,000     (0,000) 1,000     (0,000) 1,000     (0,000) 1,000     (0,000)
  7-28 hari                                                           0,266 *** (0,026) 0,266 *** (0,026) 0,266 *** (0,026) 0,266 *** (0,026) 0,257 *** (0,038)
  29 hari-5 bulan                                                     0,458 *** (0,037) 0,458 *** (0,037) 0,458 *** (0,037) 0,459 *** (0,037) 0,381 *** (0,048)
  6-11 bulan                                                          0,278 *** (0,027) 0,278 *** (0,027) 0,278 *** (0,027) 0,278 *** (0,027) 0,215 *** (0,034)
var(_cons[psu])                                                       0,320     (0,068) 0,260     (0,066) 0,232     (0,065) 0,205     (0,064) 0,205     (0,064)
Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                                          
  Tidak                                                                                 1,000     (0,000) 1,000     (0,000) 1,000     (0,000)                  
  Rendah                                                                                1,434 *** (0,109) 1,289  ** (0,107) 1,249  ** (0,104)                  
  Tinggi                                                                                1,777 *** (0,151) 1,436 *** (0,148) 1,366  ** (0,142)                  
Pendidikan orang tua (ibu-ayah)                                                                                                                                
  Rendah                                                                                                  1,328  ** (0,116) 1,278  ** (0,115) 1,278  ** (0,115)
  Ibu < ayah                                                                                              1,200     (0,124) 1,165     (0,121) 1,165     (0,121)
  Ibu > ayah                                                                                              1,042     (0,112) 1,041     (0,112) 1,041     (0,112)
  Tinggi                                                                                                  1,000     (0,000) 1,000     (0,000) 1,000     (0,000)
Indeks kekayaan rumah tangga                                                                                                                                   
  Miskin                                                                                                  1,231     (0,147) 1,219     (0,146) 1,219     (0,146)
  Menengah                                                                                                1,105     (0,122) 1,120     (0,124) 1,120     (0,124)
  Kaya                                                                                                    1,000     (0,000) 1,000     (0,000) 1,000     (0,000)
Wilayah tempat tinggal                                                                                                                                         
  Perdesaan                                                                                               0,929     (0,073) 0,935     (0,073) 0,935     (0,073)
  Perkotaan                                                                                               1,000     (0,000) 1,000     (0,000) 1,000     (0,000)
% Perempuan yang menyatakan bermasalah menjangkau jarak faskes                                            1,636   * (0,374) 1,510     (0,343) 1,510     (0,343)
Jenis kelamin anak                                                                                                                                             
  Perempuan                                                                                                                 1,000     (0,000) 1,000     (0,000)
  Laki-laki                                                                                                                 1,107     (0,071) 1,107     (0,071)
Urutan dan jarak kelahiran sebelumnya                                                                                                                          
  Pertama                                                                                                                   1,399 *** (0,140) 1,399 *** (0,140)
  2 dan >=24 bulan                                                                                                          1,000     (0,000) 1,000     (0,000)
  2 dan <24 bulan                                                                                                           2,021 *** (0,331) 2,022 *** (0,331)
  >=3 dan >=24 bulan                                                                                                        1,400 *** (0,139) 1,400 *** (0,139)
  >=3 dan <24 bulan                                                                                                         2,581 *** (0,337) 2,582 *** (0,337)
Umur ibu saat melahirkan                                                                                                                                       
  <20                                                                                                                       1,398  ** (0,160) 1,398  ** (0,160)
  20-29                                                                                                                     1,000     (0,000) 1,000     (0,000)
  30-39                                                                                                                     1,167     (0,096) 1,167     (0,096)
  40-49                                                                                                                     1,820 *** (0,278) 1,820 *** (0,277)
Interval umur x Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                          
  0-6 hari x Tidak                                                                                                                            1,000     (0,000)
  0-6 hari x Rendah                                                                                                                           1,141     (0,126)
  0-6 hari x Tinggi                                                                                                                           1,111     (0,149)
  7-28 hari x Tidak                                                                                                                           1,000     (0,000)
  7-28 hari x Rendah                                                                                                                          1,057     (0,222)
  7-28 hari x Tinggi                                                                                                                          1,415     (0,314)
  29 hari-5 bulan x Tidak                                                                                                                     1,000     (0,000)
  29 hari-5 bulan x Rendah                                                                                                                    1,477   * (0,237)
  29 hari-5 bulan x Tinggi                                                                                                                    1,667  ** (0,299)
  6-11 bulan x Tidak                                                                                                                          1,000     (0,000)
  6-11 bulan x Rendah                                                                                                                         1,577   * (0,327)
  6-11 bulan x Tinggi                                                                                                                         1,967  ** (0,437)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

. collect export ".\output\model.xls", as(xls) sheet(ideath_side_se) modify
(collection default exported to file .\output\model.xls)

. 
. *bawah
. collect style autolevels result _r_b _r_se, clear

. quietly collect layout (colname#result result[chi2 chi2_c N N_g]) (cmdset)

. collect style _cons first

. collect style header result[N chi2 chi2_c N_g], level(label)

. collect label levels result N "Jumlah Observasi" chi2 "Chi2-simultan"           ///
>                 chi2_c "Chi2 vs fix" N_g "Jumlah Komunitas", modify

. collect style cell result[_r_b chi2 chi2_c], nformat(%6,3fc)

. collect style cell result[_r_se], nformat(%6,3fc) sformat("(%s)")

. collect style cell result[N N_g], nformat(%9,0fc)

. collect stars _r_p "0.001" "***" "0.01" "**" "0.05" "*", attach(_r_b)

. collect style column, dups(center)

. collect style row stack, nobinder delimiter(" x ")

. collect style header result, level(hide)

. collect style cell, font( Times New Roman, size(8) )

. collect style cell border_block, border(right, pattern(nil))

. collect preview

------------------------------------------------------------------------------------------------------------------
                                                                             1        2        3        4        5
------------------------------------------------------------------------------------------------------------------
Intercept                                                             0,012*** 0,010*** 0,009*** 0,006*** 0,006***
                                                                       (0,001)  (0,001)  (0,001)  (0,001)  (0,001)
Interval umur                                                                                                     
  0-6 hari                                                               1,000    1,000    1,000    1,000    1,000
                                                                       (0,000)  (0,000)  (0,000)  (0,000)  (0,000)
  7-28 hari                                                           0,266*** 0,266*** 0,266*** 0,266*** 0,257***
                                                                       (0,026)  (0,026)  (0,026)  (0,026)  (0,038)
  29 hari-5 bulan                                                     0,458*** 0,458*** 0,458*** 0,459*** 0,381***
                                                                       (0,037)  (0,037)  (0,037)  (0,037)  (0,048)
  6-11 bulan                                                          0,278*** 0,278*** 0,278*** 0,278*** 0,215***
                                                                       (0,027)  (0,027)  (0,027)  (0,027)  (0,034)
var(_cons[psu])                                                          0,320    0,260    0,232    0,205    0,205
                                                                       (0,068)  (0,066)  (0,065)  (0,064)  (0,064)
Status deprivasi lingkungan rumah tangga (3 kategori)                                                             
  Tidak                                                                           1,000    1,000    1,000         
                                                                                (0,000)  (0,000)  (0,000)         
  Rendah                                                                       1,434***  1,289**  1,249**         
                                                                                (0,109)  (0,107)  (0,104)         
  Tinggi                                                                       1,777*** 1,436***  1,366**         
                                                                                (0,151)  (0,148)  (0,142)         
Pendidikan orang tua (ibu-ayah)                                                                                   
  Rendah                                                                                 1,328**  1,278**  1,278**
                                                                                         (0,116)  (0,115)  (0,115)
  Ibu < ayah                                                                               1,200    1,165    1,165
                                                                                         (0,124)  (0,121)  (0,121)
  Ibu > ayah                                                                               1,042    1,041    1,041
                                                                                         (0,112)  (0,112)  (0,112)
  Tinggi                                                                                   1,000    1,000    1,000
                                                                                         (0,000)  (0,000)  (0,000)
Indeks kekayaan rumah tangga                                                                                      
  Miskin                                                                                   1,231    1,219    1,219
                                                                                         (0,147)  (0,146)  (0,146)
  Menengah                                                                                 1,105    1,120    1,120
                                                                                         (0,122)  (0,124)  (0,124)
  Kaya                                                                                     1,000    1,000    1,000
                                                                                         (0,000)  (0,000)  (0,000)
Wilayah tempat tinggal                                                                                            
  Perdesaan                                                                                0,929    0,935    0,935
                                                                                         (0,073)  (0,073)  (0,073)
  Perkotaan                                                                                1,000    1,000    1,000
                                                                                         (0,000)  (0,000)  (0,000)
% Perempuan yang menyatakan bermasalah menjangkau jarak faskes                            1,636*    1,510    1,510
                                                                                         (0,374)  (0,343)  (0,343)
Jenis kelamin anak                                                                                                
  Perempuan                                                                                         1,000    1,000
                                                                                                  (0,000)  (0,000)
  Laki-laki                                                                                         1,107    1,107
                                                                                                  (0,071)  (0,071)
Urutan dan jarak kelahiran sebelumnya                                                                             
  Pertama                                                                                        1,399*** 1,399***
                                                                                                  (0,140)  (0,140)
  2 dan >=24 bulan                                                                                  1,000    1,000
                                                                                                  (0,000)  (0,000)
  2 dan <24 bulan                                                                                2,021*** 2,022***
                                                                                                  (0,331)  (0,331)
  >=3 dan >=24 bulan                                                                             1,400*** 1,400***
                                                                                                  (0,139)  (0,139)
  >=3 dan <24 bulan                                                                              2,581*** 2,582***
                                                                                                  (0,337)  (0,337)
Umur ibu saat melahirkan                                                                                          
  <20                                                                                             1,398**  1,398**
                                                                                                  (0,160)  (0,160)
  20-29                                                                                             1,000    1,000
                                                                                                  (0,000)  (0,000)
  30-39                                                                                             1,167    1,167
                                                                                                  (0,096)  (0,096)
  40-49                                                                                          1,820*** 1,820***
                                                                                                  (0,278)  (0,277)
Interval umur x Status deprivasi lingkungan rumah tangga (3 kategori)                                             
  0-6 hari x Tidak                                                                                           1,000
                                                                                                           (0,000)
  0-6 hari x Rendah                                                                                          1,141
                                                                                                           (0,126)
  0-6 hari x Tinggi                                                                                          1,111
                                                                                                           (0,149)
  7-28 hari x Tidak                                                                                          1,000
                                                                                                           (0,000)
  7-28 hari x Rendah                                                                                         1,057
                                                                                                           (0,222)
  7-28 hari x Tinggi                                                                                         1,415
                                                                                                           (0,314)
  29 hari-5 bulan x Tidak                                                                                    1,000
                                                                                                           (0,000)
  29 hari-5 bulan x Rendah                                                                                  1,477*
                                                                                                           (0,237)
  29 hari-5 bulan x Tinggi                                                                                 1,667**
                                                                                                           (0,299)
  6-11 bulan x Tidak                                                                                         1,000
                                                                                                           (0,000)
  6-11 bulan x Rendah                                                                                       1,577*
                                                                                                           (0,327)
  6-11 bulan x Tinggi                                                                                      1,967**
                                                                                                           (0,437)
Chi2-simultan                                                          315,549  365,805  392,556  485,703  475,876
Chi2 vs fix                                                             31,411   20,404   16,414   12,912   12,939
Jumlah Observasi                                                       137.214  137.214  137.214  137.214  137.214
Jumlah Komunitas                                                         1.970    1.970    1.970    1.970    1.970
------------------------------------------------------------------------------------------------------------------

. collect export ".\output\model.xls", as(xls) sheet(ideath_down_se, replace) modify
(collection default exported to file .\output\model.xls)

. 
. /*
> ------------------------------------------------------------------
> 95% CI
> ------------------------------------------------------------------
> */
. 
. *samping
. collect style autolevels result _r_b _r_ci, clear

. quietly collect layout (colname) (cmdset#result[_r_b stars _r_ci])

. collect style _cons first

. collect style cell result[_r_b], nformat(%6,2fc)

. collect style cell result[_r_ci], nformat(%6,2fc) sformat("(%s)") cidelimiter("-")

. collect stars _r_p "0.001" "***" "0.01" "**" "0.05" "*"

. collect style column, dups(center)

. collect style header result, level(hide)

. collect style row stack, nobinder delimiter(" x ")

. collect style cell, font( Times New Roman, size(8) )

. collect style cell border_block, border(right, pattern(nil))

. collect preview

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                 1                      2                      3                      4                      5          
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Intercept                                                             0,01 *** (0,01-  0,01) 0,01 *** (0,01-  0,01) 0,01 *** (0,01-  0,01) 0,01 *** (0,00-  0,01) 0,01 *** (0,00-  0,01)
Interval umur                                                                                                                                                                           
  0-6 hari                                                            1,00                   1,00                   1,00                   1,00                   1,00                  
  7-28 hari                                                           0,27 *** (0,22-  0,32) 0,27 *** (0,22-  0,32) 0,27 *** (0,22-  0,32) 0,27 *** (0,22-  0,32) 0,26 *** (0,19-  0,34)
  29 hari-5 bulan                                                     0,46 *** (0,39-  0,54) 0,46 *** (0,39-  0,54) 0,46 *** (0,39-  0,54) 0,46 *** (0,39-  0,54) 0,38 *** (0,30-  0,49)
  6-11 bulan                                                          0,28 *** (0,23-  0,34) 0,28 *** (0,23-  0,34) 0,28 *** (0,23-  0,34) 0,28 *** (0,23-  0,34) 0,22 *** (0,16-  0,29)
var(_cons[psu])                                                       0,32     (0,21-  0,48) 0,26     (0,16-  0,43) 0,23     (0,13-  0,40) 0,20     (0,11-  0,38) 0,20     (0,11-  0,38)
Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                                                                   
  Tidak                                                                                      1,00                   1,00                   1,00                                         
  Rendah                                                                                     1,43 *** (1,24-  1,66) 1,29  ** (1,10-  1,52) 1,25  ** (1,06-  1,47)                       
  Tinggi                                                                                     1,78 *** (1,50-  2,10) 1,44 *** (1,17-  1,76) 1,37  ** (1,11-  1,67)                       
Pendidikan orang tua (ibu-ayah)                                                                                                                                                         
  Rendah                                                                                                            1,33  ** (1,12-  1,58) 1,28  ** (1,07-  1,52) 1,28  ** (1,07-  1,52)
  Ibu < ayah                                                                                                        1,20     (0,98-  1,47) 1,16     (0,95-  1,43) 1,16     (0,95-  1,43)
  Ibu > ayah                                                                                                        1,04     (0,84-  1,29) 1,04     (0,84-  1,29) 1,04     (0,84-  1,29)
  Tinggi                                                                                                            1,00                   1,00                   1,00                  
Indeks kekayaan rumah tangga                                                                                                                                                            
  Miskin                                                                                                            1,23     (0,97-  1,56) 1,22     (0,96-  1,54) 1,22     (0,96-  1,54)
  Menengah                                                                                                          1,10     (0,89-  1,37) 1,12     (0,90-  1,39) 1,12     (0,90-  1,39)
  Kaya                                                                                                              1,00                   1,00                   1,00                  
Wilayah tempat tinggal                                                                                                                                                                  
  Perdesaan                                                                                                         0,93     (0,80-  1,08) 0,94     (0,80-  1,09) 0,94     (0,80-  1,09)
  Perkotaan                                                                                                         1,00                   1,00                   1,00                  
% Perempuan yang menyatakan bermasalah menjangkau jarak faskes                                                      1,64   * (1,05-  2,56) 1,51     (0,97-  2,36) 1,51     (0,97-  2,36)
Jenis kelamin anak                                                                                                                                                                      
  Perempuan                                                                                                                                1,00                   1,00                  
  Laki-laki                                                                                                                                1,11     (0,98-  1,25) 1,11     (0,98-  1,25)
Urutan dan jarak kelahiran sebelumnya                                                                                                                                                   
  Pertama                                                                                                                                  1,40 *** (1,15-  1,70) 1,40 *** (1,15-  1,70)
  2 dan >=24 bulan                                                                                                                         1,00                   1,00                  
  2 dan <24 bulan                                                                                                                          2,02 *** (1,47-  2,79) 2,02 *** (1,47-  2,79)
  >=3 dan >=24 bulan                                                                                                                       1,40 *** (1,15-  1,70) 1,40 *** (1,15-  1,70)
  >=3 dan <24 bulan                                                                                                                        2,58 *** (2,00-  3,33) 2,58 *** (2,00-  3,33)
Umur ibu saat melahirkan                                                                                                                                                                
  <20                                                                                                                                      1,40  ** (1,12-  1,75) 1,40  ** (1,12-  1,75)
  20-29                                                                                                                                    1,00                   1,00                  
  30-39                                                                                                                                    1,17     (0,99-  1,37) 1,17     (0,99-  1,37)
  40-49                                                                                                                                    1,82 *** (1,35-  2,45) 1,82 *** (1,35-  2,45)
Interval umur x Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                                                   
  0-6 hari x Tidak                                                                                                                                                1,00                  
  0-6 hari x Rendah                                                                                                                                               1,14     (0,92-  1,42)
  0-6 hari x Tinggi                                                                                                                                               1,11     (0,85-  1,44)
  7-28 hari x Tidak                                                                                                                                               1,00                  
  7-28 hari x Rendah                                                                                                                                              1,06     (0,70-  1,60)
  7-28 hari x Tinggi                                                                                                                                              1,42     (0,92-  2,19)
  29 hari-5 bulan x Tidak                                                                                                                                         1,00                  
  29 hari-5 bulan x Rendah                                                                                                                                        1,48   * (1,08-  2,02)
  29 hari-5 bulan x Tinggi                                                                                                                                        1,67  ** (1,17-  2,37)
  6-11 bulan x Tidak                                                                                                                                              1,00                  
  6-11 bulan x Rendah                                                                                                                                             1,58   * (1,05-  2,37)
  6-11 bulan x Tinggi                                                                                                                                             1,97  ** (1,27-  3,04)
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. collect export ".\output\model.xls", as(xls) sheet(ideath_side_ci) modify
(collection default exported to file .\output\model.xls)

. 
. *bawah
. collect style autolevels result _r_b _r_ci, clear

. quietly collect layout (colname#result result[chi2 chi2_c N N_g]) (cmdset)

. collect style _cons first

. collect style header result[N chi2 chi2_c N_g], level(label)

. collect label levels result N "Jumlah Observasi" chi2 "Chi2-simultan"           ///
>                 chi2_c "Chi2 vs fix" N_g "Jumlah Komunitas", modify

. collect style cell result[_r_b chi2 chi2_c], nformat(%6,2fc)

. collect style cell result[_r_ci], nformat(%6,2fc) sformat("(%s)") cidelimiter("-")

. collect style cell result[N N_g], nformat(%9,0fc)

. collect stars _r_p "0.001" "***" "0.01" "**" "0.05" "*", attach(_r_b)

. collect style column, dups(center)

. collect style row stack, nobinder delimiter(" x ")

. collect style header result, level(hide)

. collect style cell, font( Times New Roman, size(8) )

. collect style cell border_block, border(right, pattern(nil))

. collect preview

-------------------------------------------------------------------------------------------------------------------------------------------
                                                                                  1             2             3             4             5
-------------------------------------------------------------------------------------------------------------------------------------------
Intercept                                                                   0,01***       0,01***       0,01***       0,01***       0,01***
                                                                      (0,01-  0,01) (0,01-  0,01) (0,01-  0,01) (0,00-  0,01) (0,00-  0,01)
Interval umur                                                                                                                              
  0-6 hari                                                                     1,00          1,00          1,00          1,00          1,00
  7-28 hari                                                                 0,27***       0,27***       0,27***       0,27***       0,26***
                                                                      (0,22-  0,32) (0,22-  0,32) (0,22-  0,32) (0,22-  0,32) (0,19-  0,34)
  29 hari-5 bulan                                                           0,46***       0,46***       0,46***       0,46***       0,38***
                                                                      (0,39-  0,54) (0,39-  0,54) (0,39-  0,54) (0,39-  0,54) (0,30-  0,49)
  6-11 bulan                                                                0,28***       0,28***       0,28***       0,28***       0,22***
                                                                      (0,23-  0,34) (0,23-  0,34) (0,23-  0,34) (0,23-  0,34) (0,16-  0,29)
var(_cons[psu])                                                                0,32          0,26          0,23          0,20          0,20
                                                                      (0,21-  0,48) (0,16-  0,43) (0,13-  0,40) (0,11-  0,38) (0,11-  0,38)
Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                      
  Tidak                                                                                      1,00          1,00          1,00              
  Rendah                                                                                  1,43***        1,29**        1,25**              
                                                                                    (1,24-  1,66) (1,10-  1,52) (1,06-  1,47)              
  Tinggi                                                                                  1,78***       1,44***        1,37**              
                                                                                    (1,50-  2,10) (1,17-  1,76) (1,11-  1,67)              
Pendidikan orang tua (ibu-ayah)                                                                                                            
  Rendah                                                                                                 1,33**        1,28**        1,28**
                                                                                                  (1,12-  1,58) (1,07-  1,52) (1,07-  1,52)
  Ibu < ayah                                                                                               1,20          1,16          1,16
                                                                                                  (0,98-  1,47) (0,95-  1,43) (0,95-  1,43)
  Ibu > ayah                                                                                               1,04          1,04          1,04
                                                                                                  (0,84-  1,29) (0,84-  1,29) (0,84-  1,29)
  Tinggi                                                                                                   1,00          1,00          1,00
Indeks kekayaan rumah tangga                                                                                                               
  Miskin                                                                                                   1,23          1,22          1,22
                                                                                                  (0,97-  1,56) (0,96-  1,54) (0,96-  1,54)
  Menengah                                                                                                 1,10          1,12          1,12
                                                                                                  (0,89-  1,37) (0,90-  1,39) (0,90-  1,39)
  Kaya                                                                                                     1,00          1,00          1,00
Wilayah tempat tinggal                                                                                                                     
  Perdesaan                                                                                                0,93          0,94          0,94
                                                                                                  (0,80-  1,08) (0,80-  1,09) (0,80-  1,09)
  Perkotaan                                                                                                1,00          1,00          1,00
% Perempuan yang menyatakan bermasalah menjangkau jarak faskes                                            1,64*          1,51          1,51
                                                                                                  (1,05-  2,56) (0,97-  2,36) (0,97-  2,36)
Jenis kelamin anak                                                                                                                         
  Perempuan                                                                                                              1,00          1,00
  Laki-laki                                                                                                              1,11          1,11
                                                                                                                (0,98-  1,25) (0,98-  1,25)
Urutan dan jarak kelahiran sebelumnya                                                                                                      
  Pertama                                                                                                             1,40***       1,40***
                                                                                                                (1,15-  1,70) (1,15-  1,70)
  2 dan >=24 bulan                                                                                                       1,00          1,00
  2 dan <24 bulan                                                                                                     2,02***       2,02***
                                                                                                                (1,47-  2,79) (1,47-  2,79)
  >=3 dan >=24 bulan                                                                                                  1,40***       1,40***
                                                                                                                (1,15-  1,70) (1,15-  1,70)
  >=3 dan <24 bulan                                                                                                   2,58***       2,58***
                                                                                                                (2,00-  3,33) (2,00-  3,33)
Umur ibu saat melahirkan                                                                                                                   
  <20                                                                                                                  1,40**        1,40**
                                                                                                                (1,12-  1,75) (1,12-  1,75)
  20-29                                                                                                                  1,00          1,00
  30-39                                                                                                                  1,17          1,17
                                                                                                                (0,99-  1,37) (0,99-  1,37)
  40-49                                                                                                               1,82***       1,82***
                                                                                                                (1,35-  2,45) (1,35-  2,45)
Interval umur x Status deprivasi lingkungan rumah tangga (3 kategori)                                                                      
  0-6 hari x Tidak                                                                                                                     1,00
  0-6 hari x Rendah                                                                                                                    1,14
                                                                                                                              (0,92-  1,42)
  0-6 hari x Tinggi                                                                                                                    1,11
                                                                                                                              (0,85-  1,44)
  7-28 hari x Tidak                                                                                                                    1,00
  7-28 hari x Rendah                                                                                                                   1,06
                                                                                                                              (0,70-  1,60)
  7-28 hari x Tinggi                                                                                                                   1,42
                                                                                                                              (0,92-  2,19)
  29 hari-5 bulan x Tidak                                                                                                              1,00
  29 hari-5 bulan x Rendah                                                                                                            1,48*
                                                                                                                              (1,08-  2,02)
  29 hari-5 bulan x Tinggi                                                                                                           1,67**
                                                                                                                              (1,17-  2,37)
  6-11 bulan x Tidak                                                                                                                   1,00
  6-11 bulan x Rendah                                                                                                                 1,58*
                                                                                                                              (1,05-  2,37)
  6-11 bulan x Tinggi                                                                                                                1,97**
                                                                                                                              (1,27-  3,04)
Chi2-simultan                                                                315,55        365,81        392,56        485,70        475,88
Chi2 vs fix                                                                   31,41         20,40         16,41         12,91         12,94
Jumlah Observasi                                                            137.214       137.214       137.214       137.214       137.214
Jumlah Komunitas                                                              1.970         1.970         1.970         1.970         1.970
-------------------------------------------------------------------------------------------------------------------------------------------

. collect export ".\output\model.xls", as(xls) sheet(ideath_down_ci, replace) modify
(collection default exported to file .\output\model.xls)

. 
. 
. 
. /*
> ================================================================================
> C. U5DEATH                                                                                                      
> ================================================================================
> */
. 
. collect clear

. 
. /*
> ******************************************************************
> ESTIMASI                                                                                                        [done]
> ******************************************************************
> */
. 
. *\Model 1 - baseline hazard
. #delimit ;
delimiter now ;
. collect: melogit u5death i.interval
>                  if data == 3 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -20629.741  
Iteration 1:   log likelihood = -7340.5314  
Iteration 2:   log likelihood = -7239.8979  
Iteration 3:   log likelihood =    -7200.6  
Iteration 4:   log likelihood = -7200.4947  
Iteration 5:   log likelihood = -7200.4947  

Refining starting values:

Grid node 0:   log likelihood = -7277.4884

Fitting full model:

Iteration 0:   log likelihood = -7277.4884  (not concave)
Iteration 1:   log likelihood = -7206.8036  
Iteration 2:   log likelihood = -7180.3735  
Iteration 3:   log likelihood = -7174.7725  
Iteration 4:   log likelihood = -7174.7588  
Iteration 5:   log likelihood = -7174.7588  

Mixed-effects logistic regression               Number of obs     =    204,706
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =         18
                                                              avg =      103.9
                                                              max =        315

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(5)      =     496.48
Log likelihood = -7174.7588                     Prob > chi2       =     0.0000
----------------------------------------------------------------------------------
         u5death | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
        interval |
      7-28 hari  |    .265577   .0259081   -13.59   0.000     .2193574    .3215353
29 hari-5 bulan  |   .4581601   .0367138    -9.74   0.000     .3915685    .5360765
     6-11 bulan  |   .2777338   .0267857   -13.28   0.000     .2298982    .3355226
    12-23 bulan  |   .2183358   .0232245   -14.31   0.000     .1772483    .2689477
    24-59 bulan  |   .2010192   .0221641   -14.55   0.000     .1619515    .2495111
                 |
           _cons |   .0122714   .0006854   -78.79   0.000     .0109989     .013691
-----------------+----------------------------------------------------------------
psu              |
       var(_cons)|   .3390929     .05872                      .2415005    .4761233
----------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 51.47       Prob >= chibar2 = 0.0000

. #delimit cr
delimiter now cr
. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |   .0934408    .014669      .0683872    .1264271
------------------------------------------------------------------------------

. 
. *\Model 2 - tanpa kontrol
. #delimit ;
delimiter now ;
. collect: melogit u5death i.interval i.depriv
>                  if data == 3 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -20627.833  
Iteration 1:   log likelihood = -7323.1371  
Iteration 2:   log likelihood = -7208.2902  
Iteration 3:   log likelihood = -7161.2566  
Iteration 4:   log likelihood = -7161.0719  
Iteration 5:   log likelihood = -7161.0719  

Refining starting values:

Grid node 0:   log likelihood = -7252.5881

Fitting full model:

Iteration 0:   log likelihood = -7252.5881  (not concave)
Iteration 1:   log likelihood = -7180.8052  
Iteration 2:   log likelihood = -7156.6632  
Iteration 3:   log likelihood = -7145.4506  
Iteration 4:   log likelihood = -7145.3933  
Iteration 5:   log likelihood = -7145.3933  

Mixed-effects logistic regression               Number of obs     =    204,706
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =         18
                                                              avg =      103.9
                                                              max =        315

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(7)      =     556.79
Log likelihood = -7145.3933                     Prob > chi2       =     0.0000
----------------------------------------------------------------------------------
         u5death | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
        interval |
      7-28 hari  |   .2655082   .0259004   -13.59   0.000     .2193022    .3214496
29 hari-5 bulan  |   .4579928   .0366984    -9.75   0.000      .391429     .535876
     6-11 bulan  |   .2776351   .0267752   -13.29   0.000     .2298181     .335401
    12-23 bulan  |   .2182775   .0232176   -14.31   0.000     .1772021    .2688742
    24-59 bulan  |   .2009749   .0221586   -14.55   0.000     .1619169    .2494546
                 |
          depriv |
         Rendah  |   1.441634    .100473     5.25   0.000     1.257568    1.652641
         Tinggi  |   1.784848   .1394782     7.41   0.000     1.531382    2.080267
                 |
           _cons |   .0101083   .0006468   -71.80   0.000     .0089169    .0114588
-----------------+----------------------------------------------------------------
psu              |
       var(_cons)|   .2656936    .056283                      .1754153    .4024339
----------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 31.36       Prob >= chibar2 = 0.0000

. #delimit cr
delimiter now cr
. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |   .0747262   .0146467      .0506208    .1089927
------------------------------------------------------------------------------

. 
. *\Model 3 - kontrol: sosek
. #delimit ;
delimiter now ;
. collect: melogit u5death i.interval i.depriv
>                  b3.pareduc b2.wealth b1.reside pwdisthfac
>                  if data == 3 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -20626.644  
Iteration 1:   log likelihood = -7312.3588  
Iteration 2:   log likelihood = -7190.5188  
Iteration 3:   log likelihood = -7137.8299  
Iteration 4:   log likelihood = -7137.5701  
Iteration 5:   log likelihood =   -7137.57  

Refining starting values:

Grid node 0:   log likelihood = -7234.8895

Fitting full model:

Iteration 0:   log likelihood = -7234.8895  (not concave)
Iteration 1:   log likelihood = -7162.6291  
Iteration 2:   log likelihood = -7135.7309  
Iteration 3:   log likelihood = -7125.8111  
Iteration 4:   log likelihood = -7125.6994  
Iteration 5:   log likelihood = -7125.6993  

Mixed-effects logistic regression               Number of obs     =    204,706
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =         18
                                                              avg =      103.9
                                                              max =        315

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(14)     =     598.52
Log likelihood = -7125.6993                     Prob > chi2       =     0.0000
----------------------------------------------------------------------------------
         u5death | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
        interval |
      7-28 hari  |   .2654762   .0258978   -13.60   0.000     .2192748    .3214122
29 hari-5 bulan  |   .4579056   .0366926    -9.75   0.000     .3913524    .5357767
     6-11 bulan  |   .2776269    .026775   -13.29   0.000     .2298103    .3353926
    12-23 bulan  |   .2182758   .0232179   -14.31   0.000        .1772    .2688731
    24-59 bulan  |   .2010021    .022162   -14.55   0.000     .1619381    .2494893
                 |
          depriv |
         Rendah  |   1.266475   .0965411     3.10   0.002     1.090714    1.470558
         Tinggi  |   1.390452   .1311883     3.49   0.000     1.155702    1.672887
                 |
         pareduc |
         Rendah  |   1.336063   .1071042     3.61   0.000     1.141803    1.563373
     Ibu < ayah  |    1.31604   .1205513     3.00   0.003      1.09976    1.574855
     Ibu > ayah  |   1.059497   .1038509     0.59   0.555     .8743107    1.283908
                 |
          wealth |
         Miskin  |    1.28806   .1423959     2.29   0.022     1.037135    1.599694
       Menengah  |   1.146262   .1176094     1.33   0.183     .9374509    1.401585
                 |
          reside |
      Perdesaan  |   .9474455   .0684461    -0.75   0.455     .8223582    1.091559
                 |
      pwdisthfac |   1.754216   .3668351     2.69   0.007     1.164349    2.642915
           _cons |   .0081132   .0008007   -48.78   0.000     .0066864    .0098446
-----------------+----------------------------------------------------------------
psu              |
       var(_cons)|   .2298488   .0549831                      .1438211    .3673346
----------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 23.74       Prob >= chibar2 = 0.0000

. #delimit cr
delimiter now cr
. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |   .0653032   .0146013      .0418853    .1004414
------------------------------------------------------------------------------

. 
. *\Model 4 - kontrol: full
. #delimit ;
delimiter now ;
. collect: melogit u5death i.interval i.depriv i.chsex b1.bordin b1.mageb
>                  b3.pareduc b2.wealth b1.reside pwdisthfac
>                  if data == 3 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -20623.481  
Iteration 1:   log likelihood = -7284.0769  
Iteration 2:   log likelihood = -7152.6458  
Iteration 3:   log likelihood = -7082.1021  
Iteration 4:   log likelihood = -7081.4754  
Iteration 5:   log likelihood =  -7081.475  

Refining starting values:

Grid node 0:   log likelihood = -7185.7654

Fitting full model:

Iteration 0:   log likelihood = -7185.7654  (not concave)
Iteration 1:   log likelihood = -7113.2136  
Iteration 2:   log likelihood = -7081.7452  
Iteration 3:   log likelihood = -7073.1398  
Iteration 4:   log likelihood = -7073.1088  
Iteration 5:   log likelihood = -7073.1088  

Mixed-effects logistic regression               Number of obs     =    204,706
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =         18
                                                              avg =      103.9
                                                              max =        315

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(22)     =     715.53
Log likelihood = -7073.1088                     Prob > chi2       =     0.0000
-------------------------------------------------------------------------------------
            u5death | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
--------------------+----------------------------------------------------------------
           interval |
         7-28 hari  |   .2656253   .0259204   -13.59   0.000     .2193851    .3216117
   29 hari-5 bulan  |   .4584278   .0367512    -9.73   0.000     .3917706    .5364262
        6-11 bulan  |   .2779719   .0268168   -13.27   0.000      .230082    .3358296
       12-23 bulan  |   .2186299   .0232616   -14.29   0.000     .1774778    .2693241
       24-59 bulan  |    .201421   .0222137   -14.53   0.000      .162267    .2500227
                    |
             depriv |
            Rendah  |   1.224737   .0934695     2.66   0.008     1.054583    1.422345
            Tinggi  |   1.317386   .1245987     2.91   0.004     1.094476    1.585696
                    |
              chsex |
         Laki-laki  |   1.138738   .0663473     2.23   0.026      1.01585    1.276492
                    |
             bordin |
           Pertama  |   1.297988   .1183497     2.86   0.004     1.085572    1.551968
   2 dan <24 bulan  |   2.043166   .2986105     4.89   0.000     1.534263    2.720869
>=3 dan >=24 bulan  |   1.414522   .1266671     3.87   0.000     1.186824    1.685903
 >=3 dan <24 bulan  |   2.631278   .3082218     8.26   0.000     2.091506    3.310355
                    |
              mageb |
               <20  |   1.295979   .1382171     2.43   0.015     1.051518    1.597273
             30-39  |   1.062518   .0789572     0.82   0.414     .9185068    1.229109
             40-49  |   1.782083     .24264     4.24   0.000     1.364684    2.327145
                    |
            pareduc |
            Rendah  |   1.277442   .1047635     2.99   0.003     1.087762    1.500198
        Ibu < ayah  |   1.272909   .1178862     2.61   0.009     1.061613     1.52626
        Ibu > ayah  |    1.05589   .1036118     0.55   0.579     .8711486    1.279808
                    |
             wealth |
            Miskin  |   1.276456   .1415943     2.20   0.028     1.027032    1.586454
          Menengah  |   1.164334    .119541     1.48   0.138     .9521064    1.423868
                    |
             reside |
         Perdesaan  |   .9528852   .0682795    -0.67   0.501     .8280323    1.096564
                    |
         pwdisthfac |   1.605319   .3307766     2.30   0.022     1.071941    2.404096
              _cons |   .0055694   .0006813   -42.43   0.000     .0043821    .0070783
--------------------+----------------------------------------------------------------
psu                 |
          var(_cons)|   .1932577   .0537463                      .1120499    .3333205
-------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 16.73       Prob >= chibar2 = 0.0000

. #delimit cr
delimiter now cr
. estimate store mdl_c4

. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |    .055484   .0145743      .0329373    .0919964
------------------------------------------------------------------------------

. 
. *\Model 5 - interaksi periode umur
. #delimit ;
delimiter now ;
. collect: melogit u5death i.interval i.interval#i.depriv i.chsex b1.bordin 
>                  b1.mageb b3.pareduc b2.wealth b1.reside pwdisthfac
>                  if data == 3 || psu:, or
>  ;

Fitting fixed-effects model:

Iteration 0:   log likelihood = -20623.074  
Iteration 1:   log likelihood = -7281.0293  
Iteration 2:   log likelihood = -7143.4968  
Iteration 3:   log likelihood = -7075.0817  
Iteration 4:   log likelihood = -7074.4393  
Iteration 5:   log likelihood = -7074.4387  

Refining starting values:

Grid node 0:   log likelihood = -7178.7241

Fitting full model:

Iteration 0:   log likelihood = -7178.7241  (not concave)
Iteration 1:   log likelihood = -7106.2397  
Iteration 2:   log likelihood = -7074.7007  
Iteration 3:   log likelihood = -7066.0943  
Iteration 4:   log likelihood = -7066.0626  
Iteration 5:   log likelihood = -7066.0626  

Mixed-effects logistic regression               Number of obs     =    204,706
Group variable: psu                             Number of groups  =      1,970

                                                Obs per group:
                                                              min =         18
                                                              avg =      103.9
                                                              max =        315

Integration method: mvaghermite                 Integration pts.  =          7

                                                Wald chi2(32)     =     705.73
Log likelihood = -7066.0626                     Prob > chi2       =     0.0000
-----------------------------------------------------------------------------------------
                u5death | Odds ratio   Std. err.      z    P>|z|     [95% conf. interval]
------------------------+----------------------------------------------------------------
               interval |
             7-28 hari  |   .2566121   .0375626    -9.29   0.000     .1926102     .341881
       29 hari-5 bulan  |    .380767    .048122    -7.64   0.000     .2972233    .4877932
            6-11 bulan  |   .2153526   .0339732    -9.73   0.000     .1580767    .2933813
           12-23 bulan  |    .163053   .0289419   -10.22   0.000     .1151438    .2308964
           24-59 bulan  |   .2034696   .0329464    -9.83   0.000     .1481393    .2794657
                        |
        interval#depriv |
       0-6 hari#Rendah  |   1.108646   .1210216     0.94   0.345     .8951054    1.373129
       0-6 hari#Tinggi  |    1.04243   .1370966     0.32   0.752     .8055637    1.348944
      7-28 hari#Rendah  |   1.026249   .2155525     0.12   0.902      .679935    1.548954
      7-28 hari#Tinggi  |   1.327511   .2929302     1.28   0.199     .8614122     2.04581
29 hari-5 bulan#Rendah  |    1.43449   .2291479     2.26   0.024     1.048878    1.961868
29 hari-5 bulan#Tinggi  |   1.564174   .2779349     2.52   0.012     1.104173    2.215815
     6-11 bulan#Rendah  |   1.531677   .3167478     2.06   0.039     1.021269    2.297174
     6-11 bulan#Tinggi  |   1.845945   .4075657     2.78   0.005     1.197519    2.845479
    12-23 bulan#Rendah  |   1.524887   .3619032     1.78   0.075     .9576817    2.428032
    12-23 bulan#Tinggi  |   2.099635    .512314     3.04   0.002     1.301515    3.387179
    24-59 bulan#Rendah  |   1.092209   .2549936     0.38   0.706     .6911611    1.725967
    24-59 bulan#Tinggi  |   1.014772   .2747193     0.05   0.957     .5969405    1.725067
                        |
                  chsex |
             Laki-laki  |   1.138647    .066338     2.23   0.026     1.015775    1.276381
                        |
                 bordin |
               Pertama  |   1.297967   .1183518     2.86   0.004     1.085548    1.551952
       2 dan <24 bulan  |    2.04341   .2986178     4.89   0.000     1.534488     2.72112
    >=3 dan >=24 bulan  |   1.414451   .1266629     3.87   0.000     1.186761    1.685824
     >=3 dan <24 bulan  |   2.631917   .3082368     8.26   0.000     2.092107    3.311011
                        |
                  mageb |
                   <20  |   1.296261   .1382335     2.43   0.015     1.051769    1.597588
                 30-39  |   1.062381   .0789444     0.81   0.415     .9183925    1.228944
                 40-49  |   1.781877   .2425732     4.24   0.000     1.364585    2.326777
                        |
                pareduc |
                Rendah  |   1.277555   .1047593     2.99   0.003     1.087881      1.5003
            Ibu < ayah  |   1.273034   .1178911     2.61   0.009     1.061729    1.526395
            Ibu > ayah  |   1.055849   .1036038     0.55   0.580     .8711218    1.279749
                        |
                 wealth |
                Miskin  |   1.276488   .1416317     2.20   0.028     1.027004    1.586576
              Menengah  |   1.164238   .1195628     1.48   0.139     .9519773    1.423826
                        |
                 reside |
             Perdesaan  |   .9528977   .0682842    -0.67   0.501     .8280367    1.096587
                        |
             pwdisthfac |   1.604993   .3305911     2.30   0.022     1.071879     2.40326
                  _cons |   .0060781   .0007737   -40.09   0.000     .0047361    .0078004
------------------------+----------------------------------------------------------------
psu                     |
              var(_cons)|   .1932395   .0537204                      .1120632    .3332185
-----------------------------------------------------------------------------------------
Note: Estimates are transformed only in the first equation to odds ratios.
Note: _cons estimates baseline odds (conditional on zero random effects).
LR test vs. logistic model: chibar2(01) = 16.75       Prob >= chibar2 = 0.0000

. #delimit cr
delimiter now cr
. estimate store mdl_c5

. estat icc

Residual intraclass correlation

------------------------------------------------------------------------------
                       Level |        ICC   Std. err.     [95% conf. interval]
-----------------------------+------------------------------------------------
                         psu |   .0554791   .0145675       .032941    .0919709
------------------------------------------------------------------------------

. 
. *\\likelihood ratio test model a5 vs model a4
. lrtest mdl_c4 mdl_c5

Likelihood-ratio test
Assumption: mdl_c4 nested within mdl_c5

LR chi2(10) =  14.09
Prob > chi2 = 0.1688

. 
. /*
> ******************************************************************
> SAVE                                                                                                            [done]
> ******************************************************************
> */
. 
. /*
> ------------------------------------------------------------------
> SE
> ------------------------------------------------------------------
> */
. 
. *samping
. collect style autolevels result _r_b _r_se, clear

. quietly collect layout (colname) (cmdset#result[_r_b stars _r_se])

. collect style _cons first

. collect style cell result[_r_b], nformat(%6,3fc)

. collect style cell result[_r_se], nformat(%6,3fc) sformat("(%s)")

. collect stars _r_p "0.001" "***" "0.01" "**" "0.05" "*"

. collect style column, dups(center)

. collect style header result, level(hide)

. collect style row stack, nobinder delimiter(" x ")

. collect style cell, font( Times New Roman, size(8) )

. collect style cell border_block, border(right, pattern(nil))

. collect preview

---------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                              1                 2                 3                 4                 5        
---------------------------------------------------------------------------------------------------------------------------------------------------------------
Intercept                                                             0,012 *** (0,001) 0,010 *** (0,001) 0,008 *** (0,001) 0,006 *** (0,001) 0,006 *** (0,001)
Interval umur                                                                                                                                                  
  0-6 hari                                                            1,000     (0,000) 1,000     (0,000) 1,000     (0,000) 1,000     (0,000) 1,000     (0,000)
  7-28 hari                                                           0,266 *** (0,026) 0,266 *** (0,026) 0,265 *** (0,026) 0,266 *** (0,026) 0,257 *** (0,038)
  29 hari-5 bulan                                                     0,458 *** (0,037) 0,458 *** (0,037) 0,458 *** (0,037) 0,458 *** (0,037) 0,381 *** (0,048)
  6-11 bulan                                                          0,278 *** (0,027) 0,278 *** (0,027) 0,278 *** (0,027) 0,278 *** (0,027) 0,215 *** (0,034)
  12-23 bulan                                                         0,218 *** (0,023) 0,218 *** (0,023) 0,218 *** (0,023) 0,219 *** (0,023) 0,163 *** (0,029)
  24-59 bulan                                                         0,201 *** (0,022) 0,201 *** (0,022) 0,201 *** (0,022) 0,201 *** (0,022) 0,203 *** (0,033)
var(_cons[psu])                                                       0,339     (0,059) 0,266     (0,056) 0,230     (0,055) 0,193     (0,054) 0,193     (0,054)
Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                                          
  Tidak                                                                                 1,000     (0,000) 1,000     (0,000) 1,000     (0,000)                  
  Rendah                                                                                1,442 *** (0,100) 1,266  ** (0,097) 1,225  ** (0,093)                  
  Tinggi                                                                                1,785 *** (0,139) 1,390 *** (0,131) 1,317  ** (0,125)                  
Pendidikan orang tua (ibu-ayah)                                                                                                                                
  Rendah                                                                                                  1,336 *** (0,107) 1,277  ** (0,105) 1,278  ** (0,105)
  Ibu < ayah                                                                                              1,316  ** (0,121) 1,273  ** (0,118) 1,273  ** (0,118)
  Ibu > ayah                                                                                              1,059     (0,104) 1,056     (0,104) 1,056     (0,104)
  Tinggi                                                                                                  1,000     (0,000) 1,000     (0,000) 1,000     (0,000)
Indeks kekayaan rumah tangga                                                                                                                                   
  Miskin                                                                                                  1,288   * (0,142) 1,276   * (0,142) 1,276   * (0,142)
  Menengah                                                                                                1,146     (0,118) 1,164     (0,120) 1,164     (0,120)
  Kaya                                                                                                    1,000     (0,000) 1,000     (0,000) 1,000     (0,000)
Wilayah tempat tinggal                                                                                                                                         
  Perdesaan                                                                                               0,947     (0,068) 0,953     (0,068) 0,953     (0,068)
  Perkotaan                                                                                               1,000     (0,000) 1,000     (0,000) 1,000     (0,000)
% Perempuan yang menyatakan bermasalah menjangkau jarak faskes                                            1,754  ** (0,367) 1,605   * (0,331) 1,605   * (0,331)
Jenis kelamin anak                                                                                                                                             
  Perempuan                                                                                                                 1,000     (0,000) 1,000     (0,000)
  Laki-laki                                                                                                                 1,139   * (0,066) 1,139   * (0,066)
Urutan dan jarak kelahiran sebelumnya                                                                                                                          
  Pertama                                                                                                                   1,298  ** (0,118) 1,298  ** (0,118)
  2 dan >=24 bulan                                                                                                          1,000     (0,000) 1,000     (0,000)
  2 dan <24 bulan                                                                                                           2,043 *** (0,299) 2,043 *** (0,299)
  >=3 dan >=24 bulan                                                                                                        1,415 *** (0,127) 1,414 *** (0,127)
  >=3 dan <24 bulan                                                                                                         2,631 *** (0,308) 2,632 *** (0,308)
Umur ibu saat melahirkan                                                                                                                                       
  <20                                                                                                                       1,296   * (0,138) 1,296   * (0,138)
  20-29                                                                                                                     1,000     (0,000) 1,000     (0,000)
  30-39                                                                                                                     1,063     (0,079) 1,062     (0,079)
  40-49                                                                                                                     1,782 *** (0,243) 1,782 *** (0,243)
Interval umur x Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                          
  0-6 hari x Tidak                                                                                                                            1,000     (0,000)
  0-6 hari x Rendah                                                                                                                           1,109     (0,121)
  0-6 hari x Tinggi                                                                                                                           1,042     (0,137)
  7-28 hari x Tidak                                                                                                                           1,000     (0,000)
  7-28 hari x Rendah                                                                                                                          1,026     (0,216)
  7-28 hari x Tinggi                                                                                                                          1,328     (0,293)
  29 hari-5 bulan x Tidak                                                                                                                     1,000     (0,000)
  29 hari-5 bulan x Rendah                                                                                                                    1,434   * (0,229)
  29 hari-5 bulan x Tinggi                                                                                                                    1,564   * (0,278)
  6-11 bulan x Tidak                                                                                                                          1,000     (0,000)
  6-11 bulan x Rendah                                                                                                                         1,532   * (0,317)
  6-11 bulan x Tinggi                                                                                                                         1,846  ** (0,408)
  12-23 bulan x Tidak                                                                                                                         1,000     (0,000)
  12-23 bulan x Rendah                                                                                                                        1,525     (0,362)
  12-23 bulan x Tinggi                                                                                                                        2,100  ** (0,512)
  24-59 bulan x Tidak                                                                                                                         1,000     (0,000)
  24-59 bulan x Rendah                                                                                                                        1,092     (0,255)
  24-59 bulan x Tinggi                                                                                                                        1,015     (0,275)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

. collect export ".\output\model.xls", as(xls) sheet(u5death_side_se) modify
(collection default exported to file .\output\model.xls)

. 
. *bawah
. collect style autolevels result _r_b _r_se, clear

. quietly collect layout (colname#result result[chi2 chi2_c N N_g]) (cmdset)

. collect style _cons first

. collect style header result[N chi2 chi2_c N_g], level(label)

. collect label levels result N "Jumlah Observasi" chi2 "Chi2-simultan"           ///
>                 chi2_c "Chi2 vs fix" N_g "Jumlah Komunitas", modify

. collect style cell result[_r_b chi2 chi2_c], nformat(%6,3fc)

. collect style cell result[_r_se], nformat(%6,3fc) sformat("(%s)")

. collect style cell result[N N_g], nformat(%9,0fc)

. collect stars _r_p "0.001" "***" "0.01" "**" "0.05" "*", attach(_r_b)

. collect style column, dups(center)

. collect style row stack, nobinder delimiter(" x ")

. collect style header result, level(hide)

. collect style cell, font( Times New Roman, size(8) )

. collect style cell border_block, border(right, pattern(nil))

. collect preview

------------------------------------------------------------------------------------------------------------------
                                                                             1        2        3        4        5
------------------------------------------------------------------------------------------------------------------
Intercept                                                             0,012*** 0,010*** 0,008*** 0,006*** 0,006***
                                                                       (0,001)  (0,001)  (0,001)  (0,001)  (0,001)
Interval umur                                                                                                     
  0-6 hari                                                               1,000    1,000    1,000    1,000    1,000
                                                                       (0,000)  (0,000)  (0,000)  (0,000)  (0,000)
  7-28 hari                                                           0,266*** 0,266*** 0,265*** 0,266*** 0,257***
                                                                       (0,026)  (0,026)  (0,026)  (0,026)  (0,038)
  29 hari-5 bulan                                                     0,458*** 0,458*** 0,458*** 0,458*** 0,381***
                                                                       (0,037)  (0,037)  (0,037)  (0,037)  (0,048)
  6-11 bulan                                                          0,278*** 0,278*** 0,278*** 0,278*** 0,215***
                                                                       (0,027)  (0,027)  (0,027)  (0,027)  (0,034)
  12-23 bulan                                                         0,218*** 0,218*** 0,218*** 0,219*** 0,163***
                                                                       (0,023)  (0,023)  (0,023)  (0,023)  (0,029)
  24-59 bulan                                                         0,201*** 0,201*** 0,201*** 0,201*** 0,203***
                                                                       (0,022)  (0,022)  (0,022)  (0,022)  (0,033)
var(_cons[psu])                                                          0,339    0,266    0,230    0,193    0,193
                                                                       (0,059)  (0,056)  (0,055)  (0,054)  (0,054)
Status deprivasi lingkungan rumah tangga (3 kategori)                                                             
  Tidak                                                                           1,000    1,000    1,000         
                                                                                (0,000)  (0,000)  (0,000)         
  Rendah                                                                       1,442***  1,266**  1,225**         
                                                                                (0,100)  (0,097)  (0,093)         
  Tinggi                                                                       1,785*** 1,390***  1,317**         
                                                                                (0,139)  (0,131)  (0,125)         
Pendidikan orang tua (ibu-ayah)                                                                                   
  Rendah                                                                                1,336***  1,277**  1,278**
                                                                                         (0,107)  (0,105)  (0,105)
  Ibu < ayah                                                                             1,316**  1,273**  1,273**
                                                                                         (0,121)  (0,118)  (0,118)
  Ibu > ayah                                                                               1,059    1,056    1,056
                                                                                         (0,104)  (0,104)  (0,104)
  Tinggi                                                                                   1,000    1,000    1,000
                                                                                         (0,000)  (0,000)  (0,000)
Indeks kekayaan rumah tangga                                                                                      
  Miskin                                                                                  1,288*   1,276*   1,276*
                                                                                         (0,142)  (0,142)  (0,142)
  Menengah                                                                                 1,146    1,164    1,164
                                                                                         (0,118)  (0,120)  (0,120)
  Kaya                                                                                     1,000    1,000    1,000
                                                                                         (0,000)  (0,000)  (0,000)
Wilayah tempat tinggal                                                                                            
  Perdesaan                                                                                0,947    0,953    0,953
                                                                                         (0,068)  (0,068)  (0,068)
  Perkotaan                                                                                1,000    1,000    1,000
                                                                                         (0,000)  (0,000)  (0,000)
% Perempuan yang menyatakan bermasalah menjangkau jarak faskes                           1,754**   1,605*   1,605*
                                                                                         (0,367)  (0,331)  (0,331)
Jenis kelamin anak                                                                                                
  Perempuan                                                                                         1,000    1,000
                                                                                                  (0,000)  (0,000)
  Laki-laki                                                                                        1,139*   1,139*
                                                                                                  (0,066)  (0,066)
Urutan dan jarak kelahiran sebelumnya                                                                             
  Pertama                                                                                         1,298**  1,298**
                                                                                                  (0,118)  (0,118)
  2 dan >=24 bulan                                                                                  1,000    1,000
                                                                                                  (0,000)  (0,000)
  2 dan <24 bulan                                                                                2,043*** 2,043***
                                                                                                  (0,299)  (0,299)
  >=3 dan >=24 bulan                                                                             1,415*** 1,414***
                                                                                                  (0,127)  (0,127)
  >=3 dan <24 bulan                                                                              2,631*** 2,632***
                                                                                                  (0,308)  (0,308)
Umur ibu saat melahirkan                                                                                          
  <20                                                                                              1,296*   1,296*
                                                                                                  (0,138)  (0,138)
  20-29                                                                                             1,000    1,000
                                                                                                  (0,000)  (0,000)
  30-39                                                                                             1,063    1,062
                                                                                                  (0,079)  (0,079)
  40-49                                                                                          1,782*** 1,782***
                                                                                                  (0,243)  (0,243)
Interval umur x Status deprivasi lingkungan rumah tangga (3 kategori)                                             
  0-6 hari x Tidak                                                                                           1,000
                                                                                                           (0,000)
  0-6 hari x Rendah                                                                                          1,109
                                                                                                           (0,121)
  0-6 hari x Tinggi                                                                                          1,042
                                                                                                           (0,137)
  7-28 hari x Tidak                                                                                          1,000
                                                                                                           (0,000)
  7-28 hari x Rendah                                                                                         1,026
                                                                                                           (0,216)
  7-28 hari x Tinggi                                                                                         1,328
                                                                                                           (0,293)
  29 hari-5 bulan x Tidak                                                                                    1,000
                                                                                                           (0,000)
  29 hari-5 bulan x Rendah                                                                                  1,434*
                                                                                                           (0,229)
  29 hari-5 bulan x Tinggi                                                                                  1,564*
                                                                                                           (0,278)
  6-11 bulan x Tidak                                                                                         1,000
                                                                                                           (0,000)
  6-11 bulan x Rendah                                                                                       1,532*
                                                                                                           (0,317)
  6-11 bulan x Tinggi                                                                                      1,846**
                                                                                                           (0,408)
  12-23 bulan x Tidak                                                                                        1,000
                                                                                                           (0,000)
  12-23 bulan x Rendah                                                                                       1,525
                                                                                                           (0,362)
  12-23 bulan x Tinggi                                                                                     2,100**
                                                                                                           (0,512)
  24-59 bulan x Tidak                                                                                        1,000
                                                                                                           (0,000)
  24-59 bulan x Rendah                                                                                       1,092
                                                                                                           (0,255)
  24-59 bulan x Tinggi                                                                                       1,015
                                                                                                           (0,275)
Chi2-simultan                                                          496,481  556,793  598,522  715,528  705,735
Chi2 vs fix                                                             51,472   31,357   23,742   16,733   16,752
Jumlah Observasi                                                       204.706  204.706  204.706  204.706  204.706
Jumlah Komunitas                                                         1.970    1.970    1.970    1.970    1.970
------------------------------------------------------------------------------------------------------------------

. collect export ".\output\model.xls", as(xls) sheet(u5death_down_se, replace) modify
(collection default exported to file .\output\model.xls)

. 
. /*
> ------------------------------------------------------------------
> 95% CI
> ------------------------------------------------------------------
> */
. 
. *samping
. collect style autolevels result _r_b _r_ci, clear

. quietly collect layout (colname) (cmdset#result[_r_b stars _r_ci])

. collect style _cons first

. collect style cell result[_r_b], nformat(%6,2fc)

. collect style cell result[_r_ci], nformat(%6,2fc) sformat("(%s)") cidelimiter("-")

. collect stars _r_p "0.001" "***" "0.01" "**" "0.05" "*"

. collect style column, dups(center)

. collect style header result, level(hide)

. collect style row stack, nobinder delimiter(" x ")

. collect style cell, font( Times New Roman, size(8) )

. collect style cell border_block, border(right, pattern(nil))

. collect preview

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                 1                      2                      3                      4                      5          
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Intercept                                                             0,01 *** (0,01-  0,01) 0,01 *** (0,01-  0,01) 0,01 *** (0,01-  0,01) 0,01 *** (0,00-  0,01) 0,01 *** (0,00-  0,01)
Interval umur                                                                                                                                                                           
  0-6 hari                                                            1,00                   1,00                   1,00                   1,00                   1,00                  
  7-28 hari                                                           0,27 *** (0,22-  0,32) 0,27 *** (0,22-  0,32) 0,27 *** (0,22-  0,32) 0,27 *** (0,22-  0,32) 0,26 *** (0,19-  0,34)
  29 hari-5 bulan                                                     0,46 *** (0,39-  0,54) 0,46 *** (0,39-  0,54) 0,46 *** (0,39-  0,54) 0,46 *** (0,39-  0,54) 0,38 *** (0,30-  0,49)
  6-11 bulan                                                          0,28 *** (0,23-  0,34) 0,28 *** (0,23-  0,34) 0,28 *** (0,23-  0,34) 0,28 *** (0,23-  0,34) 0,22 *** (0,16-  0,29)
  12-23 bulan                                                         0,22 *** (0,18-  0,27) 0,22 *** (0,18-  0,27) 0,22 *** (0,18-  0,27) 0,22 *** (0,18-  0,27) 0,16 *** (0,12-  0,23)
  24-59 bulan                                                         0,20 *** (0,16-  0,25) 0,20 *** (0,16-  0,25) 0,20 *** (0,16-  0,25) 0,20 *** (0,16-  0,25) 0,20 *** (0,15-  0,28)
var(_cons[psu])                                                       0,34     (0,24-  0,48) 0,27     (0,18-  0,40) 0,23     (0,14-  0,37) 0,19     (0,11-  0,33) 0,19     (0,11-  0,33)
Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                                                                   
  Tidak                                                                                      1,00                   1,00                   1,00                                         
  Rendah                                                                                     1,44 *** (1,26-  1,65) 1,27  ** (1,09-  1,47) 1,22  ** (1,05-  1,42)                       
  Tinggi                                                                                     1,78 *** (1,53-  2,08) 1,39 *** (1,16-  1,67) 1,32  ** (1,09-  1,59)                       
Pendidikan orang tua (ibu-ayah)                                                                                                                                                         
  Rendah                                                                                                            1,34 *** (1,14-  1,56) 1,28  ** (1,09-  1,50) 1,28  ** (1,09-  1,50)
  Ibu < ayah                                                                                                        1,32  ** (1,10-  1,57) 1,27  ** (1,06-  1,53) 1,27  ** (1,06-  1,53)
  Ibu > ayah                                                                                                        1,06     (0,87-  1,28) 1,06     (0,87-  1,28) 1,06     (0,87-  1,28)
  Tinggi                                                                                                            1,00                   1,00                   1,00                  
Indeks kekayaan rumah tangga                                                                                                                                                            
  Miskin                                                                                                            1,29   * (1,04-  1,60) 1,28   * (1,03-  1,59) 1,28   * (1,03-  1,59)
  Menengah                                                                                                          1,15     (0,94-  1,40) 1,16     (0,95-  1,42) 1,16     (0,95-  1,42)
  Kaya                                                                                                              1,00                   1,00                   1,00                  
Wilayah tempat tinggal                                                                                                                                                                  
  Perdesaan                                                                                                         0,95     (0,82-  1,09) 0,95     (0,83-  1,10) 0,95     (0,83-  1,10)
  Perkotaan                                                                                                         1,00                   1,00                   1,00                  
% Perempuan yang menyatakan bermasalah menjangkau jarak faskes                                                      1,75  ** (1,16-  2,64) 1,61   * (1,07-  2,40) 1,60   * (1,07-  2,40)
Jenis kelamin anak                                                                                                                                                                      
  Perempuan                                                                                                                                1,00                   1,00                  
  Laki-laki                                                                                                                                1,14   * (1,02-  1,28) 1,14   * (1,02-  1,28)
Urutan dan jarak kelahiran sebelumnya                                                                                                                                                   
  Pertama                                                                                                                                  1,30  ** (1,09-  1,55) 1,30  ** (1,09-  1,55)
  2 dan >=24 bulan                                                                                                                         1,00                   1,00                  
  2 dan <24 bulan                                                                                                                          2,04 *** (1,53-  2,72) 2,04 *** (1,53-  2,72)
  >=3 dan >=24 bulan                                                                                                                       1,41 *** (1,19-  1,69) 1,41 *** (1,19-  1,69)
  >=3 dan <24 bulan                                                                                                                        2,63 *** (2,09-  3,31) 2,63 *** (2,09-  3,31)
Umur ibu saat melahirkan                                                                                                                                                                
  <20                                                                                                                                      1,30   * (1,05-  1,60) 1,30   * (1,05-  1,60)
  20-29                                                                                                                                    1,00                   1,00                  
  30-39                                                                                                                                    1,06     (0,92-  1,23) 1,06     (0,92-  1,23)
  40-49                                                                                                                                    1,78 *** (1,36-  2,33) 1,78 *** (1,36-  2,33)
Interval umur x Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                                                   
  0-6 hari x Tidak                                                                                                                                                1,00                  
  0-6 hari x Rendah                                                                                                                                               1,11     (0,90-  1,37)
  0-6 hari x Tinggi                                                                                                                                               1,04     (0,81-  1,35)
  7-28 hari x Tidak                                                                                                                                               1,00                  
  7-28 hari x Rendah                                                                                                                                              1,03     (0,68-  1,55)
  7-28 hari x Tinggi                                                                                                                                              1,33     (0,86-  2,05)
  29 hari-5 bulan x Tidak                                                                                                                                         1,00                  
  29 hari-5 bulan x Rendah                                                                                                                                        1,43   * (1,05-  1,96)
  29 hari-5 bulan x Tinggi                                                                                                                                        1,56   * (1,10-  2,22)
  6-11 bulan x Tidak                                                                                                                                              1,00                  
  6-11 bulan x Rendah                                                                                                                                             1,53   * (1,02-  2,30)
  6-11 bulan x Tinggi                                                                                                                                             1,85  ** (1,20-  2,85)
  12-23 bulan x Tidak                                                                                                                                             1,00                  
  12-23 bulan x Rendah                                                                                                                                            1,52     (0,96-  2,43)
  12-23 bulan x Tinggi                                                                                                                                            2,10  ** (1,30-  3,39)
  24-59 bulan x Tidak                                                                                                                                             1,00                  
  24-59 bulan x Rendah                                                                                                                                            1,09     (0,69-  1,73)
  24-59 bulan x Tinggi                                                                                                                                            1,01     (0,60-  1,73)
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. collect export ".\output\model.xls", as(xls) sheet(u5death_side_ci) modify
(collection default exported to file .\output\model.xls)

. 
. *bawah
. collect style autolevels result _r_b _r_ci, clear

. quietly collect layout (colname#result result[chi2 chi2_c N N_g]) (cmdset)

. collect style _cons first

. collect style header result[N chi2 chi2_c N_g], level(label)

. collect label levels result N "Jumlah Observasi" chi2 "Chi2-simultan"           ///
>                 chi2_c "Chi2 vs fix" N_g "Jumlah Komunitas", modify

. collect style cell result[_r_b chi2 chi2_c], nformat(%6,2fc)

. collect style cell result[_r_ci], nformat(%6,2fc) sformat("(%s)") cidelimiter("-")

. collect style cell result[N N_g], nformat(%9,0fc)

. collect stars _r_p "0.001" "***" "0.01" "**" "0.05" "*", attach(_r_b)

. collect style column, dups(center)

. collect style row stack, nobinder delimiter(" x ")

. collect style header result, level(hide)

. collect style cell, font( Times New Roman, size(8) )

. collect style cell border_block, border(right, pattern(nil))

. collect preview

-------------------------------------------------------------------------------------------------------------------------------------------
                                                                                  1             2             3             4             5
-------------------------------------------------------------------------------------------------------------------------------------------
Intercept                                                                   0,01***       0,01***       0,01***       0,01***       0,01***
                                                                      (0,01-  0,01) (0,01-  0,01) (0,01-  0,01) (0,00-  0,01) (0,00-  0,01)
Interval umur                                                                                                                              
  0-6 hari                                                                     1,00          1,00          1,00          1,00          1,00
  7-28 hari                                                                 0,27***       0,27***       0,27***       0,27***       0,26***
                                                                      (0,22-  0,32) (0,22-  0,32) (0,22-  0,32) (0,22-  0,32) (0,19-  0,34)
  29 hari-5 bulan                                                           0,46***       0,46***       0,46***       0,46***       0,38***
                                                                      (0,39-  0,54) (0,39-  0,54) (0,39-  0,54) (0,39-  0,54) (0,30-  0,49)
  6-11 bulan                                                                0,28***       0,28***       0,28***       0,28***       0,22***
                                                                      (0,23-  0,34) (0,23-  0,34) (0,23-  0,34) (0,23-  0,34) (0,16-  0,29)
  12-23 bulan                                                               0,22***       0,22***       0,22***       0,22***       0,16***
                                                                      (0,18-  0,27) (0,18-  0,27) (0,18-  0,27) (0,18-  0,27) (0,12-  0,23)
  24-59 bulan                                                               0,20***       0,20***       0,20***       0,20***       0,20***
                                                                      (0,16-  0,25) (0,16-  0,25) (0,16-  0,25) (0,16-  0,25) (0,15-  0,28)
var(_cons[psu])                                                                0,34          0,27          0,23          0,19          0,19
                                                                      (0,24-  0,48) (0,18-  0,40) (0,14-  0,37) (0,11-  0,33) (0,11-  0,33)
Status deprivasi lingkungan rumah tangga (3 kategori)                                                                                      
  Tidak                                                                                      1,00          1,00          1,00              
  Rendah                                                                                  1,44***        1,27**        1,22**              
                                                                                    (1,26-  1,65) (1,09-  1,47) (1,05-  1,42)              
  Tinggi                                                                                  1,78***       1,39***        1,32**              
                                                                                    (1,53-  2,08) (1,16-  1,67) (1,09-  1,59)              
Pendidikan orang tua (ibu-ayah)                                                                                                            
  Rendah                                                                                                1,34***        1,28**        1,28**
                                                                                                  (1,14-  1,56) (1,09-  1,50) (1,09-  1,50)
  Ibu < ayah                                                                                             1,32**        1,27**        1,27**
                                                                                                  (1,10-  1,57) (1,06-  1,53) (1,06-  1,53)
  Ibu > ayah                                                                                               1,06          1,06          1,06
                                                                                                  (0,87-  1,28) (0,87-  1,28) (0,87-  1,28)
  Tinggi                                                                                                   1,00          1,00          1,00
Indeks kekayaan rumah tangga                                                                                                               
  Miskin                                                                                                  1,29*         1,28*         1,28*
                                                                                                  (1,04-  1,60) (1,03-  1,59) (1,03-  1,59)
  Menengah                                                                                                 1,15          1,16          1,16
                                                                                                  (0,94-  1,40) (0,95-  1,42) (0,95-  1,42)
  Kaya                                                                                                     1,00          1,00          1,00
Wilayah tempat tinggal                                                                                                                     
  Perdesaan                                                                                                0,95          0,95          0,95
                                                                                                  (0,82-  1,09) (0,83-  1,10) (0,83-  1,10)
  Perkotaan                                                                                                1,00          1,00          1,00
% Perempuan yang menyatakan bermasalah menjangkau jarak faskes                                           1,75**         1,61*         1,60*
                                                                                                  (1,16-  2,64) (1,07-  2,40) (1,07-  2,40)
Jenis kelamin anak                                                                                                                         
  Perempuan                                                                                                              1,00          1,00
  Laki-laki                                                                                                             1,14*         1,14*
                                                                                                                (1,02-  1,28) (1,02-  1,28)
Urutan dan jarak kelahiran sebelumnya                                                                                                      
  Pertama                                                                                                              1,30**        1,30**
                                                                                                                (1,09-  1,55) (1,09-  1,55)
  2 dan >=24 bulan                                                                                                       1,00          1,00
  2 dan <24 bulan                                                                                                     2,04***       2,04***
                                                                                                                (1,53-  2,72) (1,53-  2,72)
  >=3 dan >=24 bulan                                                                                                  1,41***       1,41***
                                                                                                                (1,19-  1,69) (1,19-  1,69)
  >=3 dan <24 bulan                                                                                                   2,63***       2,63***
                                                                                                                (2,09-  3,31) (2,09-  3,31)
Umur ibu saat melahirkan                                                                                                                   
  <20                                                                                                                   1,30*         1,30*
                                                                                                                (1,05-  1,60) (1,05-  1,60)
  20-29                                                                                                                  1,00          1,00
  30-39                                                                                                                  1,06          1,06
                                                                                                                (0,92-  1,23) (0,92-  1,23)
  40-49                                                                                                               1,78***       1,78***
                                                                                                                (1,36-  2,33) (1,36-  2,33)
Interval umur x Status deprivasi lingkungan rumah tangga (3 kategori)                                                                      
  0-6 hari x Tidak                                                                                                                     1,00
  0-6 hari x Rendah                                                                                                                    1,11
                                                                                                                              (0,90-  1,37)
  0-6 hari x Tinggi                                                                                                                    1,04
                                                                                                                              (0,81-  1,35)
  7-28 hari x Tidak                                                                                                                    1,00
  7-28 hari x Rendah                                                                                                                   1,03
                                                                                                                              (0,68-  1,55)
  7-28 hari x Tinggi                                                                                                                   1,33
                                                                                                                              (0,86-  2,05)
  29 hari-5 bulan x Tidak                                                                                                              1,00
  29 hari-5 bulan x Rendah                                                                                                            1,43*
                                                                                                                              (1,05-  1,96)
  29 hari-5 bulan x Tinggi                                                                                                            1,56*
                                                                                                                              (1,10-  2,22)
  6-11 bulan x Tidak                                                                                                                   1,00
  6-11 bulan x Rendah                                                                                                                 1,53*
                                                                                                                              (1,02-  2,30)
  6-11 bulan x Tinggi                                                                                                                1,85**
                                                                                                                              (1,20-  2,85)
  12-23 bulan x Tidak                                                                                                                  1,00
  12-23 bulan x Rendah                                                                                                                 1,52
                                                                                                                              (0,96-  2,43)
  12-23 bulan x Tinggi                                                                                                               2,10**
                                                                                                                              (1,30-  3,39)
  24-59 bulan x Tidak                                                                                                                  1,00
  24-59 bulan x Rendah                                                                                                                 1,09
                                                                                                                              (0,69-  1,73)
  24-59 bulan x Tinggi                                                                                                                 1,01
                                                                                                                              (0,60-  1,73)
Chi2-simultan                                                                496,48        556,79        598,52        715,53        705,73
Chi2 vs fix                                                                   51,47         31,36         23,74         16,73         16,75
Jumlah Observasi                                                            204.706       204.706       204.706       204.706       204.706
Jumlah Komunitas                                                              1.970         1.970         1.970         1.970         1.970
-------------------------------------------------------------------------------------------------------------------------------------------

. collect export ".\output\model.xls", as(xls) sheet(u5death_down_ci, replace) modify
(collection default exported to file .\output\model.xls)

. 
end of do-file

