----------------------------------------------------------------------------------------------------------------------------------
      name:  log_1_wealth_index_idhs17
       log:  D:\RESEARCH & WRITING\master thesis_child mortality\stata\log\1_wealth_index_idhs17.log
  log type:  text
 opened on:  25 Jan 2022, 10:27:07

. 
. /*
> ================================================================================
> ********************************************************************************
> PROJECT:
> PENELITIAN TESIS
> HUBUNGAN ANTARA DEPRIVASI LINGKUNGAN RUMAH TANGGA DENGAN KEMATIAN BAYI DAN ANAK
> DI INDONESIA: BUKTI DARI MODEL LOGISTIK MULTILEVEL HAZARD DISKRIT
> 
> SYNTAX:
> 1-MEMBENTUK INDEKS KEKAYAAN
> METODE DHS, RUTSTEIN & JOHNSON (2004)
> 
> PENULIS:
> ARI PURWANTO SARWO PRASOJO (2006500321)
> MAGISTER EKONOMI KEPENDUDUKAN DAN KETENAGAKERJAAN
> FEB, UNIVERSITAS INDONESIA
> 2021
> ********************************************************************************
> ================================================================================
> */
. 
. 
. 
. /*
> ================================================================================
> PENYIAPAN
> ================================================================================
> */
. 
. set maxvar 10000


. 
. *set the date
. loc date = c(current_date)

. loc time = c(current_time)

. loc time_date = "`date'" + "_" + "`time'"

. loc tag "`dfn'.do Ari Prasojo `time_date'"

. 
. *direktori dataset
. *\dataset individu
. loc irc                 "D:\PUSDATIN\DATA MIKRO\IDHS\2017\IDIR71DT\IDIR71FL.dta"

. 
. *\dataset laki-laki
. loc mrc                 "D:\PUSDATIN\DATA MIKRO\IDHS\2017\IDMR71DT\IDMR71FL.dta"

. 
. *\dataset rumah tangga
. loc hrc                 "D:\PUSDATIN\DATA MIKRO\IDHS\2017\IDHR71DT\IDHR71FL.dta"

. 
. *\dataset disimpan sebagai (nama)
. loc savenm              "dta\1-wealth-index-`idhs'.dta"

. 
. *membuat label
. lab def yatidak 0 "Tidak" 1 "Ya"                //yatidak

. 
. 
. 
. /*
> ================================================================================
> KONSTRUKSI INDIKATOR DARI DATASET INIDIVIDU
> 
> Untuk membentuk variabel house, land
> ================================================================================
> */
. 
. /*
> ******************************************************************
> Perempuan                                                                                                       [done]
> ******************************************************************
>  */
. clear all

. use caseid v001 v002 v003 v745a v745b using "`irc'"

. 
. recode v745a (0 = 0) (1/3 = 1), gen(whouse)
(16181 differences between v745a and whouse)

. recode v745b (0 = 0) (1/3 = 1), gen(wland)
(9557 differences between v745b and wland)

. egen hwhouse = max(whouse), by(v001 v002)
(8 missing values generated)

. egen hwland = max(wland), by(v001 v002)
(9 missing values generated)

. duplicates drop v001 v002, force

Duplicates in terms of v001 v002

(12,683 observations deleted)

. save whouseland, replace
(file whouseland.dta not found)
file whouseland.dta saved

. 
. /*
> ******************************************************************
> Laki-Laki                                                                                                       [done]
> ******************************************************************
>  */
. clear all

. use mcaseid mv001 mv002 mv003 mv745a mv745b using "`mrc'"

. 
. rename mv001 v001

. rename mv002 v002

. recode mv745a (0 = 0) (1/3 = 1), gen(mhouse)
(2257 differences between mv745a and mhouse)

. recode mv745b (0 = 0) (1/3 = 1), gen(mland)
(1365 differences between mv745b and mland)

. egen hmhouse = max(mhouse), by(v001 v002)
(2 missing values generated)

. egen hmland = max(mland), by(v001 v002)
(3 missing values generated)

. duplicates drop v001 v002, force

Duplicates in terms of v001 v002

(662 observations deleted)

. save mhouseland, replace
(file mhouseland.dta not found)
file mhouseland.dta saved

. 
. /*
> ******************************************************************
> Merge individu perempuan dan laki-laki (household)                      [done]
> ******************************************************************
>  */
. merge 1:1 v001 v002 using whouseland

    Result                      Number of obs
    -----------------------------------------
    Not matched                        28,865
        from master                       634  (_merge==1)
        from using                     28,231  (_merge==2)

    Matched                             8,713  (_merge==3)
    -----------------------------------------

. keep v001 v002 hwhouse hwland hmhouse hmland

. gen house = 0

.         replace house = 1 if hwhouse == 1 | hmhouse == 1
(24,968 real changes made)

.         lab var house "Kepemilikan tempat tinggal"

.         lab val house yatidak

. gen land = 0

.         replace land = 1 if hwland == 1 | hmland == 1
(17,315 real changes made)

.         lab var land "Kepemilikan lahan tempat tinggal"

.         lab val land yatidak

.         
. erase whouseland.dta

. erase mhouseland.dta

. save houseland, replace
(file houseland.dta not found)
file houseland.dta saved

. 
. /*
> ******************************************************************
> Merge dengan household dataset                                                          [done]
> ******************************************************************
>  */
. clear all 

. use "`hrc'"

. rename hv001 v001

. rename hv002 v002

. sort v001 v002

. merge 1:1 v001 v002 using houseland

    Result                      Number of obs
    -----------------------------------------
    Not matched                        10,385
        from master                    10,385  (_merge==1)
        from using                          0  (_merge==2)

    Matched                            37,578  (_merge==3)
    -----------------------------------------

. erase houseland.dta

. 
. /*
> ******************************************************************
> Replace missing dengan 0                                                                        [done]
> ******************************************************************
>  */
. replace house = 0 if missing(house)
(10,385 real changes made)

. replace land = 0 if missing(land)
(10,385 real changes made)

. summ house

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       house |     47,963    .5205679     .499582          0          1

. summ land

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        land |     47,963    .3610074    .4802977          0          1

. 
. 
. 
. /*
> ================================================================================
> KONSTRUKSI INDIKATOR DARI DATASET RUMAH TANGGA
> ================================================================================
> */
. 
. /*
> ******************************************************************
> Recode, merubah menjadi variabel dikotom                                                                                        
> ******************************************************************
> */
. 
. /*
> ------------------------------------------------------------------
> Fungsi-fungsi/perintah-perintah
> vr              : nama variabel
> value   : nilai variabel
> name    : nama variabel varu
> lbl             : label variabel baru
> ------------------------------------------------------------------
> */
. 
. *\Perintah untuk dikotomisasi                                                           [done]
. program dikotom
  1.         args vr value name lbl
  2.         recode `vr' (`value' = 1) (else = 0), gen(`name')
  3.         lab var `name' "`lbl'"
  4.         lab val `name' yatidak
  5. end

. 
. *\Perintah untuk clone variabel                                                         [done]
. program klon
  1.         args vr name lbl
  2.         clonevar `name' = `vr'
  3.         replace `name' = 0 if missing(`name')
  4.         lab var `name' "`lbl'"
  5.         lab val `name' yatidak
  6. end     

. 
. /*
> ------------------------------------------------------------------
> Indikator-indikator penyusun indeks kekayaan
> ------------------------------------------------------------------
> */
. 
. *\Sumber air minum (hv201)                                                                      [done]
. dikotom hv201 11 drinkwat_11 "hv201_11_Sumber air minum: saluran ke hunian"
(47963 differences between hv201 and drinkwat_11)

. dikotom hv201 12 drinkwat_12 "hv201_12_Sumber air minum: pipa disalurkan ke halaman/petak"
(47963 differences between hv201 and drinkwat_12)

. dikotom hv201 13 drinkwat_13 "hv201_13_Sumber air minum: pipa disalurkan ke tetangga"
(47963 differences between hv201 and drinkwat_13)

. dikotom hv201 14 drinkwat_14 "hv201_14_Sumber air minum: keran/pipa umum"
(47963 differences between hv201 and drinkwat_14)

. dikotom hv201 21 drinkwat_21 "hv201_21_Sumber air minum: sumur tabung/bor"
(47963 differences between hv201 and drinkwat_21)

. dikotom hv201 31 drinkwat_31 "hv201_31_Sumber air minum: sumur terlindungi"
(47963 differences between hv201 and drinkwat_31)

. dikotom hv201 32 drinkwat_32 "hv201_32_Sumber air minum: sumur tidak terlindungi"
(47963 differences between hv201 and drinkwat_32)

. dikotom hv201 41 drinkwat_41 "hv201_41_Sumber air minum: mata air terlindungi"
(47963 differences between hv201 and drinkwat_41)

. dikotom hv201 42 drinkwat_42 "hv201_42_Sumber air minum: mata air tidak terlindungi"
(47963 differences between hv201 and drinkwat_42)

. dikotom hv201 43 drinkwat_43 "hv201_43_Sumber air minum: sungai/bendungan/danau/kolam/sungai/saluran/saluran irigasi"
(47963 differences between hv201 and drinkwat_43)
note: label truncated to 80 characters

. dikotom hv201 51 drinkwat_51 "hv201_51_Sumber air minum: air hujan"
(47963 differences between hv201 and drinkwat_51)

. dikotom hv201 61 drinkwat_61 "hv201_61_Sumber air minum: truk tangki"
(47963 differences between hv201 and drinkwat_61)

. dikotom hv201 62 drinkwat_62 "hv201_62_Sumber air minum: gerobak dengan tangki kecil"
(47963 differences between hv201 and drinkwat_62)

. dikotom hv201 71 drinkwat_71 "hv201_71_Sumber air minum: air kemasan"
(47963 differences between hv201 and drinkwat_71)

. dikotom hv201 72 drinkwat_72 "hv201_72_Sumber air minum: air isi ulang"
(47963 differences between hv201 and drinkwat_72)

. dikotom hv201 96 drinkwat_96 "hv201_96_Sumber air minum: lainnya"
(47963 differences between hv201 and drinkwat_96)

. 
. *\Jenis fasilitas toilet (sh109)                                                        [done]
. dikotom sh109 11 toiletfac_11 "sh109_11_Jenis toilet: pribadi-dengan tangki septik"
(47963 differences between sh109 and toiletfac_11)

. dikotom sh109 12 toiletfac_12 "sh109_12_Jenis toilet: pribadi-tanpa tangki septik"
(47963 differences between sh109 and toiletfac_12)

. dikotom sh109 21 toiletfac_21 "sh109_21_Jenis toilet: bersama/umum"
(47963 differences between sh109 and toiletfac_21)

. dikotom sh109 31 toiletfac_31 "sh109_31_Jenis toilet: sungai/sungai kecil"
(47963 differences between sh109 and toiletfac_31)

. dikotom sh109 32 toiletfac_32 "sh109_32_Jenis toilet: pantai"
(47963 differences between sh109 and toiletfac_32)

. dikotom sh109 33 toiletfac_33 "sh109_33_Jenis toilet: kolam"
(47963 differences between sh109 and toiletfac_33)

. dikotom sh109 41 toiletfac_41 "sh109_Jenis toilet: lubang"
(47963 differences between sh109 and toiletfac_41)

. dikotom sh109 51 toiletfac_51 "sh109_Jenis toilet: pekarangan/semak/hutan"
(47963 differences between sh109 and toiletfac_51)

. dikotom sh109 96 toiletfac_96 "sh109_Jenis toilet: lainnya"
(47963 differences between sh109 and toiletfac_96)

. 
. *\Bahan bakar memasak (hv226)                                                           [done]
. dikotom hv226 1 cookfuel_1 "hv226_1_Bahan bakar memasak: listrik"
(47763 differences between hv226 and cookfuel_1)

. dikotom hv226 2 cookfuel_2 "hv226_2_Bahan bakar memasak: LPG"
(47963 differences between hv226 and cookfuel_2)

. dikotom hv226 3 cookfuel_3 "hv226_3_Bahan bakar memasak: gas alam"
(47963 differences between hv226 and cookfuel_3)

. dikotom hv226 4 cookfuel_4 "hv226_4_Bahan bakar memasak: biogas"
(47963 differences between hv226 and cookfuel_4)

. dikotom hv226 5 cookfuel_5 "hv226_5_Bahan bakar memasak: minyak tanah"
(47963 differences between hv226 and cookfuel_5)

. dikotom hv226 6 cookfuel_6 "hv226_6_Bahan bakar memasak: batubara, lignit"
(47963 differences between hv226 and cookfuel_6)

. dikotom hv226 7 cookfuel_7 "hv226_7_Bahan bakar memasak: arang"
(47963 differences between hv226 and cookfuel_7)

. dikotom hv226 8 cookfuel_8 "hv226_8_Bahan bakar memasak: kayu"
(47963 differences between hv226 and cookfuel_8)

. replace hv226 = 9 if hv226 == 10
(1 real change made)

. dikotom hv226 9 cookfuel_9 "hv226_9_Bahan bakar memasak: jerami/semak/rumput/tanaman"
(47963 differences between hv226 and cookfuel_9)

. dikotom hv226 95 cookfuel_96 "hv226_95_Bahan bakar memasak: tidak ada makanan yang dimasak di rumah"
(47963 differences between hv226 and cookfuel_96)

. 
. *\Aset-aset                                                                                                     [done]
. 
. *\\Listrik (hv206)                              
. klon hv206 electricity "Keberadaan listrik"
(21 missing values generated)
(21 real changes made)

. 
. *\\Radio (hv207)                                                                                
. klon hv207 radio "Kepemilikan radio"
(44 missing values generated)
(44 real changes made)

. 
. *\\Televisi (hv208)                                                                                     
. klon hv208 television "Kepemilikan televisi"
(13 missing values generated)
(13 real changes made)

. 
. *\\Telepon/non-hp (hv221)                                                                       
. klon hv221 telephone "Kepemilikan telepon"
(36 missing values generated)
(36 real changes made)

. 
. *\\Komputer (hv234e)                                                            
. klon hv243e computer "Kepemilikan komputer"
(39 missing values generated)
(39 real changes made)

. 
. *\\Refrigerator (hv209)                                                                         
. klon hv209 refrigerator "Kepemilikan lemari es/refrigerator"
(18 missing values generated)
(18 real changes made)

. 
. *\\Fan/kipas angin (sh121g)                                                                     
. klon sh121g fan "Kepemilikan fan/kipas angin"
(10 missing values generated)
(10 real changes made)

. 
. *\\Mesin cuci (sh121h)                                                                          
. klon sh121h washingmach "Kepemilikan mesin cuci"
(22 missing values generated)
(22 real changes made)

. 
. *\\AC (sh121i)                                                                                          
. klon sh121i aircond "Kepemilikan AC"
(53 missing values generated)
(53 real changes made)

. 
. *\\Jam (hv243b)                                                                                         
. klon hv243b watch "Kepemilikan jam/arloji"
(19 missing values generated)
(19 real changes made)

. 
. *\\Handphone/telepon genggam (hv243a)                                           
. klon hv243a hp "Kepemilikan telepon genggam"
(16 missing values generated)
(16 real changes made)

. 
. *\\Sepeda (hv210)                                                                                       
. klon hv210 bcycle "Kepemilikan sepeda"
(41 missing values generated)
(41 real changes made)

. 
. *\\Sepeda motor (hv211)                                                                         
. klon hv211 motorcyc "Kepemilikan sepeda motor (salah satu anggota)"
(24 missing values generated)
(24 real changes made)

. 
. *\\Gerobak yang ditarik hewan (hv243c)                                          
. klon hv243c animdrcart "Kepemilikan gerobak/kendaraan yang ditarik oleh hewan"
(44 missing values generated)
(44 real changes made)

. 
. *\\Mobil (hv212)                                                                                        
. klon hv212 car "Kepemilikan mobil atau truk (salah satu anggota)"
(24 missing values generated)
(24 real changes made)

. 
. *\\Perahu motor (hv243d)                                                                        
. klon hv243d boat "Kepemilikan perahu motor"
(59 missing values generated)
(59 real changes made)

. 
. *\\Rekening bank (hv247)                                                                        
. klon hv247 bankac "Kepemilikan rekening bank (salah satu anggota)"
(60 missing values generated)
(60 real changes made)

. 
. *\Jenis lantai utama rumah (hv213)                                                      [done]
. replace hv213 = 11 if hv213 == 12
(2 real changes made)

. dikotom hv213 11 matfloor_11 "hv213_Jenis lantai rumah: tanah/pasir"
(47963 differences between hv213 and matfloor_11)

. dikotom hv213 21 matfloor_21 "hv213_Jenis lantai rumah: papan kayu"
(47963 differences between hv213 and matfloor_21)

. dikotom hv213 22 matfloor_22 "hv213_Jenis lantai rumah: palma/bambu"
(47963 differences between hv213 and matfloor_22)

. dikotom hv213 31 matfloor_31 "hv213_Jenis lantai rumah: parket atau kayu poles"
(47963 differences between hv213 and matfloor_31)

. dikotom hv213 32 matfloor_32 "hv213_Jenis lantai rumah: vinil/aspal"
(47963 differences between hv213 and matfloor_32)

. dikotom hv213 33 matfloor_33 "hv213_Jenis lantai rumah: keramik/marmer/granit"
(47963 differences between hv213 and matfloor_33)

. dikotom hv213 34 matfloor_34 "hv213_Jenis lantai rumah: ubin lantai/teraso"
(47963 differences between hv213 and matfloor_34)

. dikotom hv213 35 matfloor_35 "hv213_Jenis lantai rumah: semen/batu bata merah"
(47963 differences between hv213 and matfloor_35)

. dikotom hv213 36 matfloor_36 "hv213_Jenis lantai rumah: karpet"
(47963 differences between hv213 and matfloor_36)

. dikotom hv213 96 matfloor_96 "hv213_Jenis lantai rumah: lainnya"
(47963 differences between hv213 and matfloor_96)

. 
. *\Jenis atap rumah (hv215)                                                                      [done]
. dikotom hv215 12 matroof_12 "hv215_Jenis atap rumah: rumbia/daun palem"
(47963 differences between hv215 and matroof_12)

. dikotom hv215 13 matroof_13 "hv215_Jenis atap rumah: atap tanah atau sod"
(47963 differences between hv215 and matroof_13)

. dikotom hv215 21 matroof_21 "hv215_Jenis atap rumah: atap tikar pedesaan"
(47963 differences between hv215 and matroof_21)

. dikotom hv215 22 matroof_22 "hv215_Jenis atap rumah: palma/bambu"
(47963 differences between hv215 and matroof_22)

. dikotom hv215 23 matroof_23 "hv215_Jenis atap rumah: papan kayu"
(47963 differences between hv215 and matroof_23)

. dikotom hv215 31 matroof_31 "hv215_Jenis atap rumah: roofing, seng"
(47963 differences between hv215 and matroof_31)

. dikotom hv215 32 matroof_32 "hv215_Jenis atap rumah: asbes"
(47963 differences between hv215 and matroof_32)

. dikotom hv215 33 matroof_33 "hv215_Jenis atap rumah: genteng"
(47963 differences between hv215 and matroof_33)

. dikotom hv215 34 matroof_34 "hv215_Jenis atap rumah: beton"
(47963 differences between hv215 and matroof_34)

. dikotom hv215 35 matroof_35 "hv215_Jenis atap rumah: genteng logam"
(47963 differences between hv215 and matroof_35)

. dikotom hv215 36 matroof_36 "hv215_Jenis atap rumah: atap sirap"
(47963 differences between hv215 and matroof_36)

. dikotom hv215 96 matroof_96 "hv215_Jenis atap rumah: lainnya"
(47963 differences between hv215 and matroof_96)

. 
. *\Jenis dinding rumah (hv214)                                                           [done]
. dikotom hv214 12 matwall_12 "hv214_Jenis dinding rumah: tongkat/palma/batang"
(47963 differences between hv214 and matwall_12)

. replace hv214 = 21 if hv214 == 13
(1 real change made)

. dikotom hv214 21 matwall_21 "hv214_Jenis dinding rumah: bambu dengan tanah/tanah"
(47963 differences between hv214 and matwall_21)

. dikotom hv214 22 matwall_22 "hv214_Jenis dinding rumah: batu dengan tanah"
(47963 differences between hv214 and matwall_22)

. dikotom hv214 23 matwall_23 "hv214_Jenis dinding rumah: batu bata terbuka"
(47963 differences between hv214 and matwall_23)

. dikotom hv214 24 matwall_24 "hv214_Jenis dinding rumah: kayu lapis"
(47963 differences between hv214 and matwall_24)

. dikotom hv214 25 matwall_25 "hv214_Jenis dinding rumah: karton"
(47963 differences between hv214 and matwall_25)

. dikotom hv214 26 matwall_26 "hv214_Jenis dinding rumah: kayu bekas"
(47963 differences between hv214 and matwall_26)

. dikotom hv214 31 matwall_31 "hv214_Jenis dinding rumah: anyaman bambu"
(47963 differences between hv214 and matwall_31)

. dikotom hv214 32 matwall_32 "hv214_Jenis dinding rumah: batu dengan kapur/semen"
(47963 differences between hv214 and matwall_32)

. dikotom hv214 34 matwall_34 "hv214_Jenis dinding rumah: batako"
(47963 differences between hv214 and matwall_34)

. dikotom hv214 35 matwall_35 "hv214_Jenis dinding rumah: batu bata tertutup"
(47963 differences between hv214 and matwall_35)

. dikotom hv214 36 matwall_36 "hv214_Jenis dinding rumah: papan kayu/sirap"
(47963 differences between hv214 and matwall_36)

. dikotom hv214 37 matwall_37 "hv214_Jenis dinding rumah: kawat plester"
(47963 differences between hv214 and matwall_37)

. dikotom hv214 38 matwall_38 "hv214_Jenis dinding rumah: gipsum/asbes"
(47963 differences between hv214 and matwall_38)

. dikotom hv214 96 matwall_96 "hv214_Jenis dinding rumah: lainnya"
(47963 differences between hv214 and matwall_96)

. 
. *\Jumlah art per ruang/kamar untuk tidur                                        [done]
. gen memsleep = .
(47,963 missing values generated)

.         lab var memsleep "Jumlah art per ruang untuk tidur"

.         gen nmember = hv012

.         replace nmember = hv013 if nmember == 0
(0 real changes made)

.         replace memsleep = trunc(hv012/hv216) if hv216 > 0
(47,617 real changes made)

.         replace memsleep = hv012 if hv216 == 0
(307 real changes made)

.         drop nmember

. 
. *\Luas lantai                                                                                           [done]
. gen floorarea = sh142a
(52 missing values generated)

.         lab var floorarea "Luas lantai rumah (m2)"

.         replace floorarea = . if sh142a == 998
(268 real changes made, 268 to missing)

.         summ floorarea

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   floorarea |     47,643    77.74731    58.19067          0        995

. 
. *\Luas lahan (hv244, hv245)                                                                     [done]
. gen landagr = hv244
(4 missing values generated)

.         lab var landagr "Kepemilikan lahan yang dapat digunakan untuk pertanian"

.         lab val landagr yatidak

.         replace landagr = 0 if landagr != 1
(4 real changes made)

. 
. replace hv245 = hv245/10
variable hv245 was int now float
(16,697 real changes made)

. gen landarea = 0

.         lab var landarea "Luas lahan yang dapat digunakan untuk pertanian (hektar)"

.         replace landarea = hv245 if !missing(hv245)
(16,697 real changes made)

.         replace landarea = . if missing(hv245) | hv245 > 99.8
(30,675 real changes made, 30,675 to missing)

.         replace landarea = 0 if hv244 != 1
(29,969 real changes made)

. 
. *\Kepemilikan ternak                                                                            [done]
. /*
> hv246b, hv246g, hv246c, hv246h, hv246i, hv246f
> cows/bulls, water buffaloes, horses/dunkeys/mules, goats/sheep, pigs, chickens/poultry
> sapi/banteng, kerbau, kuda/keledai, kambing/domba, babi, ayam/unggas
> */
. 
. recode hv246c (1/4 = 1) (5/95 = 2) (else = 0), gen(hv246c_r)
(29321 differences between hv246c and hv246c_r)

. recode hv246f (1/9 = 1) (10/29 = 2) (30/95 = 3) (else = 0), gen(hv246f_r)
(44679 differences between hv246f and hv246f_r)

. 
. foreach i of varlist hv246b hv246g hv246h hv246i  {
  2.         recode `i' (1/4 = 1) (5/9 = 2) (10/95 = 3) (else = 0), gen(`i'_r)
  3. }
(31277 differences between hv246b and hv246b_r)
(29406 differences between hv246g and hv246g_r)
(31686 differences between hv246h and hv246h_r)
(30649 differences between hv246i and hv246i_r)

. 
. *\\sapi/banteng
. dikotom hv246b_r 1 cowbull_1 "hv246b_Kepemilikan sapi/banteng: 1-4"
(368 differences between hv246b_r and cowbull_1)

. dikotom hv246b_r 2 cowbull_2 "hv246b_Kepemilikan sapi/banteng: 5-9"
(2960 differences between hv246b_r and cowbull_2)

. dikotom hv246b_r 3 cowbull_3 "hv246b_Kepemilikan sapi/banteng: 10+"
(2960 differences between hv246b_r and cowbull_3)

. 
. *\\kerbau
. dikotom hv246g_r 1 buffal_1 "hv246g_Kepemilikan kerbau: 1-4"
(32 differences between hv246g_r and buffal_1)

. dikotom hv246g_r 2 buffal_2 "hv246g_Kepemilikan kerbau: 5-9"
(206 differences between hv246g_r and buffal_2)

. dikotom hv246g_r 3 buffal_3 "hv246g_Kepemilikan kerbau: 10+"
(206 differences between hv246g_r and buffal_3)

. 
. *\\kuda/keledai
. dikotom hv246c_r 1 horse_1 "hv246c_Kepemilikan kuda/keledai: 1-4"
(5 differences between hv246c_r and horse_1)

. dikotom hv246c_r 2 horse_2 "hv246c_Kepemilikan kuda/keledai: 5+"
(77 differences between hv246c_r and horse_2)

. 
. *\\kambing/domba
. dikotom hv246h_r 1 goat_1 "hv246h_Kepemilikan kambing/domba: 1-4"
(901 differences between hv246h_r and goat_1)

. dikotom hv246h_r 2 goat_2 "hv246h_Kepemilikan kambing/domba: 5-9"
(2866 differences between hv246h_r and goat_2)

. dikotom hv246h_r 3 goat_3 "hv246h_Kepemilikan kambing/domba: 10+"
(2866 differences between hv246h_r and goat_3)

. 
. *\\babi
. dikotom hv246i_r 1 pig_1 "hv246i_Kepemilikan babi: 1-4"
(282 differences between hv246i_r and pig_1)

. dikotom hv246i_r 2 pig_2 "hv246i_Kepemilikan babi: 5-9"
(2333 differences between hv246i_r and pig_2)

. dikotom hv246i_r 3 pig_3 "hv246i_Kepemilikan babi: 10+"
(2333 differences between hv246i_r and pig_3)

. 
. *\\ayam/unggas
. dikotom hv246f_r 1 chicken_1 "hv246f_Kepemilikan ayam/unggas: 1-4"
(6212 differences between hv246f_r and chicken_1)

. dikotom hv246f_r 2 chicken_2 "hv246f_Kepemilikan ayam/unggas: 5-9"
(16263 differences between hv246f_r and chicken_2)

. dikotom hv246f_r 3 chicken_3 "hv246f_Kepemilikan ayam/unggas: 10+"
(16263 differences between hv246f_r and chicken_3)

. 
. 
. /*
> ******************************************************************
> Deskriptif                                                                              
> ******************************************************************
> */
. 
. /*
> ------------------------------------------------------------------
> Cek frekuensi dengan indikator asli                                                     [done]
> ------------------------------------------------------------------
> */
. 
. *\\Sumber air
. tab hv201

               source of drinking water |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                    piped into dwelling |      4,060        8.47        8.47
                     piped to yard/plot |        642        1.34        9.80
                      piped to neighbor |        389        0.81       10.62
                   public tap/standpipe |        232        0.48       11.10
                  tube well or borehole |      6,243       13.02       24.12
                         protected well |      7,655       15.96       40.08
                       unprotected well |      2,514        5.24       45.32
                       protected spring |      4,445        9.27       54.59
                     unprotected spring |      1,331        2.78       57.36
river/dam/lake/ponds/stream/canal/irrig |      1,104        2.30       59.66
                              rainwater |      1,347        2.81       62.47
                           tanker truck |        276        0.58       63.05
                   cart with small tank |        310        0.65       63.69
                          bottled water |      4,568        9.52       73.22
                         refilled water |     12,838       26.77       99.99
                                  other |          6        0.01      100.00
----------------------------------------+-----------------------------------
                                  Total |     47,960      100.00

. tab1 drinkwat_*

-> tabulation of drinkwat_11  

hv201_11_Su |
   mber air |
     minum: |
 saluran ke |
     hunian |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     43,903       91.54       91.54
          1 |      4,060        8.46      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_12  

hv201_12_Su |
   mber air |
minum: pipa |
 disalurkan |
         ke |
halaman/pet |
         ak |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,321       98.66       98.66
          1 |        642        1.34      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_13  

hv201_13_Su |
   mber air |
minum: pipa |
 disalurkan |
ke tetangga |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,574       99.19       99.19
          1 |        389        0.81      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_14  

hv201_14_Su |
   mber air |
     minum: |
 keran/pipa |
       umum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,731       99.52       99.52
          1 |        232        0.48      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_21  

hv201_21_Su |
   mber air |
     minum: |
      sumur |
 tabung/bor |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     41,720       86.98       86.98
          1 |      6,243       13.02      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_31  

hv201_31_Su |
   mber air |
     minum: |
      sumur |
terlindungi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,308       84.04       84.04
          1 |      7,655       15.96      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_32  

hv201_32_Su |
   mber air |
     minum: |
sumur tidak |
terlindungi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     45,449       94.76       94.76
          1 |      2,514        5.24      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_41  

hv201_41_Su |
   mber air |
minum: mata |
        air |
terlindungi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     43,518       90.73       90.73
          1 |      4,445        9.27      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_42  

hv201_42_Su |
   mber air |
minum: mata |
  air tidak |
terlindungi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     46,632       97.22       97.22
          1 |      1,331        2.78      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_43  

hv201_43_Su |
   mber air |
     minum: |
sungai/bend |
ungan/danau |
/kolam/sung |
ai/saluran/ |
  saluran i |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     46,859       97.70       97.70
          1 |      1,104        2.30      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_51  

hv201_51_Su |
   mber air |
 minum: air |
      hujan |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     46,616       97.19       97.19
          1 |      1,347        2.81      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_61  

hv201_61_Su |
   mber air |
minum: truk |
     tangki |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,687       99.42       99.42
          1 |        276        0.58      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_62  

hv201_62_Su |
   mber air |
     minum: |
    gerobak |
     dengan |
     tangki |
      kecil |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,653       99.35       99.35
          1 |        310        0.65      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_71  

hv201_71_Su |
   mber air |
 minum: air |
    kemasan |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     43,395       90.48       90.48
          1 |      4,568        9.52      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_72  

hv201_72_Su |
   mber air |
 minum: air |
  isi ulang |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     35,125       73.23       73.23
          1 |     12,838       26.77      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of drinkwat_96  

hv201_96_Su |
   mber air |
     minum: |
    lainnya |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,957       99.99       99.99
          1 |          6        0.01      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\\Toilet
. tab sh109

     type of toilet facility |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
   private: with septic tank |     33,638       70.15       70.15
private: with no septic tank |      3,895        8.12       78.27
               shared/public |      3,925        8.19       86.46
          river/stream/creek |      3,195        6.66       93.12
                       beach |        334        0.70       93.82
                  pool/ponds |        132        0.28       94.09
                         pit |      1,683        3.51       97.60
            yard/bush/forest |      1,126        2.35       99.95
                       other |         24        0.05      100.00
-----------------------------+-----------------------------------
                       Total |     47,952      100.00

. tab1 toiletfac_*

-> tabulation of toiletfac_11  

sh109_11_Je |
nis toilet: |
pribadi-den |
 gan tangki |
     septik |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,325       29.87       29.87
          1 |     33,638       70.13      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of toiletfac_12  

sh109_12_Je |
nis toilet: |
pribadi-tan |
  pa tangki |
     septik |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,068       91.88       91.88
          1 |      3,895        8.12      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of toiletfac_21  

sh109_21_Je |
nis toilet: |
bersama/umu |
          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,038       91.82       91.82
          1 |      3,925        8.18      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of toiletfac_31  

sh109_31_Je |
nis toilet: |
sungai/sung |
   ai kecil |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,768       93.34       93.34
          1 |      3,195        6.66      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of toiletfac_32  

sh109_32_Je |
nis toilet: |
     pantai |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,629       99.30       99.30
          1 |        334        0.70      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of toiletfac_33  

sh109_33_Je |
nis toilet: |
      kolam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,831       99.72       99.72
          1 |        132        0.28      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of toiletfac_41  

sh109_Jenis |
    toilet: |
     lubang |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     46,280       96.49       96.49
          1 |      1,683        3.51      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of toiletfac_51  

sh109_Jenis |
    toilet: |
pekarangan/ |
semak/hutan |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     46,837       97.65       97.65
          1 |      1,126        2.35      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of toiletfac_96  

sh109_Jenis |
    toilet: |
    lainnya |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,939       99.95       99.95
          1 |         24        0.05      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\\Bahan bakar memasak
. tab hv226

   type of cooking fuel |      Freq.     Percent        Cum.
------------------------+-----------------------------------
            electricity |        200        0.42        0.42
                    lpg |     31,303       65.27       65.69
            natural gas |        241        0.50       66.19
                 biogas |          7        0.01       66.21
               kerosene |      3,734        7.79       73.99
          coal, lignite |          6        0.01       74.01
               charcoal |         77        0.16       74.17
                   wood |     11,773       24.55       98.72
     straw/shrubs/grass |         15        0.03       98.75
no food cooked in house |        601        1.25      100.00
------------------------+-----------------------------------
                  Total |     47,957      100.00

. tab1 cookfuel_*

-> tabulation of cookfuel_1  

hv226_1_Bah |
   an bakar |
   memasak: |
    listrik |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,763       99.58       99.58
          1 |        200        0.42      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of cookfuel_2  

hv226_2_Bah |
   an bakar |
   memasak: |
        LPG |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,660       34.74       34.74
          1 |     31,303       65.26      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of cookfuel_3  

hv226_3_Bah |
   an bakar |
   memasak: |
   gas alam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,722       99.50       99.50
          1 |        241        0.50      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of cookfuel_4  

hv226_4_Bah |
   an bakar |
   memasak: |
     biogas |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,956       99.99       99.99
          1 |          7        0.01      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of cookfuel_5  

hv226_5_Bah |
   an bakar |
   memasak: |
     minyak |
      tanah |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,229       92.21       92.21
          1 |      3,734        7.79      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of cookfuel_6  

hv226_6_Bah |
   an bakar |
   memasak: |
  batubara, |
     lignit |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,957       99.99       99.99
          1 |          6        0.01      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of cookfuel_7  

hv226_7_Bah |
   an bakar |
   memasak: |
      arang |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,886       99.84       99.84
          1 |         77        0.16      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of cookfuel_8  

hv226_8_Bah |
   an bakar |
   memasak: |
       kayu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     36,190       75.45       75.45
          1 |     11,773       24.55      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of cookfuel_9  

hv226_9_Bah |
   an bakar |
   memasak: |
jerami/sema |
k/rumput/ta |
      naman |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,948       99.97       99.97
          1 |         15        0.03      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of cookfuel_96  

hv226_95_Ba |
  han bakar |
   memasak: |
  tidak ada |
    makanan |
       yang |
 dimasak di |
      rumah |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,362       98.75       98.75
          1 |        601        1.25      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\\Aset-aset (listrik-rekening/hv206-hv247)
. tab1 hv206 electricity

-> tabulation of hv206  

        has |
electricity |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |      1,795        3.74        3.74
        yes |     46,147       96.26      100.00
------------+-----------------------------------
      Total |     47,942      100.00

-> tabulation of electricity  

 Keberadaan |
    listrik |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,816        3.79        3.79
          1 |     46,147       96.21      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 hv207 radio

-> tabulation of hv207  

  has radio |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     38,784       80.94       80.94
        yes |      9,135       19.06      100.00
------------+-----------------------------------
      Total |     47,919      100.00

-> tabulation of radio  

Kepemilikan |
      radio |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     38,828       80.95       80.95
          1 |      9,135       19.05      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 hv208 television

-> tabulation of hv208  

        has |
 television |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |      7,084       14.77       14.77
        yes |     40,866       85.23      100.00
------------+-----------------------------------
      Total |     47,950      100.00

-> tabulation of television  

Kepemilikan |
   televisi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,097       14.80       14.80
          1 |     40,866       85.20      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 hv221 telephone

-> tabulation of hv221  

        has |
  telephone |
(land-line) |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     46,462       96.94       96.94
        yes |      1,465        3.06      100.00
------------+-----------------------------------
      Total |     47,927      100.00

-> tabulation of telephone  

Kepemilikan |
    telepon |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     46,498       96.95       96.95
          1 |      1,465        3.05      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 hv243e computer

-> tabulation of hv243e  

      has a |
   computer |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     36,285       75.71       75.71
        yes |     11,639       24.29      100.00
------------+-----------------------------------
      Total |     47,924      100.00

-> tabulation of computer  

Kepemilikan |
   komputer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     36,324       75.73       75.73
          1 |     11,639       24.27      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 hv209 refrigerator

-> tabulation of hv209  

        has |
refrigerato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     20,444       42.64       42.64
        yes |     27,501       57.36      100.00
------------+-----------------------------------
      Total |     47,945      100.00

-> tabulation of refrigerator  

Kepemilikan |
     lemari |
es/refriger |
       ator |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     20,462       42.66       42.66
          1 |     27,501       57.34      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 sh121g fan

-> tabulation of sh121g  

     a  fan |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     18,585       38.76       38.76
        yes |     29,368       61.24      100.00
------------+-----------------------------------
      Total |     47,953      100.00

-> tabulation of fan  

Kepemilikan |
  fan/kipas |
      angin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,595       38.77       38.77
          1 |     29,368       61.23      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 sh121h washingmach

-> tabulation of sh121h  

  a washing |
    machine |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     32,073       66.90       66.90
        yes |     15,868       33.10      100.00
------------+-----------------------------------
      Total |     47,941      100.00

-> tabulation of washingmach  

Kepemilikan |
 mesin cuci |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,095       66.92       66.92
          1 |     15,868       33.08      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 sh121i aircond

-> tabulation of sh121i  

    a n air |
conditioner |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     43,345       90.47       90.47
        yes |      4,565        9.53      100.00
------------+-----------------------------------
      Total |     47,910      100.00

-> tabulation of aircond  

Kepemilikan |
         AC |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     43,398       90.48       90.48
          1 |      4,565        9.52      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 hv243b watch

-> tabulation of hv243b  

  has watch |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     23,974       50.00       50.00
        yes |     23,970       50.00      100.00
------------+-----------------------------------
      Total |     47,944      100.00

-> tabulation of watch  

Kepemilikan |
 jam/arloji |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     23,993       50.02       50.02
          1 |     23,970       49.98      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 hv243a hp

-> tabulation of hv243a  

 has mobile |
  telephone |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |      4,994       10.42       10.42
        yes |     42,953       89.58      100.00
------------+-----------------------------------
      Total |     47,947      100.00

-> tabulation of hp  

Kepemilikan |
    telepon |
    genggam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,010       10.45       10.45
          1 |     42,953       89.55      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 hv210 bcycle

-> tabulation of hv210  

has bicycle |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     31,948       66.67       66.67
        yes |     15,974       33.33      100.00
------------+-----------------------------------
      Total |     47,922      100.00

-> tabulation of bcycle  

Kepemilikan |
     sepeda |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,989       66.70       66.70
          1 |     15,974       33.30      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 hv211 motorcyc

-> tabulation of hv211  

        has |
motorcycle/ |
    scooter |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     11,225       23.42       23.42
        yes |     36,714       76.58      100.00
------------+-----------------------------------
      Total |     47,939      100.00

-> tabulation of motorcyc  

Kepemilikan |
     sepeda |
      motor |
(salah satu |
   anggota) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,249       23.45       23.45
          1 |     36,714       76.55      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 hv243c animdrcart

-> tabulation of hv243c  

        has |
animal-draw |
     n cart |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     47,793       99.74       99.74
        yes |        126        0.26      100.00
------------+-----------------------------------
      Total |     47,919      100.00

-> tabulation of animdrcart  

Kepemilikan |
gerobak/ken |
daraan yang |
    ditarik |
 oleh hewan |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,837       99.74       99.74
          1 |        126        0.26      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 hv212 car

-> tabulation of hv212  

        has |
  car/truck |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     41,731       87.05       87.05
        yes |      6,208       12.95      100.00
------------+-----------------------------------
      Total |     47,939      100.00

-> tabulation of car  

Kepemilikan |
 mobil atau |
truk (salah |
       satu |
   anggota) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     41,755       87.06       87.06
          1 |      6,208       12.94      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 hv243d boat

-> tabulation of hv243d  

   has boat |
     with a |
      motor |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     47,226       98.58       98.58
        yes |        678        1.42      100.00
------------+-----------------------------------
      Total |     47,904      100.00

-> tabulation of boat  

Kepemilikan |
     perahu |
      motor |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,285       98.59       98.59
          1 |        678        1.41      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 hv247 bankac

-> tabulation of hv247  

   has bank |
    account |      Freq.     Percent        Cum.
------------+-----------------------------------
         no |     21,854       45.62       45.62
        yes |     26,049       54.38      100.00
------------+-----------------------------------
      Total |     47,903      100.00

-> tabulation of bankac  

Kepemilikan |
   rekening |
bank (salah |
       satu |
   anggota) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     21,914       45.69       45.69
          1 |     26,049       54.31      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\\Lantai rumah
. tab hv213

     main floor material |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
              earth/sand |      2,017        4.21        4.21
             wood planks |      6,023       12.58       16.79
             palm/bamboo |        317        0.66       17.45
parquet or polished wood |         77        0.16       17.61
 vinyl or asphalt strips |         72        0.15       17.76
  ceramic/marble/granite |     21,341       44.57       62.33
      floor tiles/teraso |      2,159        4.51       66.84
       cement/red bricks |     15,701       32.79       99.63
                  carpet |        154        0.32       99.95
                   other |         25        0.05      100.00
-------------------------+-----------------------------------
                   Total |     47,886      100.00

. tab1 matfloor_*

-> tabulation of matfloor_11  

hv213_Jenis |
     lantai |
     rumah: |
tanah/pasir |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     45,946       95.79       95.79
          1 |      2,017        4.21      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matfloor_21  

hv213_Jenis |
     lantai |
     rumah: |
 papan kayu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     41,940       87.44       87.44
          1 |      6,023       12.56      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matfloor_22  

hv213_Jenis |
     lantai |
     rumah: |
palma/bambu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,646       99.34       99.34
          1 |        317        0.66      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matfloor_31  

hv213_Jenis |
     lantai |
     rumah: |
parket atau |
 kayu poles |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,886       99.84       99.84
          1 |         77        0.16      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matfloor_32  

hv213_Jenis |
     lantai |
     rumah: |
vinil/aspal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,891       99.85       99.85
          1 |         72        0.15      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matfloor_33  

hv213_Jenis |
     lantai |
     rumah: |
keramik/mar |
 mer/granit |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     26,622       55.51       55.51
          1 |     21,341       44.49      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matfloor_34  

hv213_Jenis |
     lantai |
rumah: ubin |
lantai/tera |
         so |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     45,804       95.50       95.50
          1 |      2,159        4.50      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matfloor_35  

hv213_Jenis |
     lantai |
     rumah: |
 semen/batu |
 bata merah |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     32,262       67.26       67.26
          1 |     15,701       32.74      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matfloor_36  

hv213_Jenis |
     lantai |
     rumah: |
     karpet |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,809       99.68       99.68
          1 |        154        0.32      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matfloor_96  

hv213_Jenis |
     lantai |
     rumah: |
    lainnya |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,938       99.95       99.95
          1 |         25        0.05      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\\Atap rumah
. tab hv215

       main roof |
        material |      Freq.     Percent        Cum.
-----------------+-----------------------------------
thatch/palm leaf |        812        1.69        1.69
             sod |        124        0.26        1.95
      rustic mat |         20        0.04        1.99
     palm/bamboo |          8        0.02        2.01
     wood planks |         28        0.06        2.07
         roofing |     23,553       49.12       51.19
        asbestos |      4,373        9.12       60.31
            tile |     17,338       36.16       96.47
        concrete |        534        1.11       97.58
      metal tile |        924        1.93       99.51
roofing shingles |        224        0.47       99.98
           other |         11        0.02      100.00
-----------------+-----------------------------------
           Total |     47,949      100.00

. tab1 matroof_*

-> tabulation of matroof_12  

hv215_Jenis |
atap rumah: |
rumbia/daun |
      palem |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,151       98.31       98.31
          1 |        812        1.69      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matroof_13  

hv215_Jenis |
atap rumah: |
 atap tanah |
   atau sod |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,839       99.74       99.74
          1 |        124        0.26      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matroof_21  

hv215_Jenis |
atap rumah: |
 atap tikar |
   pedesaan |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,943       99.96       99.96
          1 |         20        0.04      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matroof_22  

hv215_Jenis |
atap rumah: |
palma/bambu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,955       99.98       99.98
          1 |          8        0.02      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matroof_23  

hv215_Jenis |
atap rumah: |
 papan kayu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,935       99.94       99.94
          1 |         28        0.06      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matroof_31  

hv215_Jenis |
atap rumah: |
   roofing, |
       seng |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,410       50.89       50.89
          1 |     23,553       49.11      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matroof_32  

hv215_Jenis |
atap rumah: |
      asbes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     43,590       90.88       90.88
          1 |      4,373        9.12      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matroof_33  

hv215_Jenis |
atap rumah: |
    genteng |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,625       63.85       63.85
          1 |     17,338       36.15      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matroof_34  

hv215_Jenis |
atap rumah: |
      beton |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,429       98.89       98.89
          1 |        534        1.11      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matroof_35  

hv215_Jenis |
atap rumah: |
    genteng |
      logam |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,039       98.07       98.07
          1 |        924        1.93      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matroof_36  

hv215_Jenis |
atap rumah: |
 atap sirap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,739       99.53       99.53
          1 |        224        0.47      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matroof_96  

hv215_Jenis |
atap rumah: |
    lainnya |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,952       99.98       99.98
          1 |         11        0.02      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\\Dinding rumah
. tab hv214

    main wall material |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
      cane/palm/trunks |        612        1.28        1.28
       bamboo with mud |        192        0.40        1.68
        stone with mud |         12        0.03        1.70
       uncovered adobe |      1,588        3.31        5.01
               plywood |        510        1.06        6.08
             cardboard |          5        0.01        6.09
           reused wood |         88        0.18        6.27
          woven bamboo |      1,269        2.65        8.92
stone with lime/cement |      1,461        3.05       11.96
         cement blocks |      4,606        9.61       21.57
         covered adobe |     25,893       54.00       75.56
  wood planks/shingles |     10,937       22.81       98.37
          plaster wire |        184        0.38       98.76
   grc/gypsum/asbestos |        547        1.14       99.90
                 other |         50        0.10      100.00
-----------------------+-----------------------------------
                 Total |     47,954      100.00

. tab1 matwall_*

-> tabulation of matwall_12  

hv214_Jenis |
    dinding |
     rumah: |
tongkat/pal |
  ma/batang |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,351       98.72       98.72
          1 |        612        1.28      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_21  

hv214_Jenis |
    dinding |
     rumah: |
      bambu |
     dengan |
tanah/tanah |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,771       99.60       99.60
          1 |        192        0.40      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_22  

hv214_Jenis |
    dinding |
rumah: batu |
     dengan |
      tanah |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,951       99.97       99.97
          1 |         12        0.03      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_23  

hv214_Jenis |
    dinding |
rumah: batu |
       bata |
    terbuka |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     46,375       96.69       96.69
          1 |      1,588        3.31      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_24  

hv214_Jenis |
    dinding |
rumah: kayu |
      lapis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,453       98.94       98.94
          1 |        510        1.06      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_25  

hv214_Jenis |
    dinding |
     rumah: |
     karton |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,958       99.99       99.99
          1 |          5        0.01      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_26  

hv214_Jenis |
    dinding |
rumah: kayu |
      bekas |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,875       99.82       99.82
          1 |         88        0.18      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_31  

hv214_Jenis |
    dinding |
     rumah: |
    anyaman |
      bambu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     46,694       97.35       97.35
          1 |      1,269        2.65      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_32  

hv214_Jenis |
    dinding |
rumah: batu |
     dengan |
kapur/semen |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     46,502       96.95       96.95
          1 |      1,461        3.05      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_34  

hv214_Jenis |
    dinding |
     rumah: |
     batako |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     43,357       90.40       90.40
          1 |      4,606        9.60      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_35  

hv214_Jenis |
    dinding |
rumah: batu |
       bata |
   tertutup |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     22,070       46.01       46.01
          1 |     25,893       53.99      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_36  

hv214_Jenis |
    dinding |
     rumah: |
      papan |
 kayu/sirap |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     37,026       77.20       77.20
          1 |     10,937       22.80      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_37  

hv214_Jenis |
    dinding |
     rumah: |
      kawat |
    plester |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,779       99.62       99.62
          1 |        184        0.38      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_38  

hv214_Jenis |
    dinding |
     rumah: |
gipsum/asbe |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,416       98.86       98.86
          1 |        547        1.14      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of matwall_96  

hv214_Jenis |
    dinding |
     rumah: |
    lainnya |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,913       99.90       99.90
          1 |         50        0.10      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\\Kepemilikan ternak
. *\\\sapi/banteng
. tab hv246b_r

  RECODE of |
     hv246b |
(owns cows/ |
     bulls) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     45,003       93.83       93.83
          1 |      2,592        5.40       99.23
          2 |        275        0.57       99.81
          3 |         93        0.19      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 cowbull_*

-> tabulation of cowbull_1  

hv246b_Kepe |
    milikan |
sapi/banten |
     g: 1-4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     45,371       94.60       94.60
          1 |      2,592        5.40      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of cowbull_2  

hv246b_Kepe |
    milikan |
sapi/banten |
     g: 5-9 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,688       99.43       99.43
          1 |        275        0.57      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of cowbull_3  

hv246b_Kepe |
    milikan |
sapi/banten |
     g: 10+ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,870       99.81       99.81
          1 |         93        0.19      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\\\kerbau
. tab hv246g_r

  RECODE of |
     hv246g |
     (water |
 buffaloes) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,757       99.57       99.57
          1 |        174        0.36       99.93
          2 |         24        0.05       99.98
          3 |          8        0.02      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 buffal_*

-> tabulation of buffal_1  

hv246g_Kepe |
    milikan |
kerbau: 1-4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,789       99.64       99.64
          1 |        174        0.36      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of buffal_2  

hv246g_Kepe |
    milikan |
kerbau: 5-9 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,939       99.95       99.95
          1 |         24        0.05      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of buffal_3  

hv246g_Kepe |
    milikan |
kerbau: 10+ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,955       99.98       99.98
          1 |          8        0.02      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\\\kuda/keledai
. tab hv246c_r

  RECODE of |
     hv246c |
      (owns |
    horses/ |
   donkeys/ |
     mules) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,886       99.84       99.84
          1 |         72        0.15       99.99
          2 |          5        0.01      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 horse_*

-> tabulation of horse_1  

hv246c_Kepe |
    milikan |
kuda/keleda |
     i: 1-4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,891       99.85       99.85
          1 |         72        0.15      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of horse_2  

hv246c_Kepe |
    milikan |
kuda/keleda |
      i: 5+ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,958       99.99       99.99
          1 |          5        0.01      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\\\kambing/domba
. tab hv246h_r

  RECODE of |
     hv246h |
(goats/shee |
         p) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     45,097       94.02       94.02
          1 |      1,965        4.10       98.12
          2 |        672        1.40       99.52
          3 |        229        0.48      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 goat_*

-> tabulation of goat_1  

hv246h_Kepe |
    milikan |
kambing/dom |
    ba: 1-4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     45,998       95.90       95.90
          1 |      1,965        4.10      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of goat_2  

hv246h_Kepe |
    milikan |
kambing/dom |
    ba: 5-9 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,291       98.60       98.60
          1 |        672        1.40      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of goat_3  

hv246h_Kepe |
    milikan |
kambing/dom |
    ba: 10+ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,734       99.52       99.52
          1 |        229        0.48      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\\\babi
. tab hv246i_r

  RECODE of |
     hv246i |
     (pigs) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     45,630       95.14       95.14
          1 |      2,051        4.28       99.41
          2 |        194        0.40       99.82
          3 |         88        0.18      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 pig_*

-> tabulation of pig_1  

hv246i_Kepe |
    milikan |
  babi: 1-4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     45,912       95.72       95.72
          1 |      2,051        4.28      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of pig_2  

hv246i_Kepe |
    milikan |
  babi: 5-9 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,769       99.60       99.60
          1 |        194        0.40      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of pig_3  

hv246i_Kepe |
    milikan |
  babi: 10+ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,875       99.82       99.82
          1 |         88        0.18      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\\\ayam/unggas
. tab hv246f_r

  RECODE of |
     hv246f |
      (owns |
chickens/po |
     ultry) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     31,700       66.09       66.09
          1 |     10,051       20.96       87.05
          2 |      5,461       11.39       98.43
          3 |        751        1.57      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. tab1 chicken_*

-> tabulation of chicken_1  

hv246f_Kepe |
    milikan |
ayam/unggas |
      : 1-4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     37,912       79.04       79.04
          1 |     10,051       20.96      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of chicken_2  

hv246f_Kepe |
    milikan |
ayam/unggas |
      : 5-9 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     42,502       88.61       88.61
          1 |      5,461       11.39      100.00
------------+-----------------------------------
      Total |     47,963      100.00

-> tabulation of chicken_3  

hv246f_Kepe |
    milikan |
ayam/unggas |
      : 10+ |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     47,212       98.43       98.43
          1 |        751        1.57      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. drop hv246c_r-hv246i_r

. 
. 
. 
. /*
> ================================================================================
> INDEKS KEKAYAAN (LENGKAP)
> ================================================================================
> */
. 
. /*
> ******************************************************************
> Commons/Umum/All                                                                                        [done]
> ******************************************************************
>  */
. 
. /*
> ------------------------------------------------------------------
> Ringkasan Deskriptif                                                                            [done]
> ------------------------------------------------------------------
> */
. 
. *\raw
. #delimit ;
delimiter now ;
. glo indicator
>         drinkwat_* toiletfac_* cookfuel_* electricity-bankac matfloor_*
>         matroof_* matwall_* house land
>         ;

. #delimit cr
delimiter now cr
. summ $indicator memsleep floorarea

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 drinkwat_11 |     47,963    .0846486    .2783609          0          1
 drinkwat_12 |     47,963    .0133853    .1149192          0          1
 drinkwat_13 |     47,963    .0081104    .0896928          0          1
 drinkwat_14 |     47,963    .0048371    .0693813          0          1
 drinkwat_21 |     47,963    .1301628     .336486          0          1
-------------+---------------------------------------------------------
 drinkwat_31 |     47,963    .1596022    .3662405          0          1
 drinkwat_32 |     47,963    .0524154    .2228656          0          1
 drinkwat_41 |     47,963    .0926756    .2899803          0          1
 drinkwat_42 |     47,963    .0277506     .164259          0          1
 drinkwat_43 |     47,963    .0230177    .1499613          0          1
-------------+---------------------------------------------------------
 drinkwat_51 |     47,963    .0280841     .165215          0          1
 drinkwat_61 |     47,963    .0057544    .0756402          0          1
 drinkwat_62 |     47,963    .0064633    .0801354          0          1
 drinkwat_71 |     47,963    .0952401    .2935493          0          1
 drinkwat_72 |     47,963    .2676647    .4427464          0          1
-------------+---------------------------------------------------------
 drinkwat_96 |     47,963    .0001251    .0111841          0          1
toiletfac_11 |     47,963    .7013323    .4576786          0          1
toiletfac_12 |     47,963    .0812084    .2731578          0          1
toiletfac_21 |     47,963    .0818339    .2741144          0          1
toiletfac_31 |     47,963    .0666138    .2493546          0          1
-------------+---------------------------------------------------------
toiletfac_32 |     47,963    .0069637    .0831586          0          1
toiletfac_33 |     47,963    .0027521     .052389          0          1
toiletfac_41 |     47,963    .0350895    .1840081          0          1
toiletfac_51 |     47,963    .0234764    .1514126          0          1
toiletfac_96 |     47,963    .0005004    .0223639          0          1
-------------+---------------------------------------------------------
  cookfuel_1 |     47,963    .0041699    .0644405          0          1
  cookfuel_2 |     47,963    .6526489    .4761334          0          1
  cookfuel_3 |     47,963    .0050247    .0707076          0          1
  cookfuel_4 |     47,963    .0001459      .01208          0          1
  cookfuel_5 |     47,963    .0778517    .2679408          0          1
-------------+---------------------------------------------------------
  cookfuel_6 |     47,963    .0001251    .0111841          0          1
  cookfuel_7 |     47,963    .0016054    .0400357          0          1
  cookfuel_8 |     47,963      .24546    .4303641          0          1
  cookfuel_9 |     47,963    .0003127    .0176819          0          1
 cookfuel_96 |     47,963    .0125305    .1112373          0          1
-------------+---------------------------------------------------------
 electricity |     47,963    .9621375    .1908657          0          1
       radio |     47,963    .1904593    .3926675          0          1
  television |     47,963    .8520318    .3550722          0          1
   telephone |     47,963    .0305444    .1720815          0          1
    computer |     47,963    .2426662    .4286994          0          1
-------------+---------------------------------------------------------
refrigerator |     47,963    .5733795    .4945913          0          1
         fan |     47,963    .6123053    .4872294          0          1
 washingmach |     47,963    .3308384    .4705199          0          1
     aircond |     47,963    .0951775    .2934631          0          1
       watch |     47,963    .4997602    .5000052          0          1
-------------+---------------------------------------------------------
          hp |     47,963    .8955445    .3058537          0          1
      bcycle |     47,963    .3330484    .4713086          0          1
    motorcyc |     47,963     .765465    .4237122          0          1
  animdrcart |     47,963     .002627    .0511877          0          1
         car |     47,963    .1294331    .3356822          0          1
-------------+---------------------------------------------------------
        boat |     47,963    .0141359    .1180524          0          1
      bankac |     47,963    .5431061    .4981436          0          1
 matfloor_11 |     47,963    .0420532    .2007128          0          1
 matfloor_21 |     47,963     .125576    .3313743          0          1
 matfloor_22 |     47,963    .0066093    .0810291          0          1
-------------+---------------------------------------------------------
 matfloor_31 |     47,963    .0016054    .0400357          0          1
 matfloor_32 |     47,963    .0015012    .0387161          0          1
 matfloor_33 |     47,963    .4449471    .4969651          0          1
 matfloor_34 |     47,963    .0450139    .2073367          0          1
 matfloor_35 |     47,963    .3273565    .4692535          0          1
-------------+---------------------------------------------------------
 matfloor_36 |     47,963    .0032108    .0565735          0          1
 matfloor_96 |     47,963    .0005212    .0228249          0          1
  matroof_12 |     47,963    .0169297    .1290095          0          1
  matroof_13 |     47,963    .0025853    .0507809          0          1
  matroof_21 |     47,963     .000417    .0204162          0          1
-------------+---------------------------------------------------------
  matroof_22 |     47,963    .0001668     .012914          0          1
  matroof_23 |     47,963    .0005838    .0241548          0          1
  matroof_31 |     47,963     .491066    .4999254          0          1
  matroof_32 |     47,963    .0911744      .28786          0          1
  matroof_33 |     47,963     .361487    .4804362          0          1
-------------+---------------------------------------------------------
  matroof_34 |     47,963    .0111336    .1049279          0          1
  matroof_35 |     47,963    .0192648    .1374558          0          1
  matroof_36 |     47,963    .0046703    .0681803          0          1
  matroof_96 |     47,963    .0002293    .0151425          0          1
  matwall_12 |     47,963    .0127598    .1122376          0          1
-------------+---------------------------------------------------------
  matwall_21 |     47,963    .0040031    .0631438          0          1
  matwall_22 |     47,963    .0002502    .0158157          0          1
  matwall_23 |     47,963    .0331089    .1789227          0          1
  matwall_24 |     47,963    .0106332    .1025688          0          1
  matwall_25 |     47,963    .0001042    .0102097          0          1
-------------+---------------------------------------------------------
  matwall_26 |     47,963    .0018347    .0427951          0          1
  matwall_31 |     47,963    .0264579    .1604943          0          1
  matwall_32 |     47,963     .030461    .1718538          0          1
  matwall_34 |     47,963    .0960324    .2946387          0          1
  matwall_35 |     47,963    .5398536    .4984144          0          1
-------------+---------------------------------------------------------
  matwall_36 |     47,963    .2280299    .4195664          0          1
  matwall_37 |     47,963    .0038363    .0618195          0          1
  matwall_38 |     47,963    .0114046    .1061828          0          1
  matwall_96 |     47,963    .0010425    .0322708          0          1
       house |     47,963    .5205679     .499582          0          1
-------------+---------------------------------------------------------
        land |     47,963    .3610074    .4802977          0          1
    memsleep |     47,924    1.755634    1.257038          0         14
   floorarea |     47,643    77.74731    58.19067          0        995

. mdesc $indicator memsleep floorarea

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
    drinkwat_11 |           0         47,963           0.00
    drinkwat_12 |           0         47,963           0.00
    drinkwat_13 |           0         47,963           0.00
    drinkwat_14 |           0         47,963           0.00
    drinkwat_21 |           0         47,963           0.00
    drinkwat_31 |           0         47,963           0.00
    drinkwat_32 |           0         47,963           0.00
    drinkwat_41 |           0         47,963           0.00
    drinkwat_42 |           0         47,963           0.00
    drinkwat_43 |           0         47,963           0.00
    drinkwat_51 |           0         47,963           0.00
    drinkwat_61 |           0         47,963           0.00
    drinkwat_62 |           0         47,963           0.00
    drinkwat_71 |           0         47,963           0.00
    drinkwat_72 |           0         47,963           0.00
    drinkwat_96 |           0         47,963           0.00
   toiletfac_11 |           0         47,963           0.00
   toiletfac_12 |           0         47,963           0.00
   toiletfac_21 |           0         47,963           0.00
   toiletfac_31 |           0         47,963           0.00
   toiletfac_32 |           0         47,963           0.00
   toiletfac_33 |           0         47,963           0.00
   toiletfac_41 |           0         47,963           0.00
   toiletfac_51 |           0         47,963           0.00
   toiletfac_96 |           0         47,963           0.00
     cookfuel_1 |           0         47,963           0.00
     cookfuel_2 |           0         47,963           0.00
     cookfuel_3 |           0         47,963           0.00
     cookfuel_4 |           0         47,963           0.00
     cookfuel_5 |           0         47,963           0.00
     cookfuel_6 |           0         47,963           0.00
     cookfuel_7 |           0         47,963           0.00
     cookfuel_8 |           0         47,963           0.00
     cookfuel_9 |           0         47,963           0.00
    cookfuel_96 |           0         47,963           0.00
    electricity |           0         47,963           0.00
          radio |           0         47,963           0.00
     television |           0         47,963           0.00
      telephone |           0         47,963           0.00
       computer |           0         47,963           0.00
   refrigerator |           0         47,963           0.00
            fan |           0         47,963           0.00
    washingmach |           0         47,963           0.00
        aircond |           0         47,963           0.00
          watch |           0         47,963           0.00
             hp |           0         47,963           0.00
         bcycle |           0         47,963           0.00
       motorcyc |           0         47,963           0.00
     animdrcart |           0         47,963           0.00
            car |           0         47,963           0.00
           boat |           0         47,963           0.00
         bankac |           0         47,963           0.00
    matfloor_11 |           0         47,963           0.00
    matfloor_21 |           0         47,963           0.00
    matfloor_22 |           0         47,963           0.00
    matfloor_31 |           0         47,963           0.00
    matfloor_32 |           0         47,963           0.00
    matfloor_33 |           0         47,963           0.00
    matfloor_34 |           0         47,963           0.00
    matfloor_35 |           0         47,963           0.00
    matfloor_36 |           0         47,963           0.00
    matfloor_96 |           0         47,963           0.00
     matroof_12 |           0         47,963           0.00
     matroof_13 |           0         47,963           0.00
     matroof_21 |           0         47,963           0.00
     matroof_22 |           0         47,963           0.00
     matroof_23 |           0         47,963           0.00
     matroof_31 |           0         47,963           0.00
     matroof_32 |           0         47,963           0.00
     matroof_33 |           0         47,963           0.00
     matroof_34 |           0         47,963           0.00
     matroof_35 |           0         47,963           0.00
     matroof_36 |           0         47,963           0.00
     matroof_96 |           0         47,963           0.00
     matwall_12 |           0         47,963           0.00
     matwall_21 |           0         47,963           0.00
     matwall_22 |           0         47,963           0.00
     matwall_23 |           0         47,963           0.00
     matwall_24 |           0         47,963           0.00
     matwall_25 |           0         47,963           0.00
     matwall_26 |           0         47,963           0.00
     matwall_31 |           0         47,963           0.00
     matwall_32 |           0         47,963           0.00
     matwall_34 |           0         47,963           0.00
     matwall_35 |           0         47,963           0.00
     matwall_36 |           0         47,963           0.00
     matwall_37 |           0         47,963           0.00
     matwall_38 |           0         47,963           0.00
     matwall_96 |           0         47,963           0.00
          house |           0         47,963           0.00
           land |           0         47,963           0.00
       memsleep |          39         47,963           0.08
      floorarea |         320         47,963           0.67
----------------+-----------------------------------------------

. 
. *\replace missing dengan mean
. gen memsleep_iall = memsleep
(39 missing values generated)

.         lab var memsleep_iall "Jumlah art per ruang untuk tidur (imputasi mean, all)"

.         quiet: egen meanval = mean(memsleep)

.         replace memsleep_iall = meanval if missing(memsleep)
(39 real changes made)

.         drop meanval

. 
. gen floorarea_iall = floorarea
(320 missing values generated)

.         lab var floorarea_iall "Luas lantai rumah (m2) (imputasi mean, all)"

.         quiet: egen meanval = mean(floorarea)

.         replace floorarea_iall = meanval if missing(floorarea)
(320 real changes made)

.         drop meanval

.  
. summ $indicator memsleep_iall floorarea_iall

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 drinkwat_11 |     47,963    .0846486    .2783609          0          1
 drinkwat_12 |     47,963    .0133853    .1149192          0          1
 drinkwat_13 |     47,963    .0081104    .0896928          0          1
 drinkwat_14 |     47,963    .0048371    .0693813          0          1
 drinkwat_21 |     47,963    .1301628     .336486          0          1
-------------+---------------------------------------------------------
 drinkwat_31 |     47,963    .1596022    .3662405          0          1
 drinkwat_32 |     47,963    .0524154    .2228656          0          1
 drinkwat_41 |     47,963    .0926756    .2899803          0          1
 drinkwat_42 |     47,963    .0277506     .164259          0          1
 drinkwat_43 |     47,963    .0230177    .1499613          0          1
-------------+---------------------------------------------------------
 drinkwat_51 |     47,963    .0280841     .165215          0          1
 drinkwat_61 |     47,963    .0057544    .0756402          0          1
 drinkwat_62 |     47,963    .0064633    .0801354          0          1
 drinkwat_71 |     47,963    .0952401    .2935493          0          1
 drinkwat_72 |     47,963    .2676647    .4427464          0          1
-------------+---------------------------------------------------------
 drinkwat_96 |     47,963    .0001251    .0111841          0          1
toiletfac_11 |     47,963    .7013323    .4576786          0          1
toiletfac_12 |     47,963    .0812084    .2731578          0          1
toiletfac_21 |     47,963    .0818339    .2741144          0          1
toiletfac_31 |     47,963    .0666138    .2493546          0          1
-------------+---------------------------------------------------------
toiletfac_32 |     47,963    .0069637    .0831586          0          1
toiletfac_33 |     47,963    .0027521     .052389          0          1
toiletfac_41 |     47,963    .0350895    .1840081          0          1
toiletfac_51 |     47,963    .0234764    .1514126          0          1
toiletfac_96 |     47,963    .0005004    .0223639          0          1
-------------+---------------------------------------------------------
  cookfuel_1 |     47,963    .0041699    .0644405          0          1
  cookfuel_2 |     47,963    .6526489    .4761334          0          1
  cookfuel_3 |     47,963    .0050247    .0707076          0          1
  cookfuel_4 |     47,963    .0001459      .01208          0          1
  cookfuel_5 |     47,963    .0778517    .2679408          0          1
-------------+---------------------------------------------------------
  cookfuel_6 |     47,963    .0001251    .0111841          0          1
  cookfuel_7 |     47,963    .0016054    .0400357          0          1
  cookfuel_8 |     47,963      .24546    .4303641          0          1
  cookfuel_9 |     47,963    .0003127    .0176819          0          1
 cookfuel_96 |     47,963    .0125305    .1112373          0          1
-------------+---------------------------------------------------------
 electricity |     47,963    .9621375    .1908657          0          1
       radio |     47,963    .1904593    .3926675          0          1
  television |     47,963    .8520318    .3550722          0          1
   telephone |     47,963    .0305444    .1720815          0          1
    computer |     47,963    .2426662    .4286994          0          1
-------------+---------------------------------------------------------
refrigerator |     47,963    .5733795    .4945913          0          1
         fan |     47,963    .6123053    .4872294          0          1
 washingmach |     47,963    .3308384    .4705199          0          1
     aircond |     47,963    .0951775    .2934631          0          1
       watch |     47,963    .4997602    .5000052          0          1
-------------+---------------------------------------------------------
          hp |     47,963    .8955445    .3058537          0          1
      bcycle |     47,963    .3330484    .4713086          0          1
    motorcyc |     47,963     .765465    .4237122          0          1
  animdrcart |     47,963     .002627    .0511877          0          1
         car |     47,963    .1294331    .3356822          0          1
-------------+---------------------------------------------------------
        boat |     47,963    .0141359    .1180524          0          1
      bankac |     47,963    .5431061    .4981436          0          1
 matfloor_11 |     47,963    .0420532    .2007128          0          1
 matfloor_21 |     47,963     .125576    .3313743          0          1
 matfloor_22 |     47,963    .0066093    .0810291          0          1
-------------+---------------------------------------------------------
 matfloor_31 |     47,963    .0016054    .0400357          0          1
 matfloor_32 |     47,963    .0015012    .0387161          0          1
 matfloor_33 |     47,963    .4449471    .4969651          0          1
 matfloor_34 |     47,963    .0450139    .2073367          0          1
 matfloor_35 |     47,963    .3273565    .4692535          0          1
-------------+---------------------------------------------------------
 matfloor_36 |     47,963    .0032108    .0565735          0          1
 matfloor_96 |     47,963    .0005212    .0228249          0          1
  matroof_12 |     47,963    .0169297    .1290095          0          1
  matroof_13 |     47,963    .0025853    .0507809          0          1
  matroof_21 |     47,963     .000417    .0204162          0          1
-------------+---------------------------------------------------------
  matroof_22 |     47,963    .0001668     .012914          0          1
  matroof_23 |     47,963    .0005838    .0241548          0          1
  matroof_31 |     47,963     .491066    .4999254          0          1
  matroof_32 |     47,963    .0911744      .28786          0          1
  matroof_33 |     47,963     .361487    .4804362          0          1
-------------+---------------------------------------------------------
  matroof_34 |     47,963    .0111336    .1049279          0          1
  matroof_35 |     47,963    .0192648    .1374558          0          1
  matroof_36 |     47,963    .0046703    .0681803          0          1
  matroof_96 |     47,963    .0002293    .0151425          0          1
  matwall_12 |     47,963    .0127598    .1122376          0          1
-------------+---------------------------------------------------------
  matwall_21 |     47,963    .0040031    .0631438          0          1
  matwall_22 |     47,963    .0002502    .0158157          0          1
  matwall_23 |     47,963    .0331089    .1789227          0          1
  matwall_24 |     47,963    .0106332    .1025688          0          1
  matwall_25 |     47,963    .0001042    .0102097          0          1
-------------+---------------------------------------------------------
  matwall_26 |     47,963    .0018347    .0427951          0          1
  matwall_31 |     47,963    .0264579    .1604943          0          1
  matwall_32 |     47,963     .030461    .1718538          0          1
  matwall_34 |     47,963    .0960324    .2946387          0          1
  matwall_35 |     47,963    .5398536    .4984144          0          1
-------------+---------------------------------------------------------
  matwall_36 |     47,963    .2280299    .4195664          0          1
  matwall_37 |     47,963    .0038363    .0618195          0          1
  matwall_38 |     47,963    .0114046    .1061828          0          1
  matwall_96 |     47,963    .0010425    .0322708          0          1
       house |     47,963    .5205679     .499582          0          1
-------------+---------------------------------------------------------
        land |     47,963    .3610074    .4802977          0          1
memsleep_i~l |     47,963    1.755634    1.256527          0         14
floorarea_~l |     47,963    77.74731    57.99622          0        995

. mdesc $indicator memsleep_iall floorarea_iall

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
    drinkwat_11 |           0         47,963           0.00
    drinkwat_12 |           0         47,963           0.00
    drinkwat_13 |           0         47,963           0.00
    drinkwat_14 |           0         47,963           0.00
    drinkwat_21 |           0         47,963           0.00
    drinkwat_31 |           0         47,963           0.00
    drinkwat_32 |           0         47,963           0.00
    drinkwat_41 |           0         47,963           0.00
    drinkwat_42 |           0         47,963           0.00
    drinkwat_43 |           0         47,963           0.00
    drinkwat_51 |           0         47,963           0.00
    drinkwat_61 |           0         47,963           0.00
    drinkwat_62 |           0         47,963           0.00
    drinkwat_71 |           0         47,963           0.00
    drinkwat_72 |           0         47,963           0.00
    drinkwat_96 |           0         47,963           0.00
   toiletfac_11 |           0         47,963           0.00
   toiletfac_12 |           0         47,963           0.00
   toiletfac_21 |           0         47,963           0.00
   toiletfac_31 |           0         47,963           0.00
   toiletfac_32 |           0         47,963           0.00
   toiletfac_33 |           0         47,963           0.00
   toiletfac_41 |           0         47,963           0.00
   toiletfac_51 |           0         47,963           0.00
   toiletfac_96 |           0         47,963           0.00
     cookfuel_1 |           0         47,963           0.00
     cookfuel_2 |           0         47,963           0.00
     cookfuel_3 |           0         47,963           0.00
     cookfuel_4 |           0         47,963           0.00
     cookfuel_5 |           0         47,963           0.00
     cookfuel_6 |           0         47,963           0.00
     cookfuel_7 |           0         47,963           0.00
     cookfuel_8 |           0         47,963           0.00
     cookfuel_9 |           0         47,963           0.00
    cookfuel_96 |           0         47,963           0.00
    electricity |           0         47,963           0.00
          radio |           0         47,963           0.00
     television |           0         47,963           0.00
      telephone |           0         47,963           0.00
       computer |           0         47,963           0.00
   refrigerator |           0         47,963           0.00
            fan |           0         47,963           0.00
    washingmach |           0         47,963           0.00
        aircond |           0         47,963           0.00
          watch |           0         47,963           0.00
             hp |           0         47,963           0.00
         bcycle |           0         47,963           0.00
       motorcyc |           0         47,963           0.00
     animdrcart |           0         47,963           0.00
            car |           0         47,963           0.00
           boat |           0         47,963           0.00
         bankac |           0         47,963           0.00
    matfloor_11 |           0         47,963           0.00
    matfloor_21 |           0         47,963           0.00
    matfloor_22 |           0         47,963           0.00
    matfloor_31 |           0         47,963           0.00
    matfloor_32 |           0         47,963           0.00
    matfloor_33 |           0         47,963           0.00
    matfloor_34 |           0         47,963           0.00
    matfloor_35 |           0         47,963           0.00
    matfloor_36 |           0         47,963           0.00
    matfloor_96 |           0         47,963           0.00
     matroof_12 |           0         47,963           0.00
     matroof_13 |           0         47,963           0.00
     matroof_21 |           0         47,963           0.00
     matroof_22 |           0         47,963           0.00
     matroof_23 |           0         47,963           0.00
     matroof_31 |           0         47,963           0.00
     matroof_32 |           0         47,963           0.00
     matroof_33 |           0         47,963           0.00
     matroof_34 |           0         47,963           0.00
     matroof_35 |           0         47,963           0.00
     matroof_36 |           0         47,963           0.00
     matroof_96 |           0         47,963           0.00
     matwall_12 |           0         47,963           0.00
     matwall_21 |           0         47,963           0.00
     matwall_22 |           0         47,963           0.00
     matwall_23 |           0         47,963           0.00
     matwall_24 |           0         47,963           0.00
     matwall_25 |           0         47,963           0.00
     matwall_26 |           0         47,963           0.00
     matwall_31 |           0         47,963           0.00
     matwall_32 |           0         47,963           0.00
     matwall_34 |           0         47,963           0.00
     matwall_35 |           0         47,963           0.00
     matwall_36 |           0         47,963           0.00
     matwall_37 |           0         47,963           0.00
     matwall_38 |           0         47,963           0.00
     matwall_96 |           0         47,963           0.00
          house |           0         47,963           0.00
           land |           0         47,963           0.00
   memsleep_i~l |           0         47,963           0.00
   floorarea_~l |           0         47,963           0.00
----------------+-----------------------------------------------

. 
. /*
> ------------------------------------------------------------------
> Skor - Faktor PCA                                                                                       [done]
> ------------------------------------------------------------------
> */
. 
. *\factor pc
. factor $indicator memsleep_iall floorarea_iall, factors(1) pcf
(obs=47,963)

Factor analysis/correlation                      Number of obs    =     47,963
    Method: principal-component factors          Retained factors =          1
    Rotation: (unrotated)                        Number of params =         93

    
Warning: Solution is a Heywood case; that is, invalid or boundary values of uniqueness.

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      7.33429      4.49750            0.0789       0.0789
        Factor2  |      2.83680      0.56548            0.0305       0.1094
        Factor3  |      2.27132      0.38309            0.0244       0.1338
        Factor4  |      1.88823      0.12049            0.0203       0.1541
        Factor5  |      1.76774      0.09335            0.0190       0.1731
        Factor6  |      1.67439      0.22047            0.0180       0.1911
        Factor7  |      1.45392      0.05378            0.0156       0.2067
        Factor8  |      1.40014      0.04986            0.0151       0.2218
        Factor9  |      1.35028      0.07680            0.0145       0.2363
       Factor10  |      1.27348      0.01317            0.0137       0.2500
       Factor11  |      1.26031      0.02701            0.0136       0.2636
       Factor12  |      1.23331      0.03505            0.0133       0.2768
       Factor13  |      1.19825      0.01154            0.0129       0.2897
       Factor14  |      1.18672      0.02338            0.0128       0.3025
       Factor15  |      1.16334      0.00798            0.0125       0.3150
       Factor16  |      1.15536      0.01560            0.0124       0.3274
       Factor17  |      1.13976      0.01584            0.0123       0.3397
       Factor18  |      1.12391      0.02001            0.0121       0.3517
       Factor19  |      1.10390      0.01069            0.0119       0.3636
       Factor20  |      1.09321      0.00830            0.0118       0.3754
       Factor21  |      1.08490      0.00680            0.0117       0.3870
       Factor22  |      1.07810      0.01108            0.0116       0.3986
       Factor23  |      1.06702      0.01075            0.0115       0.4101
       Factor24  |      1.05627      0.00154            0.0114       0.4215
       Factor25  |      1.05472      0.00510            0.0113       0.4328
       Factor26  |      1.04963      0.00235            0.0113       0.4441
       Factor27  |      1.04728      0.00564            0.0113       0.4553
       Factor28  |      1.04163      0.00543            0.0112       0.4665
       Factor29  |      1.03620      0.00219            0.0111       0.4777
       Factor30  |      1.03402      0.00387            0.0111       0.4888
       Factor31  |      1.03014      0.00049            0.0111       0.4999
       Factor32  |      1.02965      0.00800            0.0111       0.5109
       Factor33  |      1.02165      0.00419            0.0110       0.5219
       Factor34  |      1.01746      0.00224            0.0109       0.5329
       Factor35  |      1.01521      0.00102            0.0109       0.5438
       Factor36  |      1.01419      0.00550            0.0109       0.5547
       Factor37  |      1.00869      0.00162            0.0108       0.5655
       Factor38  |      1.00707      0.00417            0.0108       0.5764
       Factor39  |      1.00289      0.00218            0.0108       0.5872
       Factor40  |      1.00071      0.00246            0.0108       0.5979
       Factor41  |      0.99825      0.00168            0.0107       0.6086
       Factor42  |      0.99657      0.00302            0.0107       0.6194
       Factor43  |      0.99356      0.00015            0.0107       0.6300
       Factor44  |      0.99340      0.00398            0.0107       0.6407
       Factor45  |      0.98942      0.00143            0.0106       0.6514
       Factor46  |      0.98799      0.00423            0.0106       0.6620
       Factor47  |      0.98376      0.00486            0.0106       0.6726
       Factor48  |      0.97891      0.00716            0.0105       0.6831
       Factor49  |      0.97175      0.00184            0.0104       0.6935
       Factor50  |      0.96991      0.00358            0.0104       0.7040
       Factor51  |      0.96633      0.00222            0.0104       0.7144
       Factor52  |      0.96411      0.00254            0.0104       0.7247
       Factor53  |      0.96156      0.00729            0.0103       0.7351
       Factor54  |      0.95427      0.01011            0.0103       0.7453
       Factor55  |      0.94416      0.00188            0.0102       0.7555
       Factor56  |      0.94228      0.00828            0.0101       0.7656
       Factor57  |      0.93399      0.01225            0.0100       0.7757
       Factor58  |      0.92174      0.01298            0.0099       0.7856
       Factor59  |      0.90877      0.01962            0.0098       0.7953
       Factor60  |      0.88914      0.00698            0.0096       0.8049
       Factor61  |      0.88216      0.01891            0.0095       0.8144
       Factor62  |      0.86325      0.00221            0.0093       0.8237
       Factor63  |      0.86104      0.01063            0.0093       0.8329
       Factor64  |      0.85041      0.01412            0.0091       0.8421
       Factor65  |      0.83629      0.01200            0.0090       0.8511
       Factor66  |      0.82429      0.00441            0.0089       0.8599
       Factor67  |      0.81988      0.02254            0.0088       0.8687
       Factor68  |      0.79734      0.01064            0.0086       0.8773
       Factor69  |      0.78670      0.02958            0.0085       0.8858
       Factor70  |      0.75712      0.01205            0.0081       0.8939
       Factor71  |      0.74507      0.03392            0.0080       0.9019
       Factor72  |      0.71115      0.00945            0.0076       0.9096
       Factor73  |      0.70170      0.02101            0.0075       0.9171
       Factor74  |      0.68068      0.01814            0.0073       0.9244
       Factor75  |      0.66254      0.03256            0.0071       0.9316
       Factor76  |      0.62998      0.01767            0.0068       0.9383
       Factor77  |      0.61230      0.01033            0.0066       0.9449
       Factor78  |      0.60198      0.01767            0.0065       0.9514
       Factor79  |      0.58430      0.02489            0.0063       0.9577
       Factor80  |      0.55941      0.01102            0.0060       0.9637
       Factor81  |      0.54839      0.01137            0.0059       0.9696
       Factor82  |      0.53702      0.01501            0.0058       0.9754
       Factor83  |      0.52201      0.00296            0.0056       0.9810
       Factor84  |      0.51905      0.08423            0.0056       0.9866
       Factor85  |      0.43482      0.02064            0.0047       0.9912
       Factor86  |      0.41419      0.01716            0.0045       0.9957
       Factor87  |      0.39703      0.39465            0.0043       1.0000
       Factor88  |      0.00238      0.00190            0.0000       1.0000
       Factor89  |      0.00047      0.00000            0.0000       1.0000
       Factor90  |      0.00047      0.00019            0.0000       1.0000
       Factor91  |      0.00029      0.00004            0.0000       1.0000
       Factor92  |      0.00025      0.00018            0.0000       1.0000
       Factor93  |      0.00007            .            0.0000       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated: chi2(4278)= 2.4e+06 Prob>chi2 = 0.0000

Factor loadings (pattern matrix) and unique variances

    ---------------------------------------
        Variable |  Factor1 |   Uniqueness 
    -------------+----------+--------------
     drinkwat_11 |   0.1136 |      0.9871  
     drinkwat_12 |  -0.0143 |      0.9998  
     drinkwat_13 |  -0.0645 |      0.9958  
     drinkwat_14 |  -0.0156 |      0.9998  
     drinkwat_21 |   0.0581 |      0.9966  
     drinkwat_31 |  -0.1279 |      0.9837  
     drinkwat_32 |  -0.1944 |      0.9622  
     drinkwat_41 |  -0.2367 |      0.9440  
     drinkwat_42 |  -0.2128 |      0.9547  
     drinkwat_43 |  -0.1996 |      0.9602  
     drinkwat_51 |  -0.1125 |      0.9873  
     drinkwat_61 |  -0.0544 |      0.9970  
     drinkwat_62 |   0.0155 |      0.9998  
     drinkwat_71 |   0.3467 |      0.8798  
     drinkwat_72 |   0.2273 |      0.9483  
     drinkwat_96 |   0.0077 |      0.9999  
    toiletfac_11 |   0.5857 |      0.6570  
    toiletfac_12 |  -0.1053 |      0.9889  
    toiletfac_21 |  -0.2791 |      0.9221  
    toiletfac_31 |  -0.2678 |      0.9283  
    toiletfac_32 |  -0.1064 |      0.9887  
    toiletfac_33 |  -0.0439 |      0.9981  
    toiletfac_41 |  -0.2431 |      0.9409  
    toiletfac_51 |  -0.2614 |      0.9317  
    toiletfac_96 |  -0.0249 |      0.9994  
      cookfuel_1 |  -0.0019 |      1.0000  
      cookfuel_2 |   0.5958 |      0.6450  
      cookfuel_3 |   0.0505 |      0.9975  
      cookfuel_4 |   0.0012 |      1.0000  
      cookfuel_5 |  -0.0079 |      0.9999  
      cookfuel_6 |  -0.0121 |      0.9999  
      cookfuel_7 |  -0.0318 |      0.9990  
      cookfuel_8 |  -0.6522 |      0.5746  
      cookfuel_9 |  -0.0189 |      0.9996  
     cookfuel_96 |  -0.0227 |      0.9995  
     electricity |   0.3490 |      0.8782  
           radio |   0.2476 |      0.9387  
      television |   0.5625 |      0.6836  
       telephone |   0.2743 |      0.9248  
        computer |   0.5338 |      0.7151  
    refrigerator |   0.6930 |      0.5197  
             fan |   0.6197 |      0.6159  
     washingmach |   0.6092 |      0.6288  
         aircond |   0.4554 |      0.7926  
           watch |   0.5227 |      0.7268  
              hp |   0.4438 |      0.8030  
          bcycle |   0.3564 |      0.8730  
        motorcyc |   0.5129 |      0.7369  
      animdrcart |  -0.0020 |      1.0000  
             car |   0.4721 |      0.7771  
            boat |  -0.0567 |      0.9968  
          bankac |   0.5632 |      0.6828  
     matfloor_11 |  -0.2765 |      0.9235  
     matfloor_21 |  -0.2937 |      0.9137  
     matfloor_22 |  -0.1589 |      0.9747  
     matfloor_31 |  -0.0109 |      0.9999  
     matfloor_32 |  -0.0022 |      1.0000  
     matfloor_33 |   0.6421 |      0.5877  
     matfloor_34 |   0.0293 |      0.9991  
     matfloor_35 |  -0.3357 |      0.8873  
     matfloor_36 |  -0.0201 |      0.9996  
     matfloor_96 |  -0.0169 |      0.9997  
      matroof_12 |  -0.2282 |      0.9479  
      matroof_13 |  -0.1321 |      0.9826  
      matroof_21 |  -0.0248 |      0.9994  
      matroof_22 |  -0.0233 |      0.9995  
      matroof_23 |  -0.0235 |      0.9994  
      matroof_31 |  -0.2640 |      0.9303  
      matroof_32 |   0.0945 |      0.9911  
      matroof_33 |   0.2365 |      0.9441  
      matroof_34 |   0.0951 |      0.9909  
      matroof_35 |   0.1493 |      0.9777  
      matroof_36 |  -0.0296 |      0.9991  
      matroof_96 |  -0.0004 |      1.0000  
      matwall_12 |  -0.1927 |      0.9629  
      matwall_21 |  -0.0648 |      0.9958  
      matwall_22 |  -0.0094 |      0.9999  
      matwall_23 |  -0.1002 |      0.9900  
      matwall_24 |  -0.0617 |      0.9962  
      matwall_25 |  -0.0056 |      1.0000  
      matwall_26 |  -0.0357 |      0.9987  
      matwall_31 |  -0.1984 |      0.9606  
      matwall_32 |  -0.0389 |      0.9985  
      matwall_34 |   0.0215 |      0.9995  
      matwall_35 |   0.5489 |      0.6987  
      matwall_36 |  -0.4315 |      0.8138  
      matwall_37 |  -0.0079 |      0.9999  
      matwall_38 |  -0.0676 |      0.9954  
      matwall_96 |  -0.0289 |      0.9992  
           house |   0.0933 |      0.9913  
            land |   0.0277 |      0.9992  
    memsleep_i~l |  -0.2361 |      0.9443  
    floorarea_~l |   0.4306 |      0.8145  
    ---------------------------------------

. predict wi_complete_all
(option regression assumed; regression scoring)

Scoring coefficients (method = regression)

    ------------------------
        Variable |  Factor1 
    -------------+----------
     drinkwat_11 |  0.01548 
     drinkwat_12 | -0.00195 
     drinkwat_13 | -0.00880 
     drinkwat_14 | -0.00213 
     drinkwat_21 |  0.00792 
     drinkwat_31 | -0.01743 
     drinkwat_32 | -0.02650 
     drinkwat_41 | -0.03228 
     drinkwat_42 | -0.02902 
     drinkwat_43 | -0.02722 
     drinkwat_51 | -0.01534 
     drinkwat_61 | -0.00742 
     drinkwat_62 |  0.00211 
     drinkwat_71 |  0.04727 
     drinkwat_72 |  0.03099 
     drinkwat_96 |  0.00104 
    toiletfac_11 |  0.07985 
    toiletfac_12 | -0.01435 
    toiletfac_21 | -0.03805 
    toiletfac_31 | -0.03651 
    toiletfac_32 | -0.01451 
    toiletfac_33 | -0.00598 
    toiletfac_41 | -0.03314 
    toiletfac_51 | -0.03564 
    toiletfac_96 | -0.00340 
      cookfuel_1 | -0.00026 
      cookfuel_2 |  0.08124 
      cookfuel_3 |  0.00688 
      cookfuel_4 |  0.00017 
      cookfuel_5 | -0.00108 
      cookfuel_6 | -0.00166 
      cookfuel_7 | -0.00434 
      cookfuel_8 | -0.08893 
      cookfuel_9 | -0.00258 
     cookfuel_96 | -0.00309 
     electricity |  0.04759 
           radio |  0.03376 
      television |  0.07669 
       telephone |  0.03739 
        computer |  0.07278 
    refrigerator |  0.09449 
             fan |  0.08450 
     washingmach |  0.08307 
         aircond |  0.06210 
           watch |  0.07127 
              hp |  0.06051 
          bcycle |  0.04860 
        motorcyc |  0.06994 
      animdrcart | -0.00027 
             car |  0.06437 
            boat | -0.00773 
          bankac |  0.07679 
     matfloor_11 | -0.03770 
     matfloor_21 | -0.04004 
     matfloor_22 | -0.02167 
     matfloor_31 | -0.00149 
     matfloor_32 | -0.00030 
     matfloor_33 |  0.08754 
     matfloor_34 |  0.00399 
     matfloor_35 | -0.04578 
     matfloor_36 | -0.00274 
     matfloor_96 | -0.00231 
      matroof_12 | -0.03111 
      matroof_13 | -0.01801 
      matroof_21 | -0.00338 
      matroof_22 | -0.00317 
      matroof_23 | -0.00320 
      matroof_31 | -0.03599 
      matroof_32 |  0.01288 
      matroof_33 |  0.03224 
      matroof_34 |  0.01297 
      matroof_35 |  0.02036 
      matroof_36 | -0.00404 
      matroof_96 | -0.00006 
      matwall_12 | -0.02628 
      matwall_21 | -0.00883 
      matwall_22 | -0.00128 
      matwall_23 | -0.01367 
      matwall_24 | -0.00841 
      matwall_25 | -0.00077 
      matwall_26 | -0.00487 
      matwall_31 | -0.02706 
      matwall_32 | -0.00531 
      matwall_34 |  0.00293 
      matwall_35 |  0.07484 
      matwall_36 | -0.05883 
      matwall_37 | -0.00108 
      matwall_38 | -0.00921 
      matwall_96 | -0.00394 
           house |  0.01272 
            land |  0.00378 
    memsleep_i~l | -0.03218 
    floorarea_~l |  0.05872 
    ------------------------


. lab var wi_complete_all "Indeks kekayaan (lengkap, umum)"

. 
. /*
> ******************************************************************
> Kota-desa                                                                                                       [done]
> ******************************************************************
> */
. 
. /*
> ------------------------------------------------------------------
> Ringkasan Deskriptif                                                                            [done]
> ------------------------------------------------------------------
> */
. 
. *\raw
. #delimit ;
delimiter now ;
. glo indicator
>         drinkwat_* toiletfac_* cookfuel_* electricity-bankac
>         matfloor_* matroof_* matwall_* house land
>         cowbull_* buffal_* horse_* goat_* pig_* chicken_*
>         ;

. #delimit cr
delimiter now cr
. sort hv025, stable

. by hv025: summ $indicator memsleep landarea floorarea

----------------------------------------------------------------------------------------------------------------------------------
-> hv025 = urban

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 drinkwat_11 |     24,560    .1221091    .3274185          0          1
 drinkwat_12 |     24,560    .0163274    .1267337          0          1
 drinkwat_13 |     24,560    .0103827    .1013674          0          1
 drinkwat_14 |     24,560    .0050896    .0711609          0          1
 drinkwat_21 |     24,560     .127158    .3331566          0          1
-------------+---------------------------------------------------------
 drinkwat_31 |     24,560      .11193    .3152867          0          1
 drinkwat_32 |     24,560    .0216205    .1454439          0          1
 drinkwat_41 |     24,560    .0302117    .1711729          0          1
 drinkwat_42 |     24,560    .0052932    .0725628          0          1
 drinkwat_43 |     24,560    .0025244    .0501813          0          1
-------------+---------------------------------------------------------
 drinkwat_51 |     24,560    .0120928    .1093027          0          1
 drinkwat_61 |     24,560    .0035423    .0594133          0          1
 drinkwat_62 |     24,560    .0067997     .082181          0          1
 drinkwat_71 |     24,560    .1618485    .3683193          0          1
 drinkwat_72 |     24,560    .3629886    .4808714          0          1
-------------+---------------------------------------------------------
 drinkwat_96 |     24,560    .0000814    .0090239          0          1
toiletfac_11 |     24,560    .8087948    .3932583          0          1
toiletfac_12 |     24,560    .0699511    .2550698          0          1
toiletfac_21 |     24,560    .0661645    .2485745          0          1
toiletfac_31 |     24,560    .0344055    .1822722          0          1
-------------+---------------------------------------------------------
toiletfac_32 |     24,560    .0035423    .0594133          0          1
toiletfac_33 |     24,560    .0015879    .0398182          0          1
toiletfac_41 |     24,560     .009772    .0983712          0          1
toiletfac_51 |     24,560    .0052117    .0720054          0          1
toiletfac_96 |     24,560    .0003257    .0180455          0          1
-------------+---------------------------------------------------------
  cookfuel_1 |     24,560    .0059853    .0771347          0          1
  cookfuel_2 |     24,560     .790228    .4071541          0          1
  cookfuel_3 |     24,560    .0086319    .0925082          0          1
  cookfuel_4 |     24,560    .0001221    .0110517          0          1
  cookfuel_5 |     24,560    .0986156    .2981513          0          1
-------------+---------------------------------------------------------
  cookfuel_6 |     24,560    .0000407     .006381          0          1
  cookfuel_7 |     24,560     .000855    .0292293          0          1
  cookfuel_8 |     24,560    .0743485    .2623426          0          1
  cookfuel_9 |     24,560    .0001629    .0127611          0          1
 cookfuel_96 |     24,560    .0208876    .1430111          0          1
-------------+---------------------------------------------------------
 electricity |     24,560    .9886401     .105978          0          1
       radio |     24,560    .2403909    .4273295          0          1
  television |     24,560    .9285423     .257593          0          1
   telephone |     24,560    .0571254    .2320868          0          1
    computer |     24,560    .3470684    .4760474          0          1
-------------+---------------------------------------------------------
refrigerator |     24,560    .7245928    .4467283          0          1
         fan |     24,560    .7660423    .4233542          0          1
 washingmach |     24,560    .4628257    .4986263          0          1
     aircond |     24,560    .1686889    .3744846          0          1
       watch |     24,560    .6206026    .4852469          0          1
-------------+---------------------------------------------------------
          hp |     24,560    .9478827     .222268          0          1
      bcycle |     24,560     .391816    .4881659          0          1
    motorcyc |     24,560    .8240228    .3808085          0          1
  animdrcart |     24,560    .0018322    .0427664          0          1
         car |     24,560    .1837541    .3872914          0          1
-------------+---------------------------------------------------------
        boat |     24,560    .0070847    .0838736          0          1
      bankac |     24,560    .6699104    .4702547          0          1
 matfloor_11 |     24,560     .015798     .124696          0          1
 matfloor_21 |     24,560    .0778094    .2678769          0          1
 matfloor_22 |     24,560    .0015879    .0398182          0          1
-------------+---------------------------------------------------------
 matfloor_31 |     24,560    .0012622     .035506          0          1
 matfloor_32 |     24,560    .0013029    .0360734          0          1
 matfloor_33 |     24,560     .601873    .4895219          0          1
 matfloor_34 |     24,560    .0550489    .2280803          0          1
 matfloor_35 |     24,560    .2398208    .4269827          0          1
-------------+---------------------------------------------------------
 matfloor_36 |     24,560    .0031759    .0562667          0          1
 matfloor_96 |     24,560    .0005293    .0230012          0          1
  matroof_12 |     24,560    .0042345    .0649366          0          1
  matroof_13 |     24,560    .0000814    .0090239          0          1
  matroof_21 |     24,560    .0002443    .0156285          0          1
-------------+---------------------------------------------------------
  matroof_22 |     24,560    .0001221    .0110517          0          1
  matroof_23 |     24,560    .0005293    .0230012          0          1
  matroof_31 |     24,560    .4105456    .4919428          0          1
  matroof_32 |     24,560    .1339577    .3406137          0          1
  matroof_33 |     24,560    .4041124    .4907294          0          1
-------------+---------------------------------------------------------
  matroof_34 |     24,560    .0176303    .1316061          0          1
  matroof_35 |     24,560    .0246336    .1550088          0          1
  matroof_36 |     24,560    .0032573    .0569811          0          1
  matroof_96 |     24,560    .0002443    .0156285          0          1
  matwall_12 |     24,560    .0041938     .064625          0          1
-------------+---------------------------------------------------------
  matwall_21 |     24,560    .0021987    .0468396          0          1
  matwall_22 |     24,560    .0000814    .0090239          0          1
  matwall_23 |     24,560    .0233306    .1509544          0          1
  matwall_24 |     24,560    .0111564    .1050349          0          1
  matwall_25 |     24,560    .0000407     .006381          0          1
-------------+---------------------------------------------------------
  matwall_26 |     24,560    .0022394    .0472704          0          1
  matwall_31 |     24,560    .0153502    .1229437          0          1
  matwall_32 |     24,560    .0258958    .1588276          0          1
  matwall_34 |     24,560    .1110749    .3142313          0          1
  matwall_35 |     24,560    .6661645    .4715914          0          1
-------------+---------------------------------------------------------
  matwall_36 |     24,560    .1248779    .3305871          0          1
  matwall_37 |     24,560    .0026466    .0513778          0          1
  matwall_38 |     24,560     .009772    .0983712          0          1
  matwall_96 |     24,560    .0006515     .025516          0          1
       house |     24,560    .4772801    .4994937          0          1
-------------+---------------------------------------------------------
        land |     24,560    .2892101    .4534049          0          1
   cowbull_1 |     24,560    .0170603    .1294986          0          1
   cowbull_2 |     24,560    .0013436    .0366319          0          1
   cowbull_3 |     24,560    .0007736    .0278038          0          1
    buffal_1 |     24,560    .0010586    .0325201          0          1
-------------+---------------------------------------------------------
    buffal_2 |     24,560    .0001629    .0127611          0          1
    buffal_3 |     24,560    .0000814    .0090239          0          1
     horse_1 |     24,560    .0005293    .0230012          0          1
     horse_2 |     24,560    .0000814    .0090239          0          1
      goat_1 |     24,560    .0164902    .1273537          0          1
-------------+---------------------------------------------------------
      goat_2 |     24,560    .0065554    .0807011          0          1
      goat_3 |     24,560    .0023208    .0481202          0          1
       pig_1 |     24,560    .0095684    .0973511          0          1
       pig_2 |     24,560    .0011401    .0337463          0          1
       pig_3 |     24,560    .0012215    .0349293          0          1
-------------+---------------------------------------------------------
   chicken_1 |     24,560    .1313925     .337836          0          1
   chicken_2 |     24,560    .0675896    .2510454          0          1
   chicken_3 |     24,560    .0116042    .1070983          0          1
    memsleep |     24,534    1.735714    1.224193          0         11
    landarea |     24,312    .2303801    2.268739          0         95
-------------+---------------------------------------------------------
   floorarea |     24,360    82.28383    65.25791          0        995

----------------------------------------------------------------------------------------------------------------------------------
-> hv025 = rural

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 drinkwat_11 |     23,403    .0453361    .2080446          0          1
 drinkwat_12 |     23,403    .0102978    .1009565          0          1
 drinkwat_13 |     23,403    .0057258    .0754534          0          1
 drinkwat_14 |     23,403    .0045721    .0674637          0          1
 drinkwat_21 |     23,403    .1333162    .3399235          0          1
-------------+---------------------------------------------------------
 drinkwat_31 |     23,403    .2096312    .4070541          0          1
 drinkwat_32 |     23,403    .0847327    .2784895          0          1
 drinkwat_41 |     23,403    .1582276    .3649621          0          1
 drinkwat_42 |     23,403    .0513182    .2206507          0          1
 drinkwat_43 |     23,403    .0445242     .206261          0          1
-------------+---------------------------------------------------------
 drinkwat_51 |     23,403     .044866    .2070143          0          1
 drinkwat_61 |     23,403    .0080759    .0895042          0          1
 drinkwat_62 |     23,403    .0061103    .0779311          0          1
 drinkwat_71 |     23,403    .0253386    .1571548          0          1
 drinkwat_72 |     23,403    .1676281    .3735437          0          1
-------------+---------------------------------------------------------
 drinkwat_96 |     23,403    .0001709    .0130727          0          1
toiletfac_11 |     23,403     .588557    .4921057          0          1
toiletfac_12 |     23,403    .0930223    .2904698          0          1
toiletfac_21 |     23,403     .098278    .2976965          0          1
toiletfac_31 |     23,403    .1004145    .3005583          0          1
-------------+---------------------------------------------------------
toiletfac_32 |     23,403    .0105542    .1021923          0          1
toiletfac_33 |     23,403    .0039738    .0629144          0          1
toiletfac_41 |     23,403    .0616588    .2405399          0          1
toiletfac_51 |     23,403    .0426441    .2020577          0          1
toiletfac_96 |     23,403    .0006837    .0261388          0          1
-------------+---------------------------------------------------------
  cookfuel_1 |     23,403    .0022647    .0475356          0          1
  cookfuel_2 |     23,403    .5082682    .4999423          0          1
  cookfuel_3 |     23,403    .0012392    .0351806          0          1
  cookfuel_4 |     23,403    .0001709    .0130727          0          1
  cookfuel_5 |     23,403    .0560612    .2300448          0          1
-------------+---------------------------------------------------------
  cookfuel_6 |     23,403    .0002136    .0146154          0          1
  cookfuel_7 |     23,403    .0023929    .0488593          0          1
  cookfuel_8 |     23,403     .425031    .4943583          0          1
  cookfuel_9 |     23,403      .00047    .0216754          0          1
 cookfuel_96 |     23,403    .0037602    .0612064          0          1
-------------+---------------------------------------------------------
 electricity |     23,403    .9343247     .247719          0          1
       radio |     23,403    .1380592    .3449695          0          1
  television |     23,403    .7717387    .4197209          0          1
   telephone |     23,403    .0026492    .0514036          0          1
    computer |     23,403    .1331026    .3396928          0          1
-------------+---------------------------------------------------------
refrigerator |     23,403    .4146904    .4926791          0          1
         fan |     23,403    .4509678    .4976007          0          1
 washingmach |     23,403    .1923258     .394136          0          1
     aircond |     23,403    .0180319    .1330695          0          1
       watch |     23,403    .3729436    .4835976          0          1
-------------+---------------------------------------------------------
          hp |     23,403    .8406187    .3660391          0          1
      bcycle |     23,403    .2713755    .4446788          0          1
    motorcyc |     23,403    .7040123    .4564952          0          1
  animdrcart |     23,403    .0034611    .0587304          0          1
         car |     23,403    .0724266    .2591985          0          1
-------------+---------------------------------------------------------
        boat |     23,403    .0215357    .1451648          0          1
      bankac |     23,403    .4100329    .4918498          0          1
 matfloor_11 |     23,403    .0696065    .2544881          0          1
 matfloor_21 |     23,403     .175704    .3805762          0          1
 matfloor_22 |     23,403    .0118788     .108343          0          1
-------------+---------------------------------------------------------
 matfloor_31 |     23,403    .0019656     .044292          0          1
 matfloor_32 |     23,403    .0017092    .0413078          0          1
 matfloor_33 |     23,403    .2802632    .4491374          0          1
 matfloor_34 |     23,403    .0344828    .1824695          0          1
 matfloor_35 |     23,403    .4192198    .4934419          0          1
-------------+---------------------------------------------------------
 matfloor_36 |     23,403    .0032474     .056895          0          1
 matfloor_96 |     23,403    .0005128    .0226388          0          1
  matroof_12 |     23,403    .0302525    .1712851          0          1
  matroof_13 |     23,403     .005213    .0720143          0          1
  matroof_21 |     23,403    .0005982    .0244516          0          1
-------------+---------------------------------------------------------
  matroof_22 |     23,403    .0002136    .0146154          0          1
  matroof_23 |     23,403    .0006409    .0253093          0          1
  matroof_31 |     23,403    .5755672    .4942672          0          1
  matroof_32 |     23,403    .0462761    .2100869          0          1
  matroof_33 |     23,403    .3167543    .4652206          0          1
-------------+---------------------------------------------------------
  matroof_34 |     23,403    .0043157    .0655534          0          1
  matroof_35 |     23,403    .0136307    .1159548          0          1
  matroof_36 |     23,403    .0061531    .0782014          0          1
  matroof_96 |     23,403    .0002136    .0146154          0          1
  matwall_12 |     23,403    .0217493    .1458671          0          1
-------------+---------------------------------------------------------
  matwall_21 |     23,403    .0058967    .0765647          0          1
  matwall_22 |     23,403    .0004273    .0206672          0          1
  matwall_23 |     23,403    .0433705    .2036941          0          1
  matwall_24 |     23,403    .0100842    .0999145          0          1
  matwall_25 |     23,403    .0001709    .0130727          0          1
-------------+---------------------------------------------------------
  matwall_26 |     23,403    .0014101    .0375253          0          1
  matwall_31 |     23,403    .0381148    .1914774          0          1
  matwall_32 |     23,403    .0352519    .1844198          0          1
  matwall_34 |     23,403    .0802461    .2716797          0          1
  matwall_35 |     23,403    .4072982    .4913417          0          1
-------------+---------------------------------------------------------
  matwall_36 |     23,403    .3362817    .4724467          0          1
  matwall_37 |     23,403    .0050848    .0711279          0          1
  matwall_38 |     23,403     .013118    .1137825          0          1
  matwall_96 |     23,403    .0014528    .0380888          0          1
       house |     23,403    .5659958     .495636          0          1
-------------+---------------------------------------------------------
        land |     23,403    .4363543    .4959433          0          1
   cowbull_1 |     23,403    .0928513    .2902302          0          1
   cowbull_2 |     23,403    .0103406    .1011636          0          1
   cowbull_3 |     23,403     .003162    .0561438          0          1
    buffal_1 |     23,403     .006324    .0792733          0          1
-------------+---------------------------------------------------------
    buffal_2 |     23,403    .0008546    .0292215          0          1
    buffal_3 |     23,403    .0002564    .0160101          0          1
     horse_1 |     23,403     .002521    .0501477          0          1
     horse_2 |     23,403    .0001282    .0113216          0          1
      goat_1 |     23,403    .0666581    .2494343          0          1
-------------+---------------------------------------------------------
      goat_2 |     23,403    .0218348    .1461471          0          1
      goat_3 |     23,403    .0073495    .0854153          0          1
       pig_1 |     23,403    .0775969    .2675419          0          1
       pig_2 |     23,403    .0070931    .0839232          0          1
       pig_3 |     23,403    .0024783     .049722          0          1
-------------+---------------------------------------------------------
   chicken_1 |     23,403    .2915865    .4545027          0          1
   chicken_2 |     23,403    .1624151     .368839          0          1
   chicken_3 |     23,403     .019912    .1397008          0          1
    memsleep |     23,390    1.776528    1.290286          0         14
    landarea |     22,945    .7598998    2.836604          0         95
-------------+---------------------------------------------------------
   floorarea |     23,283    73.00094    49.28934          0        995


. by hv025: mdesc $indicator memsleep landarea floorarea

----------------------------------------------------------------------------------------------------------------------------------
-> hv025 = urban

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
    drinkwat_11 |           0         24,560           0.00
    drinkwat_12 |           0         24,560           0.00
    drinkwat_13 |           0         24,560           0.00
    drinkwat_14 |           0         24,560           0.00
    drinkwat_21 |           0         24,560           0.00
    drinkwat_31 |           0         24,560           0.00
    drinkwat_32 |           0         24,560           0.00
    drinkwat_41 |           0         24,560           0.00
    drinkwat_42 |           0         24,560           0.00
    drinkwat_43 |           0         24,560           0.00
    drinkwat_51 |           0         24,560           0.00
    drinkwat_61 |           0         24,560           0.00
    drinkwat_62 |           0         24,560           0.00
    drinkwat_71 |           0         24,560           0.00
    drinkwat_72 |           0         24,560           0.00
    drinkwat_96 |           0         24,560           0.00
   toiletfac_11 |           0         24,560           0.00
   toiletfac_12 |           0         24,560           0.00
   toiletfac_21 |           0         24,560           0.00
   toiletfac_31 |           0         24,560           0.00
   toiletfac_32 |           0         24,560           0.00
   toiletfac_33 |           0         24,560           0.00
   toiletfac_41 |           0         24,560           0.00
   toiletfac_51 |           0         24,560           0.00
   toiletfac_96 |           0         24,560           0.00
     cookfuel_1 |           0         24,560           0.00
     cookfuel_2 |           0         24,560           0.00
     cookfuel_3 |           0         24,560           0.00
     cookfuel_4 |           0         24,560           0.00
     cookfuel_5 |           0         24,560           0.00
     cookfuel_6 |           0         24,560           0.00
     cookfuel_7 |           0         24,560           0.00
     cookfuel_8 |           0         24,560           0.00
     cookfuel_9 |           0         24,560           0.00
    cookfuel_96 |           0         24,560           0.00
    electricity |           0         24,560           0.00
          radio |           0         24,560           0.00
     television |           0         24,560           0.00
      telephone |           0         24,560           0.00
       computer |           0         24,560           0.00
   refrigerator |           0         24,560           0.00
            fan |           0         24,560           0.00
    washingmach |           0         24,560           0.00
        aircond |           0         24,560           0.00
          watch |           0         24,560           0.00
             hp |           0         24,560           0.00
         bcycle |           0         24,560           0.00
       motorcyc |           0         24,560           0.00
     animdrcart |           0         24,560           0.00
            car |           0         24,560           0.00
           boat |           0         24,560           0.00
         bankac |           0         24,560           0.00
    matfloor_11 |           0         24,560           0.00
    matfloor_21 |           0         24,560           0.00
    matfloor_22 |           0         24,560           0.00
    matfloor_31 |           0         24,560           0.00
    matfloor_32 |           0         24,560           0.00
    matfloor_33 |           0         24,560           0.00
    matfloor_34 |           0         24,560           0.00
    matfloor_35 |           0         24,560           0.00
    matfloor_36 |           0         24,560           0.00
    matfloor_96 |           0         24,560           0.00
     matroof_12 |           0         24,560           0.00
     matroof_13 |           0         24,560           0.00
     matroof_21 |           0         24,560           0.00
     matroof_22 |           0         24,560           0.00
     matroof_23 |           0         24,560           0.00
     matroof_31 |           0         24,560           0.00
     matroof_32 |           0         24,560           0.00
     matroof_33 |           0         24,560           0.00
     matroof_34 |           0         24,560           0.00
     matroof_35 |           0         24,560           0.00
     matroof_36 |           0         24,560           0.00
     matroof_96 |           0         24,560           0.00
     matwall_12 |           0         24,560           0.00
     matwall_21 |           0         24,560           0.00
     matwall_22 |           0         24,560           0.00
     matwall_23 |           0         24,560           0.00
     matwall_24 |           0         24,560           0.00
     matwall_25 |           0         24,560           0.00
     matwall_26 |           0         24,560           0.00
     matwall_31 |           0         24,560           0.00
     matwall_32 |           0         24,560           0.00
     matwall_34 |           0         24,560           0.00
     matwall_35 |           0         24,560           0.00
     matwall_36 |           0         24,560           0.00
     matwall_37 |           0         24,560           0.00
     matwall_38 |           0         24,560           0.00
     matwall_96 |           0         24,560           0.00
          house |           0         24,560           0.00
           land |           0         24,560           0.00
      cowbull_1 |           0         24,560           0.00
      cowbull_2 |           0         24,560           0.00
      cowbull_3 |           0         24,560           0.00
       buffal_1 |           0         24,560           0.00
       buffal_2 |           0         24,560           0.00
       buffal_3 |           0         24,560           0.00
        horse_1 |           0         24,560           0.00
        horse_2 |           0         24,560           0.00
         goat_1 |           0         24,560           0.00
         goat_2 |           0         24,560           0.00
         goat_3 |           0         24,560           0.00
          pig_1 |           0         24,560           0.00
          pig_2 |           0         24,560           0.00
          pig_3 |           0         24,560           0.00
      chicken_1 |           0         24,560           0.00
      chicken_2 |           0         24,560           0.00
      chicken_3 |           0         24,560           0.00
       memsleep |          26         24,560           0.11
       landarea |         248         24,560           1.01
      floorarea |         200         24,560           0.81
----------------+-----------------------------------------------

----------------------------------------------------------------------------------------------------------------------------------
-> hv025 = rural

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
    drinkwat_11 |           0         23,403           0.00
    drinkwat_12 |           0         23,403           0.00
    drinkwat_13 |           0         23,403           0.00
    drinkwat_14 |           0         23,403           0.00
    drinkwat_21 |           0         23,403           0.00
    drinkwat_31 |           0         23,403           0.00
    drinkwat_32 |           0         23,403           0.00
    drinkwat_41 |           0         23,403           0.00
    drinkwat_42 |           0         23,403           0.00
    drinkwat_43 |           0         23,403           0.00
    drinkwat_51 |           0         23,403           0.00
    drinkwat_61 |           0         23,403           0.00
    drinkwat_62 |           0         23,403           0.00
    drinkwat_71 |           0         23,403           0.00
    drinkwat_72 |           0         23,403           0.00
    drinkwat_96 |           0         23,403           0.00
   toiletfac_11 |           0         23,403           0.00
   toiletfac_12 |           0         23,403           0.00
   toiletfac_21 |           0         23,403           0.00
   toiletfac_31 |           0         23,403           0.00
   toiletfac_32 |           0         23,403           0.00
   toiletfac_33 |           0         23,403           0.00
   toiletfac_41 |           0         23,403           0.00
   toiletfac_51 |           0         23,403           0.00
   toiletfac_96 |           0         23,403           0.00
     cookfuel_1 |           0         23,403           0.00
     cookfuel_2 |           0         23,403           0.00
     cookfuel_3 |           0         23,403           0.00
     cookfuel_4 |           0         23,403           0.00
     cookfuel_5 |           0         23,403           0.00
     cookfuel_6 |           0         23,403           0.00
     cookfuel_7 |           0         23,403           0.00
     cookfuel_8 |           0         23,403           0.00
     cookfuel_9 |           0         23,403           0.00
    cookfuel_96 |           0         23,403           0.00
    electricity |           0         23,403           0.00
          radio |           0         23,403           0.00
     television |           0         23,403           0.00
      telephone |           0         23,403           0.00
       computer |           0         23,403           0.00
   refrigerator |           0         23,403           0.00
            fan |           0         23,403           0.00
    washingmach |           0         23,403           0.00
        aircond |           0         23,403           0.00
          watch |           0         23,403           0.00
             hp |           0         23,403           0.00
         bcycle |           0         23,403           0.00
       motorcyc |           0         23,403           0.00
     animdrcart |           0         23,403           0.00
            car |           0         23,403           0.00
           boat |           0         23,403           0.00
         bankac |           0         23,403           0.00
    matfloor_11 |           0         23,403           0.00
    matfloor_21 |           0         23,403           0.00
    matfloor_22 |           0         23,403           0.00
    matfloor_31 |           0         23,403           0.00
    matfloor_32 |           0         23,403           0.00
    matfloor_33 |           0         23,403           0.00
    matfloor_34 |           0         23,403           0.00
    matfloor_35 |           0         23,403           0.00
    matfloor_36 |           0         23,403           0.00
    matfloor_96 |           0         23,403           0.00
     matroof_12 |           0         23,403           0.00
     matroof_13 |           0         23,403           0.00
     matroof_21 |           0         23,403           0.00
     matroof_22 |           0         23,403           0.00
     matroof_23 |           0         23,403           0.00
     matroof_31 |           0         23,403           0.00
     matroof_32 |           0         23,403           0.00
     matroof_33 |           0         23,403           0.00
     matroof_34 |           0         23,403           0.00
     matroof_35 |           0         23,403           0.00
     matroof_36 |           0         23,403           0.00
     matroof_96 |           0         23,403           0.00
     matwall_12 |           0         23,403           0.00
     matwall_21 |           0         23,403           0.00
     matwall_22 |           0         23,403           0.00
     matwall_23 |           0         23,403           0.00
     matwall_24 |           0         23,403           0.00
     matwall_25 |           0         23,403           0.00
     matwall_26 |           0         23,403           0.00
     matwall_31 |           0         23,403           0.00
     matwall_32 |           0         23,403           0.00
     matwall_34 |           0         23,403           0.00
     matwall_35 |           0         23,403           0.00
     matwall_36 |           0         23,403           0.00
     matwall_37 |           0         23,403           0.00
     matwall_38 |           0         23,403           0.00
     matwall_96 |           0         23,403           0.00
          house |           0         23,403           0.00
           land |           0         23,403           0.00
      cowbull_1 |           0         23,403           0.00
      cowbull_2 |           0         23,403           0.00
      cowbull_3 |           0         23,403           0.00
       buffal_1 |           0         23,403           0.00
       buffal_2 |           0         23,403           0.00
       buffal_3 |           0         23,403           0.00
        horse_1 |           0         23,403           0.00
        horse_2 |           0         23,403           0.00
         goat_1 |           0         23,403           0.00
         goat_2 |           0         23,403           0.00
         goat_3 |           0         23,403           0.00
          pig_1 |           0         23,403           0.00
          pig_2 |           0         23,403           0.00
          pig_3 |           0         23,403           0.00
      chicken_1 |           0         23,403           0.00
      chicken_2 |           0         23,403           0.00
      chicken_3 |           0         23,403           0.00
       memsleep |          13         23,403           0.06
       landarea |         458         23,403           1.96
      floorarea |         120         23,403           0.51
----------------+-----------------------------------------------

. 
. *\replace missing dengan mean
. gen memsleep_iurbrur = memsleep
(39 missing values generated)

.         lab var memsleep_iurbrur "Jumlah art per ruang untuk tidur (imputasi mean, kota/desa)"

.         quiet: by hv025: egen meanval = mean(memsleep)

.         by hv025: replace memsleep_iurbrur = meanval if missing(memsleep)
(39 real changes made)

.         drop meanval

. 
. gen landarea_iurbrur = landarea
(706 missing values generated)

.         lab var landarea_iurbrur "Luas lahan yang dapat digunakan untuk pertanian (hektar) (imputasi mean, kota/desa)"
note: label truncated to 80 characters

.         quiet: by hv025: egen meanval = mean(landarea)

.         by hv025: replace landarea_iurbrur = meanval if missing(landarea)
(706 real changes made)

.         drop meanval

.         
. gen floorarea_iurbrur = floorarea
(320 missing values generated)

.         lab var floorarea_iurbrur "Luas lantai rumah (m2) (imputasi mean, kota/desa)"

.         quiet: by hv025: egen meanval = mean(floorarea)

.         by hv025: replace floorarea_iurbrur = meanval if missing(floorarea)
(320 real changes made)

.         drop meanval

. 
. by hv025: summ $indicator memsleep_iurbrur landarea_iurbrur floorarea_iurbrur

----------------------------------------------------------------------------------------------------------------------------------
-> hv025 = urban

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 drinkwat_11 |     24,560    .1221091    .3274185          0          1
 drinkwat_12 |     24,560    .0163274    .1267337          0          1
 drinkwat_13 |     24,560    .0103827    .1013674          0          1
 drinkwat_14 |     24,560    .0050896    .0711609          0          1
 drinkwat_21 |     24,560     .127158    .3331566          0          1
-------------+---------------------------------------------------------
 drinkwat_31 |     24,560      .11193    .3152867          0          1
 drinkwat_32 |     24,560    .0216205    .1454439          0          1
 drinkwat_41 |     24,560    .0302117    .1711729          0          1
 drinkwat_42 |     24,560    .0052932    .0725628          0          1
 drinkwat_43 |     24,560    .0025244    .0501813          0          1
-------------+---------------------------------------------------------
 drinkwat_51 |     24,560    .0120928    .1093027          0          1
 drinkwat_61 |     24,560    .0035423    .0594133          0          1
 drinkwat_62 |     24,560    .0067997     .082181          0          1
 drinkwat_71 |     24,560    .1618485    .3683193          0          1
 drinkwat_72 |     24,560    .3629886    .4808714          0          1
-------------+---------------------------------------------------------
 drinkwat_96 |     24,560    .0000814    .0090239          0          1
toiletfac_11 |     24,560    .8087948    .3932583          0          1
toiletfac_12 |     24,560    .0699511    .2550698          0          1
toiletfac_21 |     24,560    .0661645    .2485745          0          1
toiletfac_31 |     24,560    .0344055    .1822722          0          1
-------------+---------------------------------------------------------
toiletfac_32 |     24,560    .0035423    .0594133          0          1
toiletfac_33 |     24,560    .0015879    .0398182          0          1
toiletfac_41 |     24,560     .009772    .0983712          0          1
toiletfac_51 |     24,560    .0052117    .0720054          0          1
toiletfac_96 |     24,560    .0003257    .0180455          0          1
-------------+---------------------------------------------------------
  cookfuel_1 |     24,560    .0059853    .0771347          0          1
  cookfuel_2 |     24,560     .790228    .4071541          0          1
  cookfuel_3 |     24,560    .0086319    .0925082          0          1
  cookfuel_4 |     24,560    .0001221    .0110517          0          1
  cookfuel_5 |     24,560    .0986156    .2981513          0          1
-------------+---------------------------------------------------------
  cookfuel_6 |     24,560    .0000407     .006381          0          1
  cookfuel_7 |     24,560     .000855    .0292293          0          1
  cookfuel_8 |     24,560    .0743485    .2623426          0          1
  cookfuel_9 |     24,560    .0001629    .0127611          0          1
 cookfuel_96 |     24,560    .0208876    .1430111          0          1
-------------+---------------------------------------------------------
 electricity |     24,560    .9886401     .105978          0          1
       radio |     24,560    .2403909    .4273295          0          1
  television |     24,560    .9285423     .257593          0          1
   telephone |     24,560    .0571254    .2320868          0          1
    computer |     24,560    .3470684    .4760474          0          1
-------------+---------------------------------------------------------
refrigerator |     24,560    .7245928    .4467283          0          1
         fan |     24,560    .7660423    .4233542          0          1
 washingmach |     24,560    .4628257    .4986263          0          1
     aircond |     24,560    .1686889    .3744846          0          1
       watch |     24,560    .6206026    .4852469          0          1
-------------+---------------------------------------------------------
          hp |     24,560    .9478827     .222268          0          1
      bcycle |     24,560     .391816    .4881659          0          1
    motorcyc |     24,560    .8240228    .3808085          0          1
  animdrcart |     24,560    .0018322    .0427664          0          1
         car |     24,560    .1837541    .3872914          0          1
-------------+---------------------------------------------------------
        boat |     24,560    .0070847    .0838736          0          1
      bankac |     24,560    .6699104    .4702547          0          1
 matfloor_11 |     24,560     .015798     .124696          0          1
 matfloor_21 |     24,560    .0778094    .2678769          0          1
 matfloor_22 |     24,560    .0015879    .0398182          0          1
-------------+---------------------------------------------------------
 matfloor_31 |     24,560    .0012622     .035506          0          1
 matfloor_32 |     24,560    .0013029    .0360734          0          1
 matfloor_33 |     24,560     .601873    .4895219          0          1
 matfloor_34 |     24,560    .0550489    .2280803          0          1
 matfloor_35 |     24,560    .2398208    .4269827          0          1
-------------+---------------------------------------------------------
 matfloor_36 |     24,560    .0031759    .0562667          0          1
 matfloor_96 |     24,560    .0005293    .0230012          0          1
  matroof_12 |     24,560    .0042345    .0649366          0          1
  matroof_13 |     24,560    .0000814    .0090239          0          1
  matroof_21 |     24,560    .0002443    .0156285          0          1
-------------+---------------------------------------------------------
  matroof_22 |     24,560    .0001221    .0110517          0          1
  matroof_23 |     24,560    .0005293    .0230012          0          1
  matroof_31 |     24,560    .4105456    .4919428          0          1
  matroof_32 |     24,560    .1339577    .3406137          0          1
  matroof_33 |     24,560    .4041124    .4907294          0          1
-------------+---------------------------------------------------------
  matroof_34 |     24,560    .0176303    .1316061          0          1
  matroof_35 |     24,560    .0246336    .1550088          0          1
  matroof_36 |     24,560    .0032573    .0569811          0          1
  matroof_96 |     24,560    .0002443    .0156285          0          1
  matwall_12 |     24,560    .0041938     .064625          0          1
-------------+---------------------------------------------------------
  matwall_21 |     24,560    .0021987    .0468396          0          1
  matwall_22 |     24,560    .0000814    .0090239          0          1
  matwall_23 |     24,560    .0233306    .1509544          0          1
  matwall_24 |     24,560    .0111564    .1050349          0          1
  matwall_25 |     24,560    .0000407     .006381          0          1
-------------+---------------------------------------------------------
  matwall_26 |     24,560    .0022394    .0472704          0          1
  matwall_31 |     24,560    .0153502    .1229437          0          1
  matwall_32 |     24,560    .0258958    .1588276          0          1
  matwall_34 |     24,560    .1110749    .3142313          0          1
  matwall_35 |     24,560    .6661645    .4715914          0          1
-------------+---------------------------------------------------------
  matwall_36 |     24,560    .1248779    .3305871          0          1
  matwall_37 |     24,560    .0026466    .0513778          0          1
  matwall_38 |     24,560     .009772    .0983712          0          1
  matwall_96 |     24,560    .0006515     .025516          0          1
       house |     24,560    .4772801    .4994937          0          1
-------------+---------------------------------------------------------
        land |     24,560    .2892101    .4534049          0          1
   cowbull_1 |     24,560    .0170603    .1294986          0          1
   cowbull_2 |     24,560    .0013436    .0366319          0          1
   cowbull_3 |     24,560    .0007736    .0278038          0          1
    buffal_1 |     24,560    .0010586    .0325201          0          1
-------------+---------------------------------------------------------
    buffal_2 |     24,560    .0001629    .0127611          0          1
    buffal_3 |     24,560    .0000814    .0090239          0          1
     horse_1 |     24,560    .0005293    .0230012          0          1
     horse_2 |     24,560    .0000814    .0090239          0          1
      goat_1 |     24,560    .0164902    .1273537          0          1
-------------+---------------------------------------------------------
      goat_2 |     24,560    .0065554    .0807011          0          1
      goat_3 |     24,560    .0023208    .0481202          0          1
       pig_1 |     24,560    .0095684    .0973511          0          1
       pig_2 |     24,560    .0011401    .0337463          0          1
       pig_3 |     24,560    .0012215    .0349293          0          1
-------------+---------------------------------------------------------
   chicken_1 |     24,560    .1313925     .337836          0          1
   chicken_2 |     24,560    .0675896    .2510454          0          1
   chicken_3 |     24,560    .0116042    .1070983          0          1
memsleep_i~r |     24,560    1.735714    1.223545          0         11
landarea_i~r |     24,560    .2303801    2.257254          0         95
-------------+---------------------------------------------------------
floorarea_~r |     24,560    82.28383    64.99164          0        995

----------------------------------------------------------------------------------------------------------------------------------
-> hv025 = rural

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 drinkwat_11 |     23,403    .0453361    .2080446          0          1
 drinkwat_12 |     23,403    .0102978    .1009565          0          1
 drinkwat_13 |     23,403    .0057258    .0754534          0          1
 drinkwat_14 |     23,403    .0045721    .0674637          0          1
 drinkwat_21 |     23,403    .1333162    .3399235          0          1
-------------+---------------------------------------------------------
 drinkwat_31 |     23,403    .2096312    .4070541          0          1
 drinkwat_32 |     23,403    .0847327    .2784895          0          1
 drinkwat_41 |     23,403    .1582276    .3649621          0          1
 drinkwat_42 |     23,403    .0513182    .2206507          0          1
 drinkwat_43 |     23,403    .0445242     .206261          0          1
-------------+---------------------------------------------------------
 drinkwat_51 |     23,403     .044866    .2070143          0          1
 drinkwat_61 |     23,403    .0080759    .0895042          0          1
 drinkwat_62 |     23,403    .0061103    .0779311          0          1
 drinkwat_71 |     23,403    .0253386    .1571548          0          1
 drinkwat_72 |     23,403    .1676281    .3735437          0          1
-------------+---------------------------------------------------------
 drinkwat_96 |     23,403    .0001709    .0130727          0          1
toiletfac_11 |     23,403     .588557    .4921057          0          1
toiletfac_12 |     23,403    .0930223    .2904698          0          1
toiletfac_21 |     23,403     .098278    .2976965          0          1
toiletfac_31 |     23,403    .1004145    .3005583          0          1
-------------+---------------------------------------------------------
toiletfac_32 |     23,403    .0105542    .1021923          0          1
toiletfac_33 |     23,403    .0039738    .0629144          0          1
toiletfac_41 |     23,403    .0616588    .2405399          0          1
toiletfac_51 |     23,403    .0426441    .2020577          0          1
toiletfac_96 |     23,403    .0006837    .0261388          0          1
-------------+---------------------------------------------------------
  cookfuel_1 |     23,403    .0022647    .0475356          0          1
  cookfuel_2 |     23,403    .5082682    .4999423          0          1
  cookfuel_3 |     23,403    .0012392    .0351806          0          1
  cookfuel_4 |     23,403    .0001709    .0130727          0          1
  cookfuel_5 |     23,403    .0560612    .2300448          0          1
-------------+---------------------------------------------------------
  cookfuel_6 |     23,403    .0002136    .0146154          0          1
  cookfuel_7 |     23,403    .0023929    .0488593          0          1
  cookfuel_8 |     23,403     .425031    .4943583          0          1
  cookfuel_9 |     23,403      .00047    .0216754          0          1
 cookfuel_96 |     23,403    .0037602    .0612064          0          1
-------------+---------------------------------------------------------
 electricity |     23,403    .9343247     .247719          0          1
       radio |     23,403    .1380592    .3449695          0          1
  television |     23,403    .7717387    .4197209          0          1
   telephone |     23,403    .0026492    .0514036          0          1
    computer |     23,403    .1331026    .3396928          0          1
-------------+---------------------------------------------------------
refrigerator |     23,403    .4146904    .4926791          0          1
         fan |     23,403    .4509678    .4976007          0          1
 washingmach |     23,403    .1923258     .394136          0          1
     aircond |     23,403    .0180319    .1330695          0          1
       watch |     23,403    .3729436    .4835976          0          1
-------------+---------------------------------------------------------
          hp |     23,403    .8406187    .3660391          0          1
      bcycle |     23,403    .2713755    .4446788          0          1
    motorcyc |     23,403    .7040123    .4564952          0          1
  animdrcart |     23,403    .0034611    .0587304          0          1
         car |     23,403    .0724266    .2591985          0          1
-------------+---------------------------------------------------------
        boat |     23,403    .0215357    .1451648          0          1
      bankac |     23,403    .4100329    .4918498          0          1
 matfloor_11 |     23,403    .0696065    .2544881          0          1
 matfloor_21 |     23,403     .175704    .3805762          0          1
 matfloor_22 |     23,403    .0118788     .108343          0          1
-------------+---------------------------------------------------------
 matfloor_31 |     23,403    .0019656     .044292          0          1
 matfloor_32 |     23,403    .0017092    .0413078          0          1
 matfloor_33 |     23,403    .2802632    .4491374          0          1
 matfloor_34 |     23,403    .0344828    .1824695          0          1
 matfloor_35 |     23,403    .4192198    .4934419          0          1
-------------+---------------------------------------------------------
 matfloor_36 |     23,403    .0032474     .056895          0          1
 matfloor_96 |     23,403    .0005128    .0226388          0          1
  matroof_12 |     23,403    .0302525    .1712851          0          1
  matroof_13 |     23,403     .005213    .0720143          0          1
  matroof_21 |     23,403    .0005982    .0244516          0          1
-------------+---------------------------------------------------------
  matroof_22 |     23,403    .0002136    .0146154          0          1
  matroof_23 |     23,403    .0006409    .0253093          0          1
  matroof_31 |     23,403    .5755672    .4942672          0          1
  matroof_32 |     23,403    .0462761    .2100869          0          1
  matroof_33 |     23,403    .3167543    .4652206          0          1
-------------+---------------------------------------------------------
  matroof_34 |     23,403    .0043157    .0655534          0          1
  matroof_35 |     23,403    .0136307    .1159548          0          1
  matroof_36 |     23,403    .0061531    .0782014          0          1
  matroof_96 |     23,403    .0002136    .0146154          0          1
  matwall_12 |     23,403    .0217493    .1458671          0          1
-------------+---------------------------------------------------------
  matwall_21 |     23,403    .0058967    .0765647          0          1
  matwall_22 |     23,403    .0004273    .0206672          0          1
  matwall_23 |     23,403    .0433705    .2036941          0          1
  matwall_24 |     23,403    .0100842    .0999145          0          1
  matwall_25 |     23,403    .0001709    .0130727          0          1
-------------+---------------------------------------------------------
  matwall_26 |     23,403    .0014101    .0375253          0          1
  matwall_31 |     23,403    .0381148    .1914774          0          1
  matwall_32 |     23,403    .0352519    .1844198          0          1
  matwall_34 |     23,403    .0802461    .2716797          0          1
  matwall_35 |     23,403    .4072982    .4913417          0          1
-------------+---------------------------------------------------------
  matwall_36 |     23,403    .3362817    .4724467          0          1
  matwall_37 |     23,403    .0050848    .0711279          0          1
  matwall_38 |     23,403     .013118    .1137825          0          1
  matwall_96 |     23,403    .0014528    .0380888          0          1
       house |     23,403    .5659958     .495636          0          1
-------------+---------------------------------------------------------
        land |     23,403    .4363543    .4959433          0          1
   cowbull_1 |     23,403    .0928513    .2902302          0          1
   cowbull_2 |     23,403    .0103406    .1011636          0          1
   cowbull_3 |     23,403     .003162    .0561438          0          1
    buffal_1 |     23,403     .006324    .0792733          0          1
-------------+---------------------------------------------------------
    buffal_2 |     23,403    .0008546    .0292215          0          1
    buffal_3 |     23,403    .0002564    .0160101          0          1
     horse_1 |     23,403     .002521    .0501477          0          1
     horse_2 |     23,403    .0001282    .0113216          0          1
      goat_1 |     23,403    .0666581    .2494343          0          1
-------------+---------------------------------------------------------
      goat_2 |     23,403    .0218348    .1461471          0          1
      goat_3 |     23,403    .0073495    .0854153          0          1
       pig_1 |     23,403    .0775969    .2675419          0          1
       pig_2 |     23,403    .0070931    .0839232          0          1
       pig_3 |     23,403    .0024783     .049722          0          1
-------------+---------------------------------------------------------
   chicken_1 |     23,403    .2915865    .4545027          0          1
   chicken_2 |     23,403    .1624151     .368839          0          1
   chicken_3 |     23,403     .019912    .1397008          0          1
memsleep_i~r |     23,403    1.776528    1.289928          0         14
landarea_i~r |     23,403    .7598998    2.808709          0         95
-------------+---------------------------------------------------------
floorarea_~r |     23,403    73.00094     49.1628          0        995


. by hv025: mdesc $indicator memsleep_iurbrur landarea_iurbrur floorarea_iurbrur

----------------------------------------------------------------------------------------------------------------------------------
-> hv025 = urban

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
    drinkwat_11 |           0         24,560           0.00
    drinkwat_12 |           0         24,560           0.00
    drinkwat_13 |           0         24,560           0.00
    drinkwat_14 |           0         24,560           0.00
    drinkwat_21 |           0         24,560           0.00
    drinkwat_31 |           0         24,560           0.00
    drinkwat_32 |           0         24,560           0.00
    drinkwat_41 |           0         24,560           0.00
    drinkwat_42 |           0         24,560           0.00
    drinkwat_43 |           0         24,560           0.00
    drinkwat_51 |           0         24,560           0.00
    drinkwat_61 |           0         24,560           0.00
    drinkwat_62 |           0         24,560           0.00
    drinkwat_71 |           0         24,560           0.00
    drinkwat_72 |           0         24,560           0.00
    drinkwat_96 |           0         24,560           0.00
   toiletfac_11 |           0         24,560           0.00
   toiletfac_12 |           0         24,560           0.00
   toiletfac_21 |           0         24,560           0.00
   toiletfac_31 |           0         24,560           0.00
   toiletfac_32 |           0         24,560           0.00
   toiletfac_33 |           0         24,560           0.00
   toiletfac_41 |           0         24,560           0.00
   toiletfac_51 |           0         24,560           0.00
   toiletfac_96 |           0         24,560           0.00
     cookfuel_1 |           0         24,560           0.00
     cookfuel_2 |           0         24,560           0.00
     cookfuel_3 |           0         24,560           0.00
     cookfuel_4 |           0         24,560           0.00
     cookfuel_5 |           0         24,560           0.00
     cookfuel_6 |           0         24,560           0.00
     cookfuel_7 |           0         24,560           0.00
     cookfuel_8 |           0         24,560           0.00
     cookfuel_9 |           0         24,560           0.00
    cookfuel_96 |           0         24,560           0.00
    electricity |           0         24,560           0.00
          radio |           0         24,560           0.00
     television |           0         24,560           0.00
      telephone |           0         24,560           0.00
       computer |           0         24,560           0.00
   refrigerator |           0         24,560           0.00
            fan |           0         24,560           0.00
    washingmach |           0         24,560           0.00
        aircond |           0         24,560           0.00
          watch |           0         24,560           0.00
             hp |           0         24,560           0.00
         bcycle |           0         24,560           0.00
       motorcyc |           0         24,560           0.00
     animdrcart |           0         24,560           0.00
            car |           0         24,560           0.00
           boat |           0         24,560           0.00
         bankac |           0         24,560           0.00
    matfloor_11 |           0         24,560           0.00
    matfloor_21 |           0         24,560           0.00
    matfloor_22 |           0         24,560           0.00
    matfloor_31 |           0         24,560           0.00
    matfloor_32 |           0         24,560           0.00
    matfloor_33 |           0         24,560           0.00
    matfloor_34 |           0         24,560           0.00
    matfloor_35 |           0         24,560           0.00
    matfloor_36 |           0         24,560           0.00
    matfloor_96 |           0         24,560           0.00
     matroof_12 |           0         24,560           0.00
     matroof_13 |           0         24,560           0.00
     matroof_21 |           0         24,560           0.00
     matroof_22 |           0         24,560           0.00
     matroof_23 |           0         24,560           0.00
     matroof_31 |           0         24,560           0.00
     matroof_32 |           0         24,560           0.00
     matroof_33 |           0         24,560           0.00
     matroof_34 |           0         24,560           0.00
     matroof_35 |           0         24,560           0.00
     matroof_36 |           0         24,560           0.00
     matroof_96 |           0         24,560           0.00
     matwall_12 |           0         24,560           0.00
     matwall_21 |           0         24,560           0.00
     matwall_22 |           0         24,560           0.00
     matwall_23 |           0         24,560           0.00
     matwall_24 |           0         24,560           0.00
     matwall_25 |           0         24,560           0.00
     matwall_26 |           0         24,560           0.00
     matwall_31 |           0         24,560           0.00
     matwall_32 |           0         24,560           0.00
     matwall_34 |           0         24,560           0.00
     matwall_35 |           0         24,560           0.00
     matwall_36 |           0         24,560           0.00
     matwall_37 |           0         24,560           0.00
     matwall_38 |           0         24,560           0.00
     matwall_96 |           0         24,560           0.00
          house |           0         24,560           0.00
           land |           0         24,560           0.00
      cowbull_1 |           0         24,560           0.00
      cowbull_2 |           0         24,560           0.00
      cowbull_3 |           0         24,560           0.00
       buffal_1 |           0         24,560           0.00
       buffal_2 |           0         24,560           0.00
       buffal_3 |           0         24,560           0.00
        horse_1 |           0         24,560           0.00
        horse_2 |           0         24,560           0.00
         goat_1 |           0         24,560           0.00
         goat_2 |           0         24,560           0.00
         goat_3 |           0         24,560           0.00
          pig_1 |           0         24,560           0.00
          pig_2 |           0         24,560           0.00
          pig_3 |           0         24,560           0.00
      chicken_1 |           0         24,560           0.00
      chicken_2 |           0         24,560           0.00
      chicken_3 |           0         24,560           0.00
   memsleep_i~r |           0         24,560           0.00
   landarea_i~r |           0         24,560           0.00
   floorarea_~r |           0         24,560           0.00
----------------+-----------------------------------------------

----------------------------------------------------------------------------------------------------------------------------------
-> hv025 = rural

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
    drinkwat_11 |           0         23,403           0.00
    drinkwat_12 |           0         23,403           0.00
    drinkwat_13 |           0         23,403           0.00
    drinkwat_14 |           0         23,403           0.00
    drinkwat_21 |           0         23,403           0.00
    drinkwat_31 |           0         23,403           0.00
    drinkwat_32 |           0         23,403           0.00
    drinkwat_41 |           0         23,403           0.00
    drinkwat_42 |           0         23,403           0.00
    drinkwat_43 |           0         23,403           0.00
    drinkwat_51 |           0         23,403           0.00
    drinkwat_61 |           0         23,403           0.00
    drinkwat_62 |           0         23,403           0.00
    drinkwat_71 |           0         23,403           0.00
    drinkwat_72 |           0         23,403           0.00
    drinkwat_96 |           0         23,403           0.00
   toiletfac_11 |           0         23,403           0.00
   toiletfac_12 |           0         23,403           0.00
   toiletfac_21 |           0         23,403           0.00
   toiletfac_31 |           0         23,403           0.00
   toiletfac_32 |           0         23,403           0.00
   toiletfac_33 |           0         23,403           0.00
   toiletfac_41 |           0         23,403           0.00
   toiletfac_51 |           0         23,403           0.00
   toiletfac_96 |           0         23,403           0.00
     cookfuel_1 |           0         23,403           0.00
     cookfuel_2 |           0         23,403           0.00
     cookfuel_3 |           0         23,403           0.00
     cookfuel_4 |           0         23,403           0.00
     cookfuel_5 |           0         23,403           0.00
     cookfuel_6 |           0         23,403           0.00
     cookfuel_7 |           0         23,403           0.00
     cookfuel_8 |           0         23,403           0.00
     cookfuel_9 |           0         23,403           0.00
    cookfuel_96 |           0         23,403           0.00
    electricity |           0         23,403           0.00
          radio |           0         23,403           0.00
     television |           0         23,403           0.00
      telephone |           0         23,403           0.00
       computer |           0         23,403           0.00
   refrigerator |           0         23,403           0.00
            fan |           0         23,403           0.00
    washingmach |           0         23,403           0.00
        aircond |           0         23,403           0.00
          watch |           0         23,403           0.00
             hp |           0         23,403           0.00
         bcycle |           0         23,403           0.00
       motorcyc |           0         23,403           0.00
     animdrcart |           0         23,403           0.00
            car |           0         23,403           0.00
           boat |           0         23,403           0.00
         bankac |           0         23,403           0.00
    matfloor_11 |           0         23,403           0.00
    matfloor_21 |           0         23,403           0.00
    matfloor_22 |           0         23,403           0.00
    matfloor_31 |           0         23,403           0.00
    matfloor_32 |           0         23,403           0.00
    matfloor_33 |           0         23,403           0.00
    matfloor_34 |           0         23,403           0.00
    matfloor_35 |           0         23,403           0.00
    matfloor_36 |           0         23,403           0.00
    matfloor_96 |           0         23,403           0.00
     matroof_12 |           0         23,403           0.00
     matroof_13 |           0         23,403           0.00
     matroof_21 |           0         23,403           0.00
     matroof_22 |           0         23,403           0.00
     matroof_23 |           0         23,403           0.00
     matroof_31 |           0         23,403           0.00
     matroof_32 |           0         23,403           0.00
     matroof_33 |           0         23,403           0.00
     matroof_34 |           0         23,403           0.00
     matroof_35 |           0         23,403           0.00
     matroof_36 |           0         23,403           0.00
     matroof_96 |           0         23,403           0.00
     matwall_12 |           0         23,403           0.00
     matwall_21 |           0         23,403           0.00
     matwall_22 |           0         23,403           0.00
     matwall_23 |           0         23,403           0.00
     matwall_24 |           0         23,403           0.00
     matwall_25 |           0         23,403           0.00
     matwall_26 |           0         23,403           0.00
     matwall_31 |           0         23,403           0.00
     matwall_32 |           0         23,403           0.00
     matwall_34 |           0         23,403           0.00
     matwall_35 |           0         23,403           0.00
     matwall_36 |           0         23,403           0.00
     matwall_37 |           0         23,403           0.00
     matwall_38 |           0         23,403           0.00
     matwall_96 |           0         23,403           0.00
          house |           0         23,403           0.00
           land |           0         23,403           0.00
      cowbull_1 |           0         23,403           0.00
      cowbull_2 |           0         23,403           0.00
      cowbull_3 |           0         23,403           0.00
       buffal_1 |           0         23,403           0.00
       buffal_2 |           0         23,403           0.00
       buffal_3 |           0         23,403           0.00
        horse_1 |           0         23,403           0.00
        horse_2 |           0         23,403           0.00
         goat_1 |           0         23,403           0.00
         goat_2 |           0         23,403           0.00
         goat_3 |           0         23,403           0.00
          pig_1 |           0         23,403           0.00
          pig_2 |           0         23,403           0.00
          pig_3 |           0         23,403           0.00
      chicken_1 |           0         23,403           0.00
      chicken_2 |           0         23,403           0.00
      chicken_3 |           0         23,403           0.00
   memsleep_i~r |           0         23,403           0.00
   landarea_i~r |           0         23,403           0.00
   floorarea_~r |           0         23,403           0.00
----------------+-----------------------------------------------

. 
. /*
> ------------------------------------------------------------------
> Skor - Faktor PCA                                                                                       [done]
> ------------------------------------------------------------------
> */
. 
. *\factor pc
. factor $indicator memsleep_iurbrur landarea_iurbrur floorarea_iurbrur           ///
>                 if hv025 == 1, factors(1) pcf
(obs=24,560)

Factor analysis/correlation                      Number of obs    =     24,560
    Method: principal-component factors          Retained factors =          1
    Rotation: (unrotated)                        Number of params =        111

    
Warning: Solution is a Heywood case; that is, invalid or boundary values of uniqueness.

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      6.08776      2.96473            0.0548       0.0548
        Factor2  |      3.12302      0.91953            0.0281       0.0830
        Factor3  |      2.20349      0.13016            0.0199       0.1028
        Factor4  |      2.07334      0.23762            0.0187       0.1215
        Factor5  |      1.83572      0.21985            0.0165       0.1380
        Factor6  |      1.61587      0.05993            0.0146       0.1526
        Factor7  |      1.55594      0.13220            0.0140       0.1666
        Factor8  |      1.42375      0.06130            0.0128       0.1794
        Factor9  |      1.36245      0.02322            0.0123       0.1917
       Factor10  |      1.33923      0.04501            0.0121       0.2038
       Factor11  |      1.29422      0.05041            0.0117       0.2154
       Factor12  |      1.24381      0.00730            0.0112       0.2267
       Factor13  |      1.23651      0.00529            0.0111       0.2378
       Factor14  |      1.23122      0.02102            0.0111       0.2489
       Factor15  |      1.21020      0.01666            0.0109       0.2598
       Factor16  |      1.19354      0.01912            0.0108       0.2705
       Factor17  |      1.17442      0.01562            0.0106       0.2811
       Factor18  |      1.15879      0.01725            0.0104       0.2916
       Factor19  |      1.14154      0.00500            0.0103       0.3018
       Factor20  |      1.13654      0.00771            0.0102       0.3121
       Factor21  |      1.12882      0.00238            0.0102       0.3223
       Factor22  |      1.12645      0.00863            0.0101       0.3324
       Factor23  |      1.11782      0.00159            0.0101       0.3425
       Factor24  |      1.11623      0.00549            0.0101       0.3525
       Factor25  |      1.11073      0.00606            0.0100       0.3625
       Factor26  |      1.10467      0.01226            0.0100       0.3725
       Factor27  |      1.09241      0.00411            0.0098       0.3823
       Factor28  |      1.08830      0.00475            0.0098       0.3921
       Factor29  |      1.08354      0.00501            0.0098       0.4019
       Factor30  |      1.07853      0.01140            0.0097       0.4116
       Factor31  |      1.06713      0.00513            0.0096       0.4212
       Factor32  |      1.06200      0.00561            0.0096       0.4308
       Factor33  |      1.05640      0.00206            0.0095       0.4403
       Factor34  |      1.05434      0.00669            0.0095       0.4498
       Factor35  |      1.04765      0.00312            0.0094       0.4592
       Factor36  |      1.04453      0.00601            0.0094       0.4687
       Factor37  |      1.03852      0.00136            0.0094       0.4780
       Factor38  |      1.03717      0.00696            0.0093       0.4874
       Factor39  |      1.03021      0.00753            0.0093       0.4966
       Factor40  |      1.02268      0.00134            0.0092       0.5059
       Factor41  |      1.02134      0.00490            0.0092       0.5151
       Factor42  |      1.01644      0.00157            0.0092       0.5242
       Factor43  |      1.01487      0.00606            0.0091       0.5334
       Factor44  |      1.00881      0.00034            0.0091       0.5424
       Factor45  |      1.00846      0.00314            0.0091       0.5515
       Factor46  |      1.00532      0.00265            0.0091       0.5606
       Factor47  |      1.00267      0.00197            0.0090       0.5696
       Factor48  |      1.00069      0.00128            0.0090       0.5786
       Factor49  |      0.99941      0.00261            0.0090       0.5876
       Factor50  |      0.99680      0.00166            0.0090       0.5966
       Factor51  |      0.99514      0.00473            0.0090       0.6056
       Factor52  |      0.99041      0.00409            0.0089       0.6145
       Factor53  |      0.98632      0.00174            0.0089       0.6234
       Factor54  |      0.98457      0.00269            0.0089       0.6323
       Factor55  |      0.98189      0.00284            0.0088       0.6411
       Factor56  |      0.97905      0.00689            0.0088       0.6499
       Factor57  |      0.97216      0.00252            0.0088       0.6587
       Factor58  |      0.96964      0.00383            0.0087       0.6674
       Factor59  |      0.96580      0.00192            0.0087       0.6761
       Factor60  |      0.96388      0.00541            0.0087       0.6848
       Factor61  |      0.95847      0.00325            0.0086       0.6934
       Factor62  |      0.95522      0.00839            0.0086       0.7020
       Factor63  |      0.94683      0.00366            0.0085       0.7106
       Factor64  |      0.94318      0.00171            0.0085       0.7191
       Factor65  |      0.94147      0.00730            0.0085       0.7276
       Factor66  |      0.93417      0.00344            0.0084       0.7360
       Factor67  |      0.93073      0.00193            0.0084       0.7444
       Factor68  |      0.92880      0.00513            0.0084       0.7527
       Factor69  |      0.92367      0.00190            0.0083       0.7610
       Factor70  |      0.92177      0.01093            0.0083       0.7693
       Factor71  |      0.91084      0.00310            0.0082       0.7776
       Factor72  |      0.90775      0.00104            0.0082       0.7857
       Factor73  |      0.90671      0.00835            0.0082       0.7939
       Factor74  |      0.89836      0.01015            0.0081       0.8020
       Factor75  |      0.88822      0.00146            0.0080       0.8100
       Factor76  |      0.88675      0.01416            0.0080       0.8180
       Factor77  |      0.87259      0.00695            0.0079       0.8258
       Factor78  |      0.86564      0.00522            0.0078       0.8336
       Factor79  |      0.86042      0.00482            0.0078       0.8414
       Factor80  |      0.85560      0.00962            0.0077       0.8491
       Factor81  |      0.84598      0.00692            0.0076       0.8567
       Factor82  |      0.83906      0.00798            0.0076       0.8643
       Factor83  |      0.83108      0.01132            0.0075       0.8718
       Factor84  |      0.81976      0.01907            0.0074       0.8792
       Factor85  |      0.80069      0.00815            0.0072       0.8864
       Factor86  |      0.79254      0.01499            0.0071       0.8935
       Factor87  |      0.77755      0.01245            0.0070       0.9005
       Factor88  |      0.76510      0.03069            0.0069       0.9074
       Factor89  |      0.73441      0.01933            0.0066       0.9140
       Factor90  |      0.71508      0.00875            0.0064       0.9205
       Factor91  |      0.70633      0.00697            0.0064       0.9268
       Factor92  |      0.69936      0.01621            0.0063       0.9331
       Factor93  |      0.68315      0.01235            0.0062       0.9393
       Factor94  |      0.67080      0.00665            0.0060       0.9453
       Factor95  |      0.66415      0.02926            0.0060       0.9513
       Factor96  |      0.63489      0.02966            0.0057       0.9570
       Factor97  |      0.60524      0.00909            0.0055       0.9625
       Factor98  |      0.59615      0.00266            0.0054       0.9679
       Factor99  |      0.59349      0.01950            0.0053       0.9732
      Factor100  |      0.57399      0.03898            0.0052       0.9784
      Factor101  |      0.53501      0.02220            0.0048       0.9832
      Factor102  |      0.51282      0.02242            0.0046       0.9878
      Factor103  |      0.49039      0.02635            0.0044       0.9922
      Factor104  |      0.46404      0.07093            0.0042       0.9964
      Factor105  |      0.39311      0.38998            0.0035       1.0000
      Factor106  |      0.00314      0.00241            0.0000       1.0000
      Factor107  |      0.00073      0.00004            0.0000       1.0000
      Factor108  |      0.00068      0.00014            0.0000       1.0000
      Factor109  |      0.00055      0.00021            0.0000       1.0000
      Factor110  |      0.00034      0.00034            0.0000       1.0000
      Factor111  |     -0.00000            .           -0.0000       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated: chi2(6105)=       . Prob>chi2 =      .

Factor loadings (pattern matrix) and unique variances

    ---------------------------------------
        Variable |  Factor1 |   Uniqueness 
    -------------+----------+--------------
     drinkwat_11 |   0.0280 |      0.9992  
     drinkwat_12 |  -0.0603 |      0.9964  
     drinkwat_13 |  -0.1449 |      0.9790  
     drinkwat_14 |  -0.0260 |      0.9993  
     drinkwat_21 |   0.0109 |      0.9999  
     drinkwat_31 |  -0.1762 |      0.9690  
     drinkwat_32 |  -0.1556 |      0.9758  
     drinkwat_41 |  -0.1316 |      0.9827  
     drinkwat_42 |  -0.1035 |      0.9893  
     drinkwat_43 |  -0.0853 |      0.9927  
     drinkwat_51 |  -0.0564 |      0.9968  
     drinkwat_61 |  -0.0530 |      0.9972  
     drinkwat_62 |   0.0034 |      1.0000  
     drinkwat_71 |   0.3435 |      0.8820  
     drinkwat_72 |   0.0133 |      0.9998  
     drinkwat_96 |  -0.0023 |      1.0000  
    toiletfac_11 |   0.5140 |      0.7358  
    toiletfac_12 |  -0.1549 |      0.9760  
    toiletfac_21 |  -0.3421 |      0.8830  
    toiletfac_31 |  -0.2343 |      0.9451  
    toiletfac_32 |  -0.1006 |      0.9899  
    toiletfac_33 |  -0.0640 |      0.9959  
    toiletfac_41 |  -0.1576 |      0.9752  
    toiletfac_51 |  -0.1425 |      0.9797  
    toiletfac_96 |  -0.0320 |      0.9990  
      cookfuel_1 |  -0.0474 |      0.9977  
      cookfuel_2 |   0.4708 |      0.7784  
      cookfuel_3 |   0.0341 |      0.9988  
      cookfuel_4 |   0.0090 |      0.9999  
      cookfuel_5 |  -0.1791 |      0.9679  
      cookfuel_6 |  -0.0124 |      0.9998  
      cookfuel_7 |  -0.0360 |      0.9987  
      cookfuel_8 |  -0.4611 |      0.7874  
      cookfuel_9 |   0.0027 |      1.0000  
     cookfuel_96 |  -0.1106 |      0.9878  
     electricity |   0.1714 |      0.9706  
           radio |   0.2248 |      0.9495  
      television |   0.4110 |      0.8311  
       telephone |   0.3223 |      0.8961  
        computer |   0.5441 |      0.7040  
    refrigerator |   0.6330 |      0.5993  
             fan |   0.4926 |      0.7574  
     washingmach |   0.5988 |      0.6415  
         aircond |   0.5200 |      0.7297  
           watch |   0.5016 |      0.7484  
              hp |   0.3741 |      0.8601  
          bcycle |   0.3144 |      0.9012  
        motorcyc |   0.4535 |      0.7943  
      animdrcart |   0.0098 |      0.9999  
             car |   0.5194 |      0.7302  
            boat |  -0.0162 |      0.9997  
          bankac |   0.5483 |      0.6994  
     matfloor_11 |  -0.2149 |      0.9538  
     matfloor_21 |  -0.2543 |      0.9353  
     matfloor_22 |  -0.0881 |      0.9922  
     matfloor_31 |  -0.0169 |      0.9997  
     matfloor_32 |   0.0022 |      1.0000  
     matfloor_33 |   0.6114 |      0.6262  
     matfloor_34 |  -0.0498 |      0.9975  
     matfloor_35 |  -0.4362 |      0.8097  
     matfloor_36 |  -0.0448 |      0.9980  
     matfloor_96 |  -0.0140 |      0.9998  
      matroof_12 |  -0.1461 |      0.9787  
      matroof_13 |  -0.0119 |      0.9999  
      matroof_21 |  -0.0436 |      0.9981  
      matroof_22 |  -0.0213 |      0.9995  
      matroof_23 |  -0.0246 |      0.9994  
      matroof_31 |  -0.2204 |      0.9514  
      matroof_32 |   0.0305 |      0.9991  
      matroof_33 |   0.1471 |      0.9784  
      matroof_34 |   0.0834 |      0.9930  
      matroof_35 |   0.1710 |      0.9708  
      matroof_36 |  -0.0203 |      0.9996  
      matroof_96 |   0.0152 |      0.9998  
      matwall_12 |  -0.1087 |      0.9882  
      matwall_21 |  -0.0667 |      0.9956  
      matwall_22 |  -0.0092 |      0.9999  
      matwall_23 |  -0.1403 |      0.9803  
      matwall_24 |  -0.0950 |      0.9910  
      matwall_25 |  -0.0079 |      0.9999  
      matwall_26 |  -0.0662 |      0.9956  
      matwall_31 |  -0.2229 |      0.9503  
      matwall_32 |  -0.0331 |      0.9989  
      matwall_34 |  -0.0270 |      0.9993  
      matwall_35 |   0.4465 |      0.8007  
      matwall_36 |  -0.3412 |      0.8836  
      matwall_37 |  -0.0168 |      0.9997  
      matwall_38 |  -0.1076 |      0.9884  
      matwall_96 |  -0.0147 |      0.9998  
           house |   0.2194 |      0.9519  
            land |   0.1919 |      0.9632  
       cowbull_1 |  -0.0681 |      0.9954  
       cowbull_2 |  -0.0217 |      0.9995  
       cowbull_3 |   0.0111 |      0.9999  
        buffal_1 |  -0.0077 |      0.9999  
        buffal_2 |   0.0148 |      0.9998  
        buffal_3 |   0.0123 |      0.9998  
         horse_1 |  -0.0186 |      0.9997  
         horse_2 |   0.0001 |      1.0000  
          goat_1 |  -0.1134 |      0.9871  
          goat_2 |  -0.0520 |      0.9973  
          goat_3 |  -0.0083 |      0.9999  
           pig_1 |  -0.0986 |      0.9903  
           pig_2 |  -0.0134 |      0.9998  
           pig_3 |  -0.0060 |      1.0000  
       chicken_1 |  -0.1373 |      0.9812  
       chicken_2 |  -0.0378 |      0.9986  
       chicken_3 |   0.0317 |      0.9990  
    memsleep_i~r |  -0.2288 |      0.9476  
    landarea_i~r |   0.0339 |      0.9989  
    floorarea_~r |   0.4634 |      0.7853  
    ---------------------------------------

. predict wi_complete_urb if hv025 == 1
(option regression assumed; regression scoring)

Scoring coefficients (method = regression)

    ------------------------
        Variable |  Factor1 
    -------------+----------
     drinkwat_11 |  0.00311 
     drinkwat_12 | -0.01049 
     drinkwat_13 | -0.02426 
     drinkwat_14 | -0.00460 
     drinkwat_21 |  0.00028 
     drinkwat_31 | -0.03037 
     drinkwat_32 | -0.02622 
     drinkwat_41 | -0.02240 
     drinkwat_42 | -0.01734 
     drinkwat_43 | -0.01424 
     drinkwat_51 | -0.00976 
     drinkwat_61 | -0.00897 
     drinkwat_62 |  0.00018 
     drinkwat_71 |  0.05475 
     drinkwat_72 |  0.00000 
     drinkwat_96 | -0.00042 
    toiletfac_11 |  0.08443 
    toiletfac_12 | -0.02545 
    toiletfac_21 | -0.05619 
    toiletfac_31 | -0.03848 
    toiletfac_32 | -0.01653 
    toiletfac_33 | -0.01051 
    toiletfac_41 | -0.02589 
    toiletfac_51 | -0.02340 
    toiletfac_96 | -0.00526 
      cookfuel_1 | -0.00779 
      cookfuel_2 |  0.07733 
      cookfuel_3 |  0.00561 
      cookfuel_4 |  0.00147 
      cookfuel_5 | -0.02942 
      cookfuel_6 | -0.00204 
      cookfuel_7 | -0.00592 
      cookfuel_8 | -0.07574 
      cookfuel_9 |  0.00044 
     cookfuel_96 | -0.01816 
     electricity |  0.02816 
           radio |  0.03692 
      television |  0.06751 
       telephone |  0.05294 
        computer |  0.08937 
    refrigerator |  0.10398 
             fan |  0.08092 
     washingmach |  0.09836 
         aircond |  0.08541 
           watch |  0.08239 
              hp |  0.06145 
          bcycle |  0.05164 
        motorcyc |  0.07450 
      animdrcart |  0.00161 
             car |  0.08532 
            boat | -0.00267 
          bankac |  0.09007 
     matfloor_11 | -0.03531 
     matfloor_21 | -0.04177 
     matfloor_22 | -0.01446 
     matfloor_31 | -0.00277 
     matfloor_32 |  0.00037 
     matfloor_33 |  0.10043 
     matfloor_34 | -0.00818 
     matfloor_35 | -0.07165 
     matfloor_36 | -0.00735 
     matfloor_96 | -0.00231 
      matroof_12 | -0.02400 
      matroof_13 | -0.00196 
      matroof_21 | -0.00716 
      matroof_22 | -0.00350 
      matroof_23 | -0.00403 
      matroof_31 | -0.03620 
      matroof_32 |  0.00500 
      matroof_33 |  0.02417 
      matroof_34 |  0.01370 
      matroof_35 |  0.02808 
      matroof_36 | -0.00333 
      matroof_96 |  0.00249 
      matwall_12 | -0.01786 
      matwall_21 | -0.01096 
      matwall_22 | -0.00151 
      matwall_23 | -0.02304 
      matwall_24 | -0.01561 
      matwall_25 | -0.00131 
      matwall_26 | -0.01088 
      matwall_31 | -0.03661 
      matwall_32 | -0.00543 
      matwall_34 | -0.00444 
      matwall_35 |  0.07334 
      matwall_36 | -0.05605 
      matwall_37 | -0.00275 
      matwall_38 | -0.01767 
      matwall_96 | -0.00242 
           house |  0.03604 
            land |  0.03152 
       cowbull_1 | -0.01119 
       cowbull_2 | -0.00357 
       cowbull_3 |  0.00182 
        buffal_1 | -0.00127 
        buffal_2 |  0.00243 
        buffal_3 |  0.00202 
         horse_1 | -0.00306 
         horse_2 |  0.00001 
          goat_1 | -0.01863 
          goat_2 | -0.00853 
          goat_3 | -0.00136 
           pig_1 | -0.01620 
           pig_2 | -0.00221 
           pig_3 | -0.00098 
       chicken_1 | -0.02255 
       chicken_2 | -0.00622 
       chicken_3 |  0.00521 
    memsleep_i~r | -0.03759 
    landarea_i~r |  0.00556 
    floorarea_~r |  0.07612 
    ------------------------


. 
. factor $indicator memsleep_iurbrur landarea_iurbrur floorarea_iurbrur           ///
>                 if hv025 == 2, factors(1) pcf
(obs=23,403)

Factor analysis/correlation                      Number of obs    =     23,403
    Method: principal-component factors          Retained factors =          1
    Rotation: (unrotated)                        Number of params =        111

    
Warning: Solution is a Heywood case; that is, invalid or boundary values of uniqueness.

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      6.62856      3.63743            0.0597       0.0597
        Factor2  |      2.99113      0.77124            0.0269       0.0867
        Factor3  |      2.21989      0.19034            0.0200       0.1067
        Factor4  |      2.02954      0.23892            0.0183       0.1249
        Factor5  |      1.79063      0.16558            0.0161       0.1411
        Factor6  |      1.62505      0.14162            0.0146       0.1557
        Factor7  |      1.48342      0.04047            0.0134       0.1691
        Factor8  |      1.44295      0.04142            0.0130       0.1821
        Factor9  |      1.40153      0.06297            0.0126       0.1947
       Factor10  |      1.33856      0.01095            0.0121       0.2068
       Factor11  |      1.32762      0.04937            0.0120       0.2187
       Factor12  |      1.27825      0.02247            0.0115       0.2302
       Factor13  |      1.25578      0.00536            0.0113       0.2416
       Factor14  |      1.25042      0.03109            0.0113       0.2528
       Factor15  |      1.21933      0.01806            0.0110       0.2638
       Factor16  |      1.20127      0.00894            0.0108       0.2746
       Factor17  |      1.19233      0.01211            0.0107       0.2854
       Factor18  |      1.18022      0.01045            0.0106       0.2960
       Factor19  |      1.16977      0.02579            0.0105       0.3065
       Factor20  |      1.14398      0.00709            0.0103       0.3168
       Factor21  |      1.13689      0.00394            0.0102       0.3271
       Factor22  |      1.13295      0.01806            0.0102       0.3373
       Factor23  |      1.11490      0.00280            0.0100       0.3473
       Factor24  |      1.11209      0.01036            0.0100       0.3574
       Factor25  |      1.10173      0.00186            0.0099       0.3673
       Factor26  |      1.09987      0.00456            0.0099       0.3772
       Factor27  |      1.09530      0.01082            0.0099       0.3871
       Factor28  |      1.08449      0.00352            0.0098       0.3968
       Factor29  |      1.08097      0.00805            0.0097       0.4066
       Factor30  |      1.07292      0.00541            0.0097       0.4162
       Factor31  |      1.06751      0.00371            0.0096       0.4259
       Factor32  |      1.06381      0.00269            0.0096       0.4354
       Factor33  |      1.06111      0.00792            0.0096       0.4450
       Factor34  |      1.05319      0.00498            0.0095       0.4545
       Factor35  |      1.04821      0.00121            0.0094       0.4639
       Factor36  |      1.04701      0.00647            0.0094       0.4734
       Factor37  |      1.04053      0.00377            0.0094       0.4827
       Factor38  |      1.03677      0.00296            0.0093       0.4921
       Factor39  |      1.03381      0.00143            0.0093       0.5014
       Factor40  |      1.03237      0.00642            0.0093       0.5107
       Factor41  |      1.02596      0.00342            0.0092       0.5199
       Factor42  |      1.02254      0.00073            0.0092       0.5291
       Factor43  |      1.02181      0.00358            0.0092       0.5384
       Factor44  |      1.01823      0.00303            0.0092       0.5475
       Factor45  |      1.01521      0.00336            0.0091       0.5567
       Factor46  |      1.01185      0.00245            0.0091       0.5658
       Factor47  |      1.00939      0.00667            0.0091       0.5749
       Factor48  |      1.00273      0.00182            0.0090       0.5839
       Factor49  |      1.00090      0.00122            0.0090       0.5929
       Factor50  |      0.99968      0.00243            0.0090       0.6019
       Factor51  |      0.99725      0.00434            0.0090       0.6109
       Factor52  |      0.99291      0.00845            0.0089       0.6199
       Factor53  |      0.98447      0.00143            0.0089       0.6287
       Factor54  |      0.98304      0.00634            0.0089       0.6376
       Factor55  |      0.97670      0.00133            0.0088       0.6464
       Factor56  |      0.97537      0.00454            0.0088       0.6552
       Factor57  |      0.97083      0.00444            0.0087       0.6639
       Factor58  |      0.96639      0.00237            0.0087       0.6726
       Factor59  |      0.96402      0.00411            0.0087       0.6813
       Factor60  |      0.95990      0.00302            0.0086       0.6900
       Factor61  |      0.95689      0.00485            0.0086       0.6986
       Factor62  |      0.95204      0.00439            0.0086       0.7072
       Factor63  |      0.94765      0.00446            0.0085       0.7157
       Factor64  |      0.94319      0.00570            0.0085       0.7242
       Factor65  |      0.93749      0.00732            0.0084       0.7326
       Factor66  |      0.93018      0.00171            0.0084       0.7410
       Factor67  |      0.92847      0.00347            0.0084       0.7494
       Factor68  |      0.92499      0.00389            0.0083       0.7577
       Factor69  |      0.92111      0.00672            0.0083       0.7660
       Factor70  |      0.91439      0.00987            0.0082       0.7743
       Factor71  |      0.90452      0.00297            0.0081       0.7824
       Factor72  |      0.90155      0.01176            0.0081       0.7905
       Factor73  |      0.88979      0.00766            0.0080       0.7985
       Factor74  |      0.88213      0.00894            0.0079       0.8065
       Factor75  |      0.87319      0.00161            0.0079       0.8144
       Factor76  |      0.87159      0.00711            0.0079       0.8222
       Factor77  |      0.86448      0.01604            0.0078       0.8300
       Factor78  |      0.84844      0.00936            0.0076       0.8376
       Factor79  |      0.83908      0.00214            0.0076       0.8452
       Factor80  |      0.83694      0.02163            0.0075       0.8527
       Factor81  |      0.81531      0.00252            0.0073       0.8601
       Factor82  |      0.81279      0.00992            0.0073       0.8674
       Factor83  |      0.80287      0.00654            0.0072       0.8746
       Factor84  |      0.79633      0.00543            0.0072       0.8818
       Factor85  |      0.79091      0.00400            0.0071       0.8889
       Factor86  |      0.78691      0.02560            0.0071       0.8960
       Factor87  |      0.76131      0.01824            0.0069       0.9029
       Factor88  |      0.74307      0.01773            0.0067       0.9096
       Factor89  |      0.72534      0.01420            0.0065       0.9161
       Factor90  |      0.71114      0.00900            0.0064       0.9225
       Factor91  |      0.70214      0.00684            0.0063       0.9288
       Factor92  |      0.69531      0.01556            0.0063       0.9351
       Factor93  |      0.67975      0.01758            0.0061       0.9412
       Factor94  |      0.66217      0.02701            0.0060       0.9472
       Factor95  |      0.63517      0.00503            0.0057       0.9529
       Factor96  |      0.63013      0.02812            0.0057       0.9586
       Factor97  |      0.60201      0.01471            0.0054       0.9640
       Factor98  |      0.58730      0.02279            0.0053       0.9693
       Factor99  |      0.56450      0.01052            0.0051       0.9744
      Factor100  |      0.55399      0.01916            0.0050       0.9794
      Factor101  |      0.53483      0.03521            0.0048       0.9842
      Factor102  |      0.49962      0.04362            0.0045       0.9887
      Factor103  |      0.45599      0.02310            0.0041       0.9928
      Factor104  |      0.43289      0.07168            0.0039       0.9967
      Factor105  |      0.36121      0.35923            0.0033       1.0000
      Factor106  |      0.00198      0.00162            0.0000       1.0000
      Factor107  |      0.00036      0.00006            0.0000       1.0000
      Factor108  |      0.00030      0.00007            0.0000       1.0000
      Factor109  |      0.00023      0.00010            0.0000       1.0000
      Factor110  |      0.00013      0.00007            0.0000       1.0000
      Factor111  |      0.00006            .            0.0000       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated: chi2(6105)= 1.2e+06 Prob>chi2 = 0.0000

Factor loadings (pattern matrix) and unique variances

    ---------------------------------------
        Variable |  Factor1 |   Uniqueness 
    -------------+----------+--------------
     drinkwat_11 |   0.0920 |      0.9915  
     drinkwat_12 |  -0.0008 |      1.0000  
     drinkwat_13 |  -0.0298 |      0.9991  
     drinkwat_14 |  -0.0177 |      0.9997  
     drinkwat_21 |   0.1276 |      0.9837  
     drinkwat_31 |   0.0061 |      1.0000  
     drinkwat_32 |  -0.1415 |      0.9800  
     drinkwat_41 |  -0.1733 |      0.9700  
     drinkwat_42 |  -0.2124 |      0.9549  
     drinkwat_43 |  -0.1867 |      0.9651  
     drinkwat_51 |  -0.0759 |      0.9942  
     drinkwat_61 |  -0.0475 |      0.9977  
     drinkwat_62 |   0.0285 |      0.9992  
     drinkwat_71 |   0.2225 |      0.9505  
     drinkwat_72 |   0.2919 |      0.9148  
     drinkwat_96 |   0.0210 |      0.9996  
    toiletfac_11 |   0.5715 |      0.6734  
    toiletfac_12 |  -0.0501 |      0.9975  
    toiletfac_21 |  -0.2502 |      0.9374  
    toiletfac_31 |  -0.2284 |      0.9479  
    toiletfac_32 |  -0.0938 |      0.9912  
    toiletfac_33 |  -0.0229 |      0.9995  
    toiletfac_41 |  -0.2286 |      0.9478  
    toiletfac_51 |  -0.2821 |      0.9204  
    toiletfac_96 |  -0.0200 |      0.9996  
      cookfuel_1 |   0.0190 |      0.9996  
      cookfuel_2 |   0.6053 |      0.6337  
      cookfuel_3 |   0.0246 |      0.9994  
      cookfuel_4 |  -0.0018 |      1.0000  
      cookfuel_5 |   0.0929 |      0.9914  
      cookfuel_6 |  -0.0082 |      0.9999  
      cookfuel_7 |  -0.0172 |      0.9997  
      cookfuel_8 |  -0.6521 |      0.5747  
      cookfuel_9 |  -0.0273 |      0.9993  
     cookfuel_96 |  -0.0272 |      0.9993  
     electricity |   0.4024 |      0.8380  
           radio |   0.1908 |      0.9636  
      television |   0.6154 |      0.6213  
       telephone |   0.0608 |      0.9963  
        computer |   0.4426 |      0.8041  
    refrigerator |   0.6762 |      0.5427  
             fan |   0.6153 |      0.6214  
     washingmach |   0.5477 |      0.7000  
         aircond |   0.2499 |      0.9376  
           watch |   0.4531 |      0.7947  
              hp |   0.4481 |      0.7992  
          bcycle |   0.3676 |      0.8649  
        motorcyc |   0.5639 |      0.6821  
      animdrcart |   0.0078 |      0.9999  
             car |   0.4041 |      0.8367  
            boat |  -0.0289 |      0.9992  
          bankac |   0.4883 |      0.7615  
     matfloor_11 |  -0.2723 |      0.9258  
     matfloor_21 |  -0.2445 |      0.9402  
     matfloor_22 |  -0.1833 |      0.9664  
     matfloor_31 |   0.0008 |      1.0000  
     matfloor_32 |  -0.0003 |      1.0000  
     matfloor_33 |   0.5575 |      0.6892  
     matfloor_34 |   0.0564 |      0.9968  
     matfloor_35 |  -0.1575 |      0.9752  
     matfloor_36 |  -0.0039 |      1.0000  
     matfloor_96 |  -0.0260 |      0.9993  
      matroof_12 |  -0.2410 |      0.9419  
      matroof_13 |  -0.1697 |      0.9712  
      matroof_21 |  -0.0114 |      0.9999  
      matroof_22 |  -0.0281 |      0.9992  
      matroof_23 |  -0.0280 |      0.9992  
      matroof_31 |  -0.1883 |      0.9645  
      matroof_32 |   0.0011 |      1.0000  
      matroof_33 |   0.2787 |      0.9223  
      matroof_34 |   0.0658 |      0.9957  
      matroof_35 |   0.1334 |      0.9822  
      matroof_36 |  -0.0191 |      0.9996  
      matroof_96 |  -0.0162 |      0.9997  
      matwall_12 |  -0.2217 |      0.9509  
      matwall_21 |  -0.0551 |      0.9970  
      matwall_22 |  -0.0034 |      1.0000  
      matwall_23 |  -0.0424 |      0.9982  
      matwall_24 |  -0.0551 |      0.9970  
      matwall_25 |  -0.0015 |      1.0000  
      matwall_26 |  -0.0297 |      0.9991  
      matwall_31 |  -0.1741 |      0.9697  
      matwall_32 |  -0.0201 |      0.9996  
      matwall_34 |   0.0062 |      1.0000  
      matwall_35 |   0.5330 |      0.7160  
      matwall_36 |  -0.3608 |      0.8698  
      matwall_37 |   0.0188 |      0.9996  
      matwall_38 |  -0.0367 |      0.9987  
      matwall_96 |  -0.0335 |      0.9989  
           house |   0.1336 |      0.9821  
            land |   0.0932 |      0.9913  
       cowbull_1 |   0.0115 |      0.9999  
       cowbull_2 |   0.0289 |      0.9992  
       cowbull_3 |   0.0567 |      0.9968  
        buffal_1 |  -0.0406 |      0.9983  
        buffal_2 |   0.0026 |      1.0000  
        buffal_3 |   0.0104 |      0.9999  
         horse_1 |  -0.0350 |      0.9988  
         horse_2 |  -0.0045 |      1.0000  
          goat_1 |  -0.0536 |      0.9971  
          goat_2 |   0.0238 |      0.9994  
          goat_3 |   0.0357 |      0.9987  
           pig_1 |  -0.3042 |      0.9075  
           pig_2 |  -0.0535 |      0.9971  
           pig_3 |  -0.0101 |      0.9999  
       chicken_1 |  -0.1448 |      0.9790  
       chicken_2 |   0.0898 |      0.9919  
       chicken_3 |   0.1040 |      0.9892  
    memsleep_i~r |  -0.2812 |      0.9209  
    landarea_i~r |   0.0472 |      0.9978  
    floorarea_~r |   0.4592 |      0.7891  
    ---------------------------------------

. predict wi_complete_rur if hv025 == 2
(option regression assumed; regression scoring)

Scoring coefficients (method = regression)

    ------------------------
        Variable |  Factor1 
    -------------+----------
     drinkwat_11 |  0.01388 
     drinkwat_12 | -0.00012 
     drinkwat_13 | -0.00449 
     drinkwat_14 | -0.00267 
     drinkwat_21 |  0.01924 
     drinkwat_31 |  0.00091 
     drinkwat_32 | -0.02135 
     drinkwat_41 | -0.02615 
     drinkwat_42 | -0.03205 
     drinkwat_43 | -0.02817 
     drinkwat_51 | -0.01145 
     drinkwat_61 | -0.00716 
     drinkwat_62 |  0.00430 
     drinkwat_71 |  0.03357 
     drinkwat_72 |  0.04404 
     drinkwat_96 |  0.00317 
    toiletfac_11 |  0.08622 
    toiletfac_12 | -0.00756 
    toiletfac_21 | -0.03775 
    toiletfac_31 | -0.03445 
    toiletfac_32 | -0.01415 
    toiletfac_33 | -0.00346 
    toiletfac_41 | -0.03448 
    toiletfac_51 | -0.04256 
    toiletfac_96 | -0.00301 
      cookfuel_1 |  0.00287 
      cookfuel_2 |  0.09131 
      cookfuel_3 |  0.00371 
      cookfuel_4 | -0.00028 
      cookfuel_5 |  0.01402 
      cookfuel_6 | -0.00124 
      cookfuel_7 | -0.00260 
      cookfuel_8 | -0.09838 
      cookfuel_9 | -0.00411 
     cookfuel_96 | -0.00410 
     electricity |  0.06071 
           radio |  0.02878 
      television |  0.09284 
       telephone |  0.00917 
        computer |  0.06677 
    refrigerator |  0.10202 
             fan |  0.09283 
     washingmach |  0.08263 
         aircond |  0.03770 
           watch |  0.06835 
              hp |  0.06760 
          bcycle |  0.05546 
        motorcyc |  0.08507 
      animdrcart |  0.00117 
             car |  0.06096 
            boat | -0.00436 
          bankac |  0.07367 
     matfloor_11 | -0.04108 
     matfloor_21 | -0.03688 
     matfloor_22 | -0.02766 
     matfloor_31 |  0.00013 
     matfloor_32 | -0.00005 
     matfloor_33 |  0.08411 
     matfloor_34 |  0.00852 
     matfloor_35 | -0.02375 
     matfloor_36 | -0.00060 
     matfloor_96 | -0.00392 
      matroof_12 | -0.03635 
      matroof_13 | -0.02560 
      matroof_21 | -0.00171 
      matroof_22 | -0.00424 
      matroof_23 | -0.00423 
      matroof_31 | -0.02841 
      matroof_32 |  0.00016 
      matroof_33 |  0.04205 
      matroof_34 |  0.00993 
      matroof_35 |  0.02013 
      matroof_36 | -0.00289 
      matroof_96 | -0.00244 
      matwall_12 | -0.03344 
      matwall_21 | -0.00831 
      matwall_22 | -0.00052 
      matwall_23 | -0.00640 
      matwall_24 | -0.00831 
      matwall_25 | -0.00022 
      matwall_26 | -0.00449 
      matwall_31 | -0.02627 
      matwall_32 | -0.00303 
      matwall_34 |  0.00093 
      matwall_35 |  0.08040 
      matwall_36 | -0.05443 
      matwall_37 |  0.00283 
      matwall_38 | -0.00554 
      matwall_96 | -0.00505 
           house |  0.02016 
            land |  0.01406 
       cowbull_1 |  0.00174 
       cowbull_2 |  0.00435 
       cowbull_3 |  0.00855 
        buffal_1 | -0.00613 
        buffal_2 |  0.00039 
        buffal_3 |  0.00156 
         horse_1 | -0.00528 
         horse_2 | -0.00068 
          goat_1 | -0.00809 
          goat_2 |  0.00359 
          goat_3 |  0.00539 
           pig_1 | -0.04589 
           pig_2 | -0.00807 
           pig_3 | -0.00152 
       chicken_1 | -0.02185 
       chicken_2 |  0.01354 
       chicken_3 |  0.01569 
    memsleep_i~r | -0.04242 
    landarea_i~r |  0.00712 
    floorarea_~r |  0.06928 
    ------------------------


. 
. gen wi_complete_urbrur = wi_complete_urb
(23,403 missing values generated)

.         lab var wi_complete_urbrur "Indeks kekayaan (lengkap, kota/desa)"

.         replace wi_complete_urbrur = wi_complete_rur if hv025 == 2
(23,403 real changes made)

. 
. drop wi_complete_urb wi_complete_rur

. 
. *\ringkasan
. summ wi_complete_urbrur

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
wi_complet~r |     47,963   -1.42e-10    .9999896  -4.078567    3.13425

. histogram wi_complete_urbrur, density normal
(bin=46, start=-4.0785666, width=.15680036)

. graph export ".\output\hist_wi_complete_urbrur.png", replace
(file .\output\hist_wi_complete_urbrur.png not found)
file .\output\hist_wi_complete_urbrur.png saved as PNG format

. sepscatter hv271 wi_complete_urbrur, separate(hv025)

. graph export ".\output\scat_wi_complete_urbrur.png", replace
(file .\output\scat_wi_complete_urbrur.png not found)
file .\output\scat_wi_complete_urbrur.png saved as PNG format

. 
. /*
> ******************************************************************
> Komposit/Kombinasi                                                                                      [done]
> ******************************************************************
> */
. 
. /*
> ------------------------------------------------------------------
> Regress                                                                                                         [done]
> ------------------------------------------------------------------
> */
. 
. *\kota
. regress wi_complete_all wi_complete_urbrur if hv025 == 1

      Source |       SS           df       MS      Number of obs   =    24,560
-------------+----------------------------------   F(1, 24558)     >  99999.00
       Model |  16264.4246         1  16264.4246   Prob > F        =    0.0000
    Residual |  102.940327    24,558  .004191723   R-squared       =    0.9937
-------------+----------------------------------   Adj R-squared   =    0.9937
       Total |   16367.365    24,559  .666450791   Root MSE        =    .06474

------------------------------------------------------------------------------------
   wi_complete_all | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
wi_complete_urbrur |   .8137931   .0004131  1969.80   0.000     .8129834    .8146029
             _cons |   .4621214   .0004131  1118.60   0.000     .4613116    .4629311
------------------------------------------------------------------------------------

. predict wi_1
(option xb assumed; fitted values)

. 
. *\desa
. regress wi_complete_all wi_complete_urbrur if hv025 == 2

      Source |       SS           df       MS      Number of obs   =    23,403
-------------+----------------------------------   F(1, 23401)     >  99999.00
       Model |  20706.8826         1  20706.8826   Prob > F        =    0.0000
    Residual |  138.573774    23,401  .005921703   R-squared       =    0.9934
-------------+----------------------------------   Adj R-squared   =    0.9934
       Total |  20845.4564    23,402  .890755336   Root MSE        =    .07695

------------------------------------------------------------------------------------
   wi_complete_all | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------+----------------------------------------------------------------
wi_complete_urbrur |   .9406561    .000503  1869.97   0.000     .9396701    .9416421
             _cons |  -.4849678    .000503  -964.11   0.000    -.4859537   -.4839818
------------------------------------------------------------------------------------

. predict wi_2
(option xb assumed; fitted values)

. 
. *\skor
. gen wi_complete_combine = .
(47,963 missing values generated)

.         lab var wi_complete_combine "Indeks kekayaan (lengkap, kombinasi)"

.         replace wi_complete_combine = wi_1 if hv025 == 1
(24,560 real changes made)

.         replace wi_complete_combine = wi_2 if hv025 == 2
(23,403 real changes made)

. 
. drop wi_1 wi_2

. 
. *\ringkasan
. summ wi_complete_combine

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
wi_complet~e |     47,963    2.64e-10    .9974791  -3.260725   2.841249

. histogram wi_complete_combine, density normal
(bin=46, start=-3.2607255, width=.13265162)

. graph export ".\output\hist_wi_complete_combine.png", replace
(file .\output\hist_wi_complete_combine.png not found)
file .\output\hist_wi_complete_combine.png saved as PNG format

. sepscatter hv271a wi_complete_combine, separate(hv025)

. graph export ".\output\scat_wi_complete_combine.png", replace
(file .\output\scat_wi_complete_combine.png not found)
file .\output\scat_wi_complete_combine.png saved as PNG format

. 
. /*
> ******************************************************************
> Kuintil indeks                                                                                          [done]
> ******************************************************************
> */
. 
. *\penimbang
. gen hhweight = hv005/1000000

.         lab var hhweight "Penimbang rumah tangga"

. 
. gen hmweight = hhweight*hv012

.         lab var hmweight "Penimbang rumah tangga x jumlah art"

.         replace hmweight = hhweight*hv013 if hv012 == 0
(0 real changes made)

. 
. *\kota/desa
. xtile wiq_complete_urb = wi_complete_urbrur if hv025 == 1 [pw = hmweight], nq(5)

. xtile wiq_complete_rur = wi_complete_urbrur if hv025 == 2 [pw = hmweight], nq(5)

. gen wiq_complete_urbrur = .
(47,963 missing values generated)

.         lab var wiq_complete_urbrur "Kuintil indeks kekayaan (lengkap, kota/desa)"

.         replace wiq_complete_urbrur = wiq_complete_urb if hv025 == 1
(24,560 real changes made)

.         replace wiq_complete_urbrur = wiq_complete_rur if hv025 == 2
(23,403 real changes made)

. drop wiq_complete_urb wiq_complete_rur

. 
. tab hv270a wiq_complete_urbrur

    wealth |
 index for |
urban/rura |      Kuintil indeks kekayaan (lengkap, kota/desa)
         l |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
   poorest |    13,119        113          0          0          0 |    13,232 
    poorer |        97      9,953        123          0          0 |    10,173 
    middle |         0         93      8,574        147          0 |     8,814 
    richer |         0          0        120      7,901        112 |     8,133 
   richest |         0          0          0         81      7,530 |     7,611 
-----------+-------------------------------------------------------+----------
     Total |    13,216     10,159      8,817      8,129      7,642 |    47,963 

. 
. *\kombinasi
. xtile wiq_complete_combine = wi_complete_combine [pw = hmweight], nq(5)

.         lab var wiq_complete_combine "Kuintil indeks kekayaan (lengkap, kombinasi)"

. 
. tab hv270 wiq_complete_combine

    wealth |
     index |      Kuintil indeks kekayaan (lengkap, kombinasi)
  combined |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
   poorest |    12,758         99          0          0          0 |    12,857 
    poorer |        89      9,400        104          0          0 |     9,593 
    middle |         0        111      8,647        134          0 |     8,892 
    richer |         0          0        133      8,249        102 |     8,484 
   richest |         0          0          0         91      8,046 |     8,137 
-----------+-------------------------------------------------------+----------
     Total |    12,847      9,610      8,884      8,474      8,148 |    47,963 

. 
. /*
> ******************************************************************
> Desil indeks                                                                                            [done]
> ******************************************************************
> */
. 
. *\kota/desa
. xtile wid_complete_urb = wi_complete_urbrur if hv025 == 1 [pw = hmweight], nq(10)

. xtile wid_complete_rur = wi_complete_urbrur if hv025 == 2 [pw = hmweight], nq(10)

. gen wid_complete_urbrur = .
(47,963 missing values generated)

.         lab var wid_complete_urbrur "Desil indeks kekayaan (lengkap, kota/desa)"

.         replace wid_complete_urbrur = wid_complete_urb if hv025 == 1
(24,560 real changes made)

.         replace wid_complete_urbrur = wid_complete_rur if hv025 == 2
(23,403 real changes made)

. drop wid_complete_urb wid_complete_rur

. 
. tab wid_complete_urbrur

      Desil |
     indeks |
   kekayaan |
  (lengkap, |
 kota/desa) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      7,364       15.35       15.35
          2 |      5,852       12.20       27.55
          3 |      5,297       11.04       38.60
          4 |      4,862       10.14       48.74
          5 |      4,508        9.40       58.13
          6 |      4,309        8.98       67.12
          7 |      4,135        8.62       75.74
          8 |      3,994        8.33       84.07
          9 |      3,969        8.28       92.34
         10 |      3,673        7.66      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\\kombinasi
. xtile wid_complete_combine = wi_complete_combine [pw = hmweight], nq(10)

.         lab var wid_complete_combine "Desil indeks kekayaan (lengkap, kombinasi)"

. 
. tab wid_complete_combine

      Desil |
     indeks |
   kekayaan |
  (lengkap, |
 kombinasi) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      7,205       15.02       15.02
          2 |      5,642       11.76       26.79
          3 |      4,895       10.21       36.99
          4 |      4,715        9.83       46.82
          5 |      4,444        9.27       56.09
          6 |      4,440        9.26       65.34
          7 |      4,306        8.98       74.32
          8 |      4,168        8.69       83.01
          9 |      4,157        8.67       91.68
         10 |      3,991        8.32      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. 
. 
. /*
> ================================================================================
> INDEKS KEKAYAAN (TEREDUKSI)
> 
> Tanpa indikator:
> -Sumber air minum
> -Jenis toilet
> -Bahan bakar memasak
> ================================================================================
> */
. 
. /*
> ******************************************************************
> Commons/Umum/All                                                                                        [done]
> ******************************************************************
> */
. 
. /*
> ------------------------------------------------------------------
> Skor - Faktor PCA                                                                                       [done]
> ------------------------------------------------------------------
> */
. 
. #delimit ;
delimiter now ;
. glo indicator 
>         electricity-bankac matfloor_* matroof_* matwall_*
>         house land memsleep_iall floorarea_iall
>         ;

. #delimit cr
delimiter now cr
. 
. *\factor pc
. factor $indicator, factors(1) pcf
(obs=47,963)

Factor analysis/correlation                      Number of obs    =     47,963
    Method: principal-component factors          Retained factors =          1
    Rotation: (unrotated)                        Number of params =         58

    
Warning: Solution is a Heywood case; that is, invalid or boundary values of uniqueness.

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      5.79904      3.20503            0.1000       0.1000
        Factor2  |      2.59401      0.62867            0.0447       0.1447
        Factor3  |      1.96534      0.33594            0.0339       0.1786
        Factor4  |      1.62940      0.02632            0.0281       0.2067
        Factor5  |      1.60308      0.10267            0.0276       0.2343
        Factor6  |      1.50041      0.17983            0.0259       0.2602
        Factor7  |      1.32058      0.08680            0.0228       0.2830
        Factor8  |      1.23378      0.08422            0.0213       0.3042
        Factor9  |      1.14955      0.05667            0.0198       0.3241
       Factor10  |      1.09289      0.01124            0.0188       0.3429
       Factor11  |      1.08164      0.00243            0.0186       0.3615
       Factor12  |      1.07921      0.01002            0.0186       0.3802
       Factor13  |      1.06919      0.00990            0.0184       0.3986
       Factor14  |      1.05930      0.01230            0.0183       0.4169
       Factor15  |      1.04700      0.01012            0.0181       0.4349
       Factor16  |      1.03687      0.00600            0.0179       0.4528
       Factor17  |      1.03087      0.00765            0.0178       0.4706
       Factor18  |      1.02322      0.00225            0.0176       0.4882
       Factor19  |      1.02097      0.00466            0.0176       0.5058
       Factor20  |      1.01631      0.00324            0.0175       0.5233
       Factor21  |      1.01308      0.00899            0.0175       0.5408
       Factor22  |      1.00408      0.00231            0.0173       0.5581
       Factor23  |      1.00178      0.00204            0.0173       0.5754
       Factor24  |      0.99973      0.00316            0.0172       0.5926
       Factor25  |      0.99657      0.00186            0.0172       0.6098
       Factor26  |      0.99471      0.00579            0.0172       0.6269
       Factor27  |      0.98892      0.00713            0.0171       0.6440
       Factor28  |      0.98179      0.00823            0.0169       0.6609
       Factor29  |      0.97356      0.00316            0.0168       0.6777
       Factor30  |      0.97040      0.01497            0.0167       0.6944
       Factor31  |      0.95543      0.00630            0.0165       0.7109
       Factor32  |      0.94912      0.01613            0.0164       0.7273
       Factor33  |      0.93300      0.01273            0.0161       0.7434
       Factor34  |      0.92026      0.01108            0.0159       0.7592
       Factor35  |      0.90918      0.00208            0.0157       0.7749
       Factor36  |      0.90711      0.03721            0.0156       0.7905
       Factor37  |      0.86990      0.00935            0.0150       0.8055
       Factor38  |      0.86054      0.01355            0.0148       0.8204
       Factor39  |      0.84699      0.04813            0.0146       0.8350
       Factor40  |      0.79886      0.04481            0.0138       0.8488
       Factor41  |      0.75405      0.01590            0.0130       0.8618
       Factor42  |      0.73816      0.02464            0.0127       0.8745
       Factor43  |      0.71351      0.02396            0.0123       0.8868
       Factor44  |      0.68955      0.05606            0.0119       0.8987
       Factor45  |      0.63349      0.01592            0.0109       0.9096
       Factor46  |      0.61757      0.00628            0.0106       0.9202
       Factor47  |      0.61129      0.03563            0.0105       0.9308
       Factor48  |      0.57566      0.01716            0.0099       0.9407
       Factor49  |      0.55850      0.01295            0.0096       0.9503
       Factor50  |      0.54556      0.00094            0.0094       0.9597
       Factor51  |      0.54462      0.01652            0.0094       0.9691
       Factor52  |      0.52810      0.08726            0.0091       0.9782
       Factor53  |      0.44084      0.02450            0.0076       0.9858
       Factor54  |      0.41634      0.01439            0.0072       0.9930
       Factor55  |      0.40195      0.39957            0.0069       0.9999
       Factor56  |      0.00238      0.00190            0.0000       1.0000
       Factor57  |      0.00047      0.00019            0.0000       1.0000
       Factor58  |      0.00029            .            0.0000       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated: chi2(1653)= 1.2e+06 Prob>chi2 = 0.0000

Factor loadings (pattern matrix) and unique variances

    ---------------------------------------
        Variable |  Factor1 |   Uniqueness 
    -------------+----------+--------------
     electricity |   0.3302 |      0.8910  
           radio |   0.2689 |      0.9277  
      television |   0.5455 |      0.7025  
       telephone |   0.3069 |      0.9058  
        computer |   0.5726 |      0.6722  
    refrigerator |   0.6826 |      0.5341  
             fan |   0.5917 |      0.6499  
     washingmach |   0.6238 |      0.6109  
         aircond |   0.4939 |      0.7561  
           watch |   0.5393 |      0.7091  
              hp |   0.4376 |      0.8085  
          bcycle |   0.3741 |      0.8600  
        motorcyc |   0.5146 |      0.7352  
      animdrcart |   0.0039 |      1.0000  
             car |   0.5169 |      0.7328  
            boat |  -0.0478 |      0.9977  
          bankac |   0.5763 |      0.6679  
     matfloor_11 |  -0.2591 |      0.9329  
     matfloor_21 |  -0.3054 |      0.9067  
     matfloor_22 |  -0.1453 |      0.9789  
     matfloor_31 |  -0.0122 |      0.9999  
     matfloor_32 |  -0.0011 |      1.0000  
     matfloor_33 |   0.6720 |      0.5484  
     matfloor_34 |   0.0279 |      0.9992  
     matfloor_35 |  -0.3680 |      0.8646  
     matfloor_36 |  -0.0236 |      0.9994  
     matfloor_96 |  -0.0157 |      0.9998  
      matroof_12 |  -0.2172 |      0.9528  
      matroof_13 |  -0.1206 |      0.9855  
      matroof_21 |  -0.0245 |      0.9994  
      matroof_22 |  -0.0248 |      0.9994  
      matroof_23 |  -0.0222 |      0.9995  
      matroof_31 |  -0.2804 |      0.9214  
      matroof_32 |   0.0694 |      0.9952  
      matroof_33 |   0.2594 |      0.9327  
      matroof_34 |   0.1017 |      0.9897  
      matroof_35 |   0.1643 |      0.9730  
      matroof_36 |  -0.0356 |      0.9987  
      matroof_96 |   0.0027 |      1.0000  
      matwall_12 |  -0.1795 |      0.9678  
      matwall_21 |  -0.0611 |      0.9963  
      matwall_22 |  -0.0103 |      0.9999  
      matwall_23 |  -0.1135 |      0.9871  
      matwall_24 |  -0.0683 |      0.9953  
      matwall_25 |  -0.0030 |      1.0000  
      matwall_26 |  -0.0392 |      0.9985  
      matwall_31 |  -0.1932 |      0.9627  
      matwall_32 |  -0.0346 |      0.9988  
      matwall_34 |   0.0154 |      0.9998  
      matwall_35 |   0.5692 |      0.6760  
      matwall_36 |  -0.4485 |      0.7989  
      matwall_37 |  -0.0108 |      0.9999  
      matwall_38 |  -0.0778 |      0.9939  
      matwall_96 |  -0.0301 |      0.9991  
           house |   0.1253 |      0.9843  
            land |   0.0659 |      0.9957  
    memsleep_i~l |  -0.2564 |      0.9342  
    floorarea_~l |   0.4748 |      0.7746  
    ---------------------------------------

. predict wi_reduce_all
(option regression assumed; regression scoring)

Scoring coefficients (method = regression)

    ------------------------
        Variable |  Factor1 
    -------------+----------
     electricity |  0.05694 
           radio |  0.04637 
      television |  0.09406 
       telephone |  0.05293 
        computer |  0.09874 
    refrigerator |  0.11771 
             fan |  0.10203 
     washingmach |  0.10756 
         aircond |  0.08517 
           watch |  0.09301 
              hp |  0.07546 
          bcycle |  0.06451 
        motorcyc |  0.08874 
      animdrcart |  0.00068 
             car |  0.08914 
            boat | -0.00823 
          bankac |  0.09938 
     matfloor_11 | -0.04468 
     matfloor_21 | -0.05267 
     matfloor_22 | -0.02506 
     matfloor_31 | -0.00210 
     matfloor_32 | -0.00019 
     matfloor_33 |  0.11588 
     matfloor_34 |  0.00482 
     matfloor_35 | -0.06346 
     matfloor_36 | -0.00406 
     matfloor_96 | -0.00271 
      matroof_12 | -0.03745 
      matroof_13 | -0.02080 
      matroof_21 | -0.00422 
      matroof_22 | -0.00428 
      matroof_23 | -0.00383 
      matroof_31 | -0.04835 
      matroof_32 |  0.01196 
      matroof_33 |  0.04472 
      matroof_34 |  0.01754 
      matroof_35 |  0.02833 
      matroof_36 | -0.00614 
      matroof_96 |  0.00047 
      matwall_12 | -0.03095 
      matwall_21 | -0.01053 
      matwall_22 | -0.00178 
      matwall_23 | -0.01958 
      matwall_24 | -0.01178 
      matwall_25 | -0.00051 
      matwall_26 | -0.00676 
      matwall_31 | -0.03332 
      matwall_32 | -0.00597 
      matwall_34 |  0.00266 
      matwall_35 |  0.09815 
      matwall_36 | -0.07734 
      matwall_37 | -0.00186 
      matwall_38 | -0.01342 
      matwall_96 | -0.00520 
           house |  0.02161 
            land |  0.01137 
    memsleep_i~l | -0.04422 
    floorarea_~l |  0.08187 
    ------------------------


. lab var wi_reduce_all "Indeks kekayaan (tereduksi, umum)"

. 
. /*
> ******************************************************************
> Kota-desa                                                                                                       [done]
> ******************************************************************
> */
. 
. /*
> ------------------------------------------------------------------
> Skor - Faktor PCA                                                                                       [done]
> ------------------------------------------------------------------
> */
. 
. #delimit ;
delimiter now ;
. glo indicator 
>         electricity-bankac matfloor_* matroof_* matwall_* house land memsleep_iurbrur
>         cowbull_* buffal_* horse_* goat_* pig_* chicken_*
>         landarea_iurbrur floorarea_iurbrur
>         ;

. #delimit cr
delimiter now cr
. 
. *\factor pc
. factor $indicator if hv025 == 1, factors(1) pcf
(obs=24,560)

Factor analysis/correlation                      Number of obs    =     24,560
    Method: principal-component factors          Retained factors =          1
    Rotation: (unrotated)                        Number of params =         76

    
Warning: Solution is a Heywood case; that is, invalid or boundary values of uniqueness.

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      5.12496      2.37821            0.0674       0.0674
        Factor2  |      2.74675      0.90897            0.0361       0.1036
        Factor3  |      1.83778      0.17007            0.0242       0.1278
        Factor4  |      1.66771      0.11673            0.0219       0.1497
        Factor5  |      1.55098      0.04751            0.0204       0.1701
        Factor6  |      1.50348      0.15011            0.0198       0.1899
        Factor7  |      1.35336      0.04532            0.0178       0.2077
        Factor8  |      1.30804      0.07818            0.0172       0.2249
        Factor9  |      1.22987      0.04473            0.0162       0.2411
       Factor10  |      1.18514      0.02066            0.0156       0.2567
       Factor11  |      1.16447      0.02822            0.0153       0.2720
       Factor12  |      1.13625      0.00926            0.0150       0.2870
       Factor13  |      1.12699      0.01194            0.0148       0.3018
       Factor14  |      1.11505      0.00431            0.0147       0.3165
       Factor15  |      1.11074      0.00952            0.0146       0.3311
       Factor16  |      1.10123      0.02032            0.0145       0.3456
       Factor17  |      1.08091      0.00511            0.0142       0.3598
       Factor18  |      1.07580      0.00530            0.0142       0.3739
       Factor19  |      1.07050      0.00854            0.0141       0.3880
       Factor20  |      1.06196      0.00600            0.0140       0.4020
       Factor21  |      1.05596      0.00307            0.0139       0.4159
       Factor22  |      1.05289      0.00792            0.0139       0.4297
       Factor23  |      1.04498      0.00346            0.0137       0.4435
       Factor24  |      1.04151      0.01189            0.0137       0.4572
       Factor25  |      1.02963      0.00284            0.0135       0.4707
       Factor26  |      1.02679      0.00685            0.0135       0.4843
       Factor27  |      1.01994      0.00603            0.0134       0.4977
       Factor28  |      1.01392      0.00253            0.0133       0.5110
       Factor29  |      1.01139      0.00452            0.0133       0.5243
       Factor30  |      1.00686      0.00181            0.0132       0.5376
       Factor31  |      1.00506      0.00247            0.0132       0.5508
       Factor32  |      1.00259      0.00189            0.0132       0.5640
       Factor33  |      1.00070      0.00230            0.0132       0.5772
       Factor34  |      0.99840      0.00358            0.0131       0.5903
       Factor35  |      0.99482      0.01045            0.0131       0.6034
       Factor36  |      0.98438      0.00100            0.0130       0.6163
       Factor37  |      0.98338      0.00386            0.0129       0.6293
       Factor38  |      0.97952      0.00494            0.0129       0.6422
       Factor39  |      0.97458      0.00956            0.0128       0.6550
       Factor40  |      0.96503      0.00524            0.0127       0.6677
       Factor41  |      0.95978      0.00299            0.0126       0.6803
       Factor42  |      0.95679      0.00446            0.0126       0.6929
       Factor43  |      0.95233      0.00819            0.0125       0.7054
       Factor44  |      0.94414      0.00763            0.0124       0.7179
       Factor45  |      0.93651      0.00041            0.0123       0.7302
       Factor46  |      0.93610      0.01384            0.0123       0.7425
       Factor47  |      0.92227      0.01347            0.0121       0.7546
       Factor48  |      0.90880      0.00186            0.0120       0.7666
       Factor49  |      0.90694      0.00553            0.0119       0.7785
       Factor50  |      0.90141      0.01305            0.0119       0.7904
       Factor51  |      0.88836      0.00618            0.0117       0.8021
       Factor52  |      0.88218      0.01225            0.0116       0.8137
       Factor53  |      0.86993      0.01644            0.0114       0.8251
       Factor54  |      0.85349      0.00331            0.0112       0.8364
       Factor55  |      0.85017      0.00661            0.0112       0.8475
       Factor56  |      0.84357      0.01997            0.0111       0.8586
       Factor57  |      0.82360      0.03536            0.0108       0.8695
       Factor58  |      0.78824      0.02828            0.0104       0.8799
       Factor59  |      0.75996      0.02039            0.0100       0.8899
       Factor60  |      0.73957      0.03783            0.0097       0.8996
       Factor61  |      0.70174      0.01254            0.0092       0.9088
       Factor62  |      0.68920      0.00340            0.0091       0.9179
       Factor63  |      0.68580      0.01305            0.0090       0.9269
       Factor64  |      0.67275      0.02025            0.0089       0.9358
       Factor65  |      0.65250      0.04086            0.0086       0.9443
       Factor66  |      0.61164      0.00542            0.0080       0.9524
       Factor67  |      0.60622      0.02410            0.0080       0.9604
       Factor68  |      0.58212      0.04337            0.0077       0.9680
       Factor69  |      0.53875      0.02014            0.0071       0.9751
       Factor70  |      0.51861      0.02379            0.0068       0.9819
       Factor71  |      0.49482      0.02605            0.0065       0.9885
       Factor72  |      0.46876      0.06449            0.0062       0.9946
       Factor73  |      0.40428      0.40114            0.0053       0.9999
       Factor74  |      0.00314      0.00245            0.0000       1.0000
       Factor75  |      0.00069      0.00014            0.0000       1.0000
       Factor76  |      0.00055            .            0.0000       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated: chi2(2850)= 5.8e+05 Prob>chi2 = 0.0000

Factor loadings (pattern matrix) and unique variances

    ---------------------------------------
        Variable |  Factor1 |   Uniqueness 
    -------------+----------+--------------
     electricity |   0.1622 |      0.9737  
           radio |   0.2405 |      0.9421  
      television |   0.3886 |      0.8490  
       telephone |   0.3515 |      0.8764  
        computer |   0.5913 |      0.6503  
    refrigerator |   0.6211 |      0.6142  
             fan |   0.4625 |      0.7861  
     washingmach |   0.6151 |      0.6216  
         aircond |   0.5569 |      0.6899  
           watch |   0.5231 |      0.7264  
              hp |   0.3678 |      0.8648  
          bcycle |   0.3234 |      0.8954  
        motorcyc |   0.4498 |      0.7977  
      animdrcart |   0.0176 |      0.9997  
             car |   0.5641 |      0.6818  
            boat |  -0.0037 |      1.0000  
          bankac |   0.5667 |      0.6788  
     matfloor_11 |  -0.2016 |      0.9593  
     matfloor_21 |  -0.2601 |      0.9323  
     matfloor_22 |  -0.0774 |      0.9940  
     matfloor_31 |  -0.0153 |      0.9998  
     matfloor_32 |   0.0017 |      1.0000  
     matfloor_33 |   0.6300 |      0.6031  
     matfloor_34 |  -0.0521 |      0.9973  
     matfloor_35 |  -0.4575 |      0.7907  
     matfloor_36 |  -0.0466 |      0.9978  
     matfloor_96 |  -0.0117 |      0.9999  
      matroof_12 |  -0.1299 |      0.9831  
      matroof_13 |  -0.0101 |      0.9999  
      matroof_21 |  -0.0366 |      0.9987  
      matroof_22 |  -0.0232 |      0.9995  
      matroof_23 |  -0.0209 |      0.9996  
      matroof_31 |  -0.2111 |      0.9554  
      matroof_32 |  -0.0056 |      1.0000  
      matroof_33 |   0.1547 |      0.9761  
      matroof_34 |   0.0895 |      0.9920  
      matroof_35 |   0.1863 |      0.9653  
      matroof_36 |  -0.0280 |      0.9992  
      matroof_96 |   0.0173 |      0.9997  
      matwall_12 |  -0.0963 |      0.9907  
      matwall_21 |  -0.0610 |      0.9963  
      matwall_22 |  -0.0105 |      0.9999  
      matwall_23 |  -0.1516 |      0.9770  
      matwall_24 |  -0.1017 |      0.9897  
      matwall_25 |  -0.0078 |      0.9999  
      matwall_26 |  -0.0670 |      0.9955  
      matwall_31 |  -0.2136 |      0.9544  
      matwall_32 |  -0.0320 |      0.9990  
      matwall_34 |  -0.0313 |      0.9990  
      matwall_35 |   0.4575 |      0.7907  
      matwall_36 |  -0.3515 |      0.8764  
      matwall_37 |  -0.0151 |      0.9998  
      matwall_38 |  -0.1116 |      0.9875  
      matwall_96 |  -0.0200 |      0.9996  
           house |   0.2440 |      0.9404  
            land |   0.2268 |      0.9486  
    memsleep_i~r |  -0.2543 |      0.9353  
       cowbull_1 |  -0.0540 |      0.9971  
       cowbull_2 |  -0.0162 |      0.9997  
       cowbull_3 |   0.0161 |      0.9997  
        buffal_1 |  -0.0053 |      1.0000  
        buffal_2 |   0.0199 |      0.9996  
        buffal_3 |   0.0141 |      0.9998  
         horse_1 |  -0.0136 |      0.9998  
         horse_2 |   0.0012 |      1.0000  
          goat_1 |  -0.1006 |      0.9899  
          goat_2 |  -0.0397 |      0.9984  
          goat_3 |  -0.0058 |      1.0000  
           pig_1 |  -0.0734 |      0.9946  
           pig_2 |  -0.0140 |      0.9998  
           pig_3 |  -0.0036 |      1.0000  
       chicken_1 |  -0.1323 |      0.9825  
       chicken_2 |  -0.0301 |      0.9991  
       chicken_3 |   0.0370 |      0.9986  
    landarea_i~r |   0.0441 |      0.9981  
    floorarea_~r |   0.5018 |      0.7482  
    ---------------------------------------

. predict wi_reduce_urb if hv025 == 1
(option regression assumed; regression scoring)

Scoring coefficients (method = regression)

    ------------------------
        Variable |  Factor1 
    -------------+----------
     electricity |  0.03166 
           radio |  0.04694 
      television |  0.07582 
       telephone |  0.06859 
        computer |  0.11538 
    refrigerator |  0.12120 
             fan |  0.09025 
     washingmach |  0.12002 
         aircond |  0.10866 
           watch |  0.10207 
              hp |  0.07176 
          bcycle |  0.06311 
        motorcyc |  0.08777 
      animdrcart |  0.00343 
             car |  0.11006 
            boat | -0.00073 
          bankac |  0.11058 
     matfloor_11 | -0.03934 
     matfloor_21 | -0.05076 
     matfloor_22 | -0.01510 
     matfloor_31 | -0.00299 
     matfloor_32 |  0.00032 
     matfloor_33 |  0.12292 
     matfloor_34 | -0.01016 
     matfloor_35 | -0.08927 
     matfloor_36 | -0.00908 
     matfloor_96 | -0.00229 
      matroof_12 | -0.02535 
      matroof_13 | -0.00197 
      matroof_21 | -0.00714 
      matroof_22 | -0.00452 
      matroof_23 | -0.00409 
      matroof_31 | -0.04120 
      matroof_32 | -0.00110 
      matroof_33 |  0.03020 
      matroof_34 |  0.01747 
      matroof_35 |  0.03635 
      matroof_36 | -0.00546 
      matroof_96 |  0.00338 
      matwall_12 | -0.01879 
      matwall_21 | -0.01191 
      matwall_22 | -0.00204 
      matwall_23 | -0.02959 
      matwall_24 | -0.01984 
      matwall_25 | -0.00152 
      matwall_26 | -0.01308 
      matwall_31 | -0.04167 
      matwall_32 | -0.00624 
      matwall_34 | -0.00610 
      matwall_35 |  0.08927 
      matwall_36 | -0.06859 
      matwall_37 | -0.00295 
      matwall_38 | -0.02177 
      matwall_96 | -0.00391 
           house |  0.04762 
            land |  0.04425 
    memsleep_i~r | -0.04962 
       cowbull_1 | -0.01054 
       cowbull_2 | -0.00317 
       cowbull_3 |  0.00315 
        buffal_1 | -0.00104 
        buffal_2 |  0.00388 
        buffal_3 |  0.00275 
         horse_1 | -0.00265 
         horse_2 |  0.00023 
          goat_1 | -0.01964 
          goat_2 | -0.00775 
          goat_3 | -0.00114 
           pig_1 | -0.01432 
           pig_2 | -0.00272 
           pig_3 | -0.00070 
       chicken_1 | -0.02582 
       chicken_2 | -0.00588 
       chicken_3 |  0.00721 
    landarea_i~r |  0.00861 
    floorarea_~r |  0.09792 
    ------------------------


. 
. factor $indicator if hv025 == 2, factors(1) pcf
(obs=23,403)

Factor analysis/correlation                      Number of obs    =     23,403
    Method: principal-component factors          Retained factors =          1
    Rotation: (unrotated)                        Number of params =         76

    
Warning: Solution is a Heywood case; that is, invalid or boundary values of uniqueness.

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      5.24363      2.45128            0.0690       0.0690
        Factor2  |      2.79235      0.77913            0.0367       0.1057
        Factor3  |      2.01322      0.18780            0.0265       0.1322
        Factor4  |      1.82543      0.13163            0.0240       0.1562
        Factor5  |      1.69380      0.31209            0.0223       0.1785
        Factor6  |      1.38171      0.04762            0.0182       0.1967
        Factor7  |      1.33409      0.04354            0.0176       0.2143
        Factor8  |      1.29055      0.02996            0.0170       0.2312
        Factor9  |      1.26059      0.02596            0.0166       0.2478
       Factor10  |      1.23463      0.07236            0.0162       0.2641
       Factor11  |      1.16228      0.01076            0.0153       0.2794
       Factor12  |      1.15152      0.01633            0.0152       0.2945
       Factor13  |      1.13518      0.00932            0.0149       0.3095
       Factor14  |      1.12586      0.02009            0.0148       0.3243
       Factor15  |      1.10577      0.00263            0.0145       0.3388
       Factor16  |      1.10315      0.01628            0.0145       0.3533
       Factor17  |      1.08687      0.01294            0.0143       0.3676
       Factor18  |      1.07392      0.00465            0.0141       0.3818
       Factor19  |      1.06927      0.00325            0.0141       0.3958
       Factor20  |      1.06602      0.01348            0.0140       0.4099
       Factor21  |      1.05254      0.00366            0.0138       0.4237
       Factor22  |      1.04888      0.00182            0.0138       0.4375
       Factor23  |      1.04707      0.00626            0.0138       0.4513
       Factor24  |      1.04081      0.00657            0.0137       0.4650
       Factor25  |      1.03423      0.00481            0.0136       0.4786
       Factor26  |      1.02942      0.00541            0.0135       0.4921
       Factor27  |      1.02401      0.00351            0.0135       0.5056
       Factor28  |      1.02050      0.00473            0.0134       0.5190
       Factor29  |      1.01578      0.00704            0.0134       0.5324
       Factor30  |      1.00873      0.00192            0.0133       0.5457
       Factor31  |      1.00681      0.00524            0.0132       0.5589
       Factor32  |      1.00157      0.00099            0.0132       0.5721
       Factor33  |      1.00057      0.00619            0.0132       0.5853
       Factor34  |      0.99439      0.00498            0.0131       0.5984
       Factor35  |      0.98941      0.00093            0.0130       0.6114
       Factor36  |      0.98848      0.00796            0.0130       0.6244
       Factor37  |      0.98052      0.00427            0.0129       0.6373
       Factor38  |      0.97625      0.00656            0.0128       0.6501
       Factor39  |      0.96969      0.00481            0.0128       0.6629
       Factor40  |      0.96488      0.00368            0.0127       0.6756
       Factor41  |      0.96120      0.00981            0.0126       0.6882
       Factor42  |      0.95140      0.00706            0.0125       0.7008
       Factor43  |      0.94434      0.01330            0.0124       0.7132
       Factor44  |      0.93104      0.00106            0.0123       0.7254
       Factor45  |      0.92998      0.01021            0.0122       0.7377
       Factor46  |      0.91978      0.00914            0.0121       0.7498
       Factor47  |      0.91064      0.00348            0.0120       0.7617
       Factor48  |      0.90715      0.01891            0.0119       0.7737
       Factor49  |      0.88824      0.00506            0.0117       0.7854
       Factor50  |      0.88319      0.01253            0.0116       0.7970
       Factor51  |      0.87065      0.00815            0.0115       0.8084
       Factor52  |      0.86250      0.01361            0.0113       0.8198
       Factor53  |      0.84890      0.00646            0.0112       0.8310
       Factor54  |      0.84243      0.03066            0.0111       0.8421
       Factor55  |      0.81178      0.01067            0.0107       0.8527
       Factor56  |      0.80111      0.01523            0.0105       0.8633
       Factor57  |      0.78588      0.01733            0.0103       0.8736
       Factor58  |      0.76855      0.01354            0.0101       0.8837
       Factor59  |      0.75501      0.03602            0.0099       0.8937
       Factor60  |      0.71899      0.00707            0.0095       0.9031
       Factor61  |      0.71192      0.02254            0.0094       0.9125
       Factor62  |      0.68938      0.04058            0.0091       0.9216
       Factor63  |      0.64880      0.01141            0.0085       0.9301
       Factor64  |      0.63739      0.02421            0.0084       0.9385
       Factor65  |      0.61318      0.01273            0.0081       0.9466
       Factor66  |      0.60045      0.02212            0.0079       0.9545
       Factor67  |      0.57833      0.01109            0.0076       0.9621
       Factor68  |      0.56724      0.02312            0.0075       0.9695
       Factor69  |      0.54412      0.03688            0.0072       0.9767
       Factor70  |      0.50724      0.04636            0.0067       0.9834
       Factor71  |      0.46088      0.02312            0.0061       0.9894
       Factor72  |      0.43776      0.07397            0.0058       0.9952
       Factor73  |      0.36379      0.36181            0.0048       1.0000
       Factor74  |      0.00199      0.00168            0.0000       1.0000
       Factor75  |      0.00030      0.00024            0.0000       1.0000
       Factor76  |      0.00006            .            0.0000       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated: chi2(2850)= 6.5e+05 Prob>chi2 = 0.0000

Factor loadings (pattern matrix) and unique variances

    ---------------------------------------
        Variable |  Factor1 |   Uniqueness 
    -------------+----------+--------------
     electricity |   0.3957 |      0.8434  
           radio |   0.2135 |      0.9544  
      television |   0.6141 |      0.6229  
       telephone |   0.0713 |      0.9949  
        computer |   0.4694 |      0.7797  
    refrigerator |   0.6687 |      0.5528  
             fan |   0.5989 |      0.6413  
     washingmach |   0.5543 |      0.6927  
         aircond |   0.2703 |      0.9270  
           watch |   0.4698 |      0.7793  
              hp |   0.4530 |      0.7948  
          bcycle |   0.3880 |      0.8494  
        motorcyc |   0.5722 |      0.6726  
      animdrcart |   0.0142 |      0.9998  
             car |   0.4318 |      0.8135  
            boat |  -0.0239 |      0.9994  
          bankac |   0.5013 |      0.7487  
     matfloor_11 |  -0.2620 |      0.9314  
     matfloor_21 |  -0.2659 |      0.9293  
     matfloor_22 |  -0.1757 |      0.9691  
     matfloor_31 |  -0.0014 |      1.0000  
     matfloor_32 |   0.0020 |      1.0000  
     matfloor_33 |   0.6012 |      0.6386  
     matfloor_34 |   0.0649 |      0.9958  
     matfloor_35 |  -0.1907 |      0.9636  
     matfloor_36 |  -0.0056 |      1.0000  
     matfloor_96 |  -0.0239 |      0.9994  
      matroof_12 |  -0.2406 |      0.9421  
      matroof_13 |  -0.1645 |      0.9729  
      matroof_21 |  -0.0140 |      0.9998  
      matroof_22 |  -0.0299 |      0.9991  
      matroof_23 |  -0.0276 |      0.9992  
      matroof_31 |  -0.2179 |      0.9525  
      matroof_32 |  -0.0103 |      0.9999  
      matroof_33 |   0.3120 |      0.9026  
      matroof_34 |   0.0742 |      0.9945  
      matroof_35 |   0.1423 |      0.9797  
      matroof_36 |  -0.0252 |      0.9994  
      matroof_96 |  -0.0132 |      0.9998  
      matwall_12 |  -0.2162 |      0.9533  
      matwall_21 |  -0.0530 |      0.9972  
      matwall_22 |  -0.0051 |      1.0000  
      matwall_23 |  -0.0563 |      0.9968  
      matwall_24 |  -0.0537 |      0.9971  
      matwall_25 |   0.0025 |      1.0000  
      matwall_26 |  -0.0300 |      0.9991  
      matwall_31 |  -0.1720 |      0.9704  
      matwall_32 |  -0.0107 |      0.9999  
      matwall_34 |   0.0073 |      0.9999  
      matwall_35 |   0.5677 |      0.6778  
      matwall_36 |  -0.3949 |      0.8440  
      matwall_37 |   0.0126 |      0.9998  
      matwall_38 |  -0.0473 |      0.9978  
      matwall_96 |  -0.0339 |      0.9989  
           house |   0.1621 |      0.9737  
            land |   0.1270 |      0.9839  
    memsleep_i~r |  -0.2909 |      0.9154  
       cowbull_1 |   0.0342 |      0.9988  
       cowbull_2 |   0.0349 |      0.9988  
       cowbull_3 |   0.0625 |      0.9961  
        buffal_1 |  -0.0342 |      0.9988  
        buffal_2 |   0.0055 |      1.0000  
        buffal_3 |   0.0118 |      0.9999  
         horse_1 |  -0.0309 |      0.9990  
         horse_2 |  -0.0027 |      1.0000  
          goat_1 |  -0.0328 |      0.9989  
          goat_2 |   0.0384 |      0.9985  
          goat_3 |   0.0457 |      0.9979  
           pig_1 |  -0.2875 |      0.9173  
           pig_2 |  -0.0499 |      0.9975  
           pig_3 |  -0.0067 |      1.0000  
       chicken_1 |  -0.1350 |      0.9818  
       chicken_2 |   0.0986 |      0.9903  
       chicken_3 |   0.1114 |      0.9876  
    landarea_i~r |   0.0578 |      0.9967  
    floorarea_~r |   0.4918 |      0.7581  
    ---------------------------------------

. predict wi_reduce_rur if hv025 == 2
(option regression assumed; regression scoring)

Scoring coefficients (method = regression)

    ------------------------
        Variable |  Factor1 
    -------------+----------
     electricity |  0.07547 
           radio |  0.04072 
      television |  0.11712 
       telephone |  0.01360 
        computer |  0.08951 
    refrigerator |  0.12753 
             fan |  0.11422 
     washingmach |  0.10571 
         aircond |  0.05154 
           watch |  0.08959 
              hp |  0.08639 
          bcycle |  0.07400 
        motorcyc |  0.10912 
      animdrcart |  0.00270 
             car |  0.08236 
            boat | -0.00455 
          bankac |  0.09560 
     matfloor_11 | -0.04996 
     matfloor_21 | -0.05070 
     matfloor_22 | -0.03351 
     matfloor_31 | -0.00027 
     matfloor_32 |  0.00037 
     matfloor_33 |  0.11465 
     matfloor_34 |  0.01237 
     matfloor_35 | -0.03637 
     matfloor_36 | -0.00106 
     matfloor_96 | -0.00456 
      matroof_12 | -0.04588 
      matroof_13 | -0.03138 
      matroof_21 | -0.00267 
      matroof_22 | -0.00571 
      matroof_23 | -0.00527 
      matroof_31 | -0.04156 
      matroof_32 | -0.00196 
      matroof_33 |  0.05950 
      matroof_34 |  0.01416 
      matroof_35 |  0.02715 
      matroof_36 | -0.00482 
      matroof_96 | -0.00252 
      matwall_12 | -0.04123 
      matwall_21 | -0.01011 
      matwall_22 | -0.00098 
      matwall_23 | -0.01074 
      matwall_24 | -0.01024 
      matwall_25 |  0.00048 
      matwall_26 | -0.00572 
      matwall_31 | -0.03280 
      matwall_32 | -0.00203 
      matwall_34 |  0.00140 
      matwall_35 |  0.10826 
      matwall_36 | -0.07532 
      matwall_37 |  0.00240 
      matwall_38 | -0.00903 
      matwall_96 | -0.00646 
           house |  0.03091 
            land |  0.02422 
    memsleep_i~r | -0.05548 
       cowbull_1 |  0.00652 
       cowbull_2 |  0.00665 
       cowbull_3 |  0.01192 
        buffal_1 | -0.00652 
        buffal_2 |  0.00105 
        buffal_3 |  0.00226 
         horse_1 | -0.00589 
         horse_2 | -0.00052 
          goat_1 | -0.00625 
          goat_2 |  0.00733 
          goat_3 |  0.00871 
           pig_1 | -0.05483 
           pig_2 | -0.00951 
           pig_3 | -0.00128 
       chicken_1 | -0.02575 
       chicken_2 |  0.01880 
       chicken_3 |  0.02125 
    landarea_i~r |  0.01102 
    floorarea_~r |  0.09380 
    ------------------------


. 
. gen wi_reduce_urbrur = wi_reduce_urb
(23,403 missing values generated)

.         lab var wi_reduce_urbrur "Indeks kekayaan (tereduksi, kota/desa)"

.         replace wi_reduce_urbrur = wi_reduce_rur if hv025 == 2
(23,403 real changes made)

. 
. drop wi_reduce_urb wi_reduce_rur

. 
. *\ringkasan
. summ wi_reduce_urbrur

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
wi_reduce_~r |     47,963   -1.07e-10    .9999896  -3.693398   3.646859

. histogram wi_reduce_urbrur, density normal
(bin=46, start=-3.693398, width=.1595708)

. graph export ".\output\hist_wi_reduce_urbrur.png", replace
(file .\output\hist_wi_reduce_urbrur.png not found)
file .\output\hist_wi_reduce_urbrur.png saved as PNG format

. sepscatter hv271 wi_reduce_urbrur, separate(hv025)

. graph export ".\output\scat_wi_reduce_urbrur.png", replace
(file .\output\scat_wi_reduce_urbrur.png not found)
file .\output\scat_wi_reduce_urbrur.png saved as PNG format

. 
. /*
> ******************************************************************
> Komposit/Kombinasi                                                                                      [done]
> ******************************************************************
> */
. 
. /*
> ------------------------------------------------------------------
> Regress                                                                                                         [done]
> ------------------------------------------------------------------
> */
. 
. *\kota
. regress wi_reduce_all wi_reduce_urbrur if hv025 == 1

      Source |       SS           df       MS      Number of obs   =    24,560
-------------+----------------------------------   F(1, 24558)     >  99999.00
       Model |  19599.8539         1  19599.8539   Prob > F        =    0.0000
    Residual |  145.400922    24,558  .005920715   R-squared       =    0.9926
-------------+----------------------------------   Adj R-squared   =    0.9926
       Total |  19745.2548    24,559  .803992623   Root MSE        =    .07695

----------------------------------------------------------------------------------
   wi_reduce_all | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
wi_reduce_urbrur |   .8933488    .000491  1819.45   0.000     .8923864    .8943112
           _cons |   .4200825    .000491   855.58   0.000     .4191201    .4210449
----------------------------------------------------------------------------------

. predict wi_1
(option xb assumed; fitted values)

. 
. *\desa
. regress wi_reduce_all wi_reduce_urbrur if hv025 == 2

      Source |       SS           df       MS      Number of obs   =    23,403
-------------+----------------------------------   F(1, 23401)     >  99999.00
       Model |   19166.996         1   19166.996   Prob > F        =    0.0000
    Residual |  167.307228    23,401  .007149576   R-squared       =    0.9913
-------------+----------------------------------   Adj R-squared   =    0.9913
       Total |  19334.3033    23,402  .826181662   Root MSE        =    .08456

----------------------------------------------------------------------------------
   wi_reduce_all | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------+----------------------------------------------------------------
wi_reduce_urbrur |   .9050041   .0005527  1637.33   0.000     .9039207    .9060875
           _cons |  -.4408506   .0005527  -797.60   0.000     -.441934   -.4397672
----------------------------------------------------------------------------------

. predict wi_2
(option xb assumed; fitted values)

. 
. *\skor
. gen wi_reduce_combine = .
(47,963 missing values generated)

.         lab var wi_reduce_combine "Indeks kekayaan (tereduksi, kombinasi)"

.         replace wi_reduce_combine = wi_1 if hv025 == 1
(24,560 real changes made)

.         replace wi_reduce_combine = wi_2 if hv025 == 2
(23,403 real changes made)

. 
. drop wi_1 wi_2

. 
. *\ringkasan
. summ wi_reduce_combine

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
wi_reduce_~e |     47,963    7.31e-11    .9967347  -3.068229   3.387419

. histogram wi_reduce_combine, density normal
(bin=46, start=-3.0682287, width=.14034017)

. graph export ".\output\hist_wi_reduce_combine.png", replace
(file .\output\hist_wi_reduce_combine.png not found)
file .\output\hist_wi_reduce_combine.png saved as PNG format

. sepscatter hv271a wi_reduce_combine, separate(hv025)

. graph export ".\output\scat_wi_reduce_combine.png", replace
(file .\output\scat_wi_reduce_combine.png not found)
file .\output\scat_wi_reduce_combine.png saved as PNG format

. 
. /*
> ******************************************************************
> Kuintil indeks                                                                                          [done]
> ******************************************************************
> */
. 
. *\kota/desa
. xtile wiq_reduce_urb = wi_reduce_urbrur if hv025 == 1 [pw = hmweight], nq(5)

. xtile wiq_reduce_rur = wi_reduce_urbrur if hv025 == 2 [pw = hmweight], nq(5)

. gen wiq_reduce_urbrur = .
(47,963 missing values generated)

.         lab var wiq_reduce_urbrur "Kuintil indeks kekayaan (tereduksi, kota-desa)"

.         replace wiq_reduce_urbrur = wiq_reduce_urb if hv025 == 1
(24,560 real changes made)

.         replace wiq_reduce_urbrur = wiq_reduce_rur if hv025 == 2
(23,403 real changes made)

. drop wiq_reduce_urb wiq_reduce_rur

. 
. tab hv270a wiq_reduce_urbrur

    wealth |
 index for |
urban/rura |     Kuintil indeks kekayaan (tereduksi, kota-desa)
         l |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
   poorest |    11,616      1,585         31          0          0 |    13,232 
    poorer |     1,885      6,556      1,652         80          0 |    10,173 
    middle |         3      2,021      5,487      1,284         19 |     8,814 
    richer |         0          1      1,464      5,927        741 |     8,133 
   richest |         0          0          0        743      6,868 |     7,611 
-----------+-------------------------------------------------------+----------
     Total |    13,504     10,163      8,634      8,034      7,628 |    47,963 

. 
. *\kombinasi
. xtile wiq_reduce_combine = wi_reduce_combine [pw = hmweight], nq(5)

.         lab var wiq_reduce_combine "Kuintil indeks kekayaan (tereduksi, kombinasi)"

. 
. tab hv270 wiq_reduce_combine

    wealth |
     index |     Kuintil indeks kekayaan (tereduksi, kombinasi)
  combined |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
   poorest |    11,447      1,400         10          0          0 |    12,857 
    poorer |     1,824      6,211      1,507         51          0 |     9,593 
    middle |         0      2,060      5,651      1,169         12 |     8,892 
    richer |         0          0      1,448      6,304        732 |     8,484 
   richest |         0          0          0        658      7,479 |     8,137 
-----------+-------------------------------------------------------+----------
     Total |    13,271      9,671      8,616      8,182      8,223 |    47,963 

. 
. /*
> ******************************************************************
> Desil indeks                                                                                            [done]
> ******************************************************************
> */
. 
. *\kota/desa
. xtile wid_reduce_urb = wi_reduce_urbrur if hv025 == 1 [pw = hmweight], nq(10)

. xtile wid_reduce_rur = wi_reduce_urbrur if hv025 == 2 [pw = hmweight], nq(10)

. gen wid_reduce_urbrur = .
(47,963 missing values generated)

.         lab var wid_reduce_urbrur "Desil indeks kekayaan (tereduksi, kota-desa)"

.         replace wid_reduce_urbrur = wid_reduce_urb if hv025 == 1
(24,560 real changes made)

.         replace wid_reduce_urbrur = wid_reduce_rur if hv025 == 2
(23,403 real changes made)

. drop wid_reduce_urb wid_reduce_rur

. 
. tab wid_reduce_urbrur

      Desil |
     indeks |
   kekayaan |
(tereduksi, |
 kota-desa) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      7,571       15.79       15.79
          2 |      5,933       12.37       28.16
          3 |      5,257       10.96       39.12
          4 |      4,906       10.23       49.34
          5 |      4,500        9.38       58.73
          6 |      4,134        8.62       67.35
          7 |      4,037        8.42       75.76
          8 |      3,997        8.33       84.10
          9 |      3,937        8.21       92.30
         10 |      3,691        7.70      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. *\kombinasi
. xtile wid_reduce_combine = wi_reduce_combine [pw = hmweight], nq(10)

.         lab var wid_reduce_combine "Desil indeks kekayaan (tereduksi, kombinasi)"

. 
. tab wid_reduce_combine

      Desil |
     indeks |
   kekayaan |
(tereduksi, |
 kombinasi) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      7,518       15.67       15.67
          2 |      5,753       11.99       27.67
          3 |      5,103       10.64       38.31
          4 |      4,568        9.52       47.83
          5 |      4,363        9.10       56.93
          6 |      4,253        8.87       65.80
          7 |      4,129        8.61       74.41
          8 |      4,053        8.45       82.86
          9 |      4,110        8.57       91.42
         10 |      4,113        8.58      100.00
------------+-----------------------------------
      Total |     47,963      100.00

. 
. 
. 
. /*
> ================================================================================
> FINALISASI
> ================================================================================
> */
. 
. keep hhid v001 v002 hv024 hv025 hhweight hmweight house land    ///
>          drinkwat_11-chicken_3 memsleep_* floorarea_* landarea_*        ///
>          wi_* wiq_* wid_*

. order hhid v001 v002 hv024 hv025 hhweight hmweight house land   ///
>          drinkwat_11-chicken_3 memsleep_* floorarea_* landarea_*        ///
>          wi_* wiq_* wid_*

. sort v001 v002

. 
. quietly compress

. datasignature set, reset
  47963:138(75172):139318564:3617937786       (data signature set)

. lab data "Perhitungan indeks kekayaan \ `time_date'"

. note: `idhs'-mortstudy-wealth.dta \ `tag'

. save `savenm', replace
file dta\1-wealth-index-idhs17.dta saved

. 
. 
. *close log-file
. log close _all
      name:  log_1_wealth_index_idhs17
       log:  D:\RESEARCH & WRITING\master thesis_child mortality\stata\log\1_wealth_index_idhs17.log
  log type:  text
 closed on:  25 Jan 2022, 10:28:21
----------------------------------------------------------------------------------------------------------------------------------
