----------------------------------------------------------------------------------------------------------------------------------
      name:  log_3_vars_women_idhs17
       log:  D:\RESEARCH & WRITING\master thesis_child mortality\stata\log\3_vars_women_idhs17.log
  log type:  text
 opened on:  15 Dec 2021, 16:32:09

. 
. /*
> ================================================================================
> ********************************************************************************
> PROJECT:
> PENELITIAN TESIS
> DEPRIVASI LINGKUNGAN RUMAH TANGGA DAN KEMATIAN BAYI DAN ANAK DI INDONESIA
> 
> SYNTAX:
> 3-MEMBENTUK VARIABEL PEREMPUAN/IBU
> 
> PENULIS:
> ARI PURWANTO SARWO PRASOJO (2006500321)
> MAGISTER EKONOMI KEPENDUDUKAN DAN KETENAGAKERJAAN
> FEB, UNIVERSITAS INDONESIA
> 2021
> ********************************************************************************
> ================================================================================
> */
. 
. 
. 
. /*
> ================================================================================
> PENYIAPAN
> ================================================================================
> */
. 
. clear all

. macro drop _all

. set maxvar 10000


. 
. *direktori kerja
. loc dtadir              "dta"

. 
. *set the date
. loc date = c(current_date)

. loc time = c(current_time)

. loc time_date = "`date'" + "_" + "`time'"

. loc tag "`dfn'.do Ari Prasojo `time_date'"

. 
. *direktori dataset
. *\dataset rumah tangga
. loc irc                 "D:\PUSDATIN\DATA MIKRO\IDHS\2017\IDIR71DT\IDIR71FL.dta"

. 
. *\dataset disimpan sebagai (nama)
. loc savenm              "`dtadir'\3-vars-women-`idhs'.dta"

. 
. *read data
. use "`irc'"

. 
. *membuat label
. lab def yatidak 0 "Tidak" 1 "Ya"                        //yatidak

. 
. 
. 
. /*
> ================================================================================
> VARIABEL-VARIABEL IBU
> ================================================================================
> */
. 
. *\Penimbang individu perempuan
. gen wweight = v005/1000000

. lab var wweight "Penimbang perempuan"

. 
. /*
> ******************************************************************
> Pendidikan ibu                                                                                          [done]
> ******************************************************************
> */
. 
. *\Raw, 4 kategori
. clonevar meduc4c = v106

.         lab var meduc4c "Pendidikan tertinggi yang ditamatkan ibu"

.         lab def meduc4c 0 "Tidak sekolah"                                                                       ///
>                                         1 "Dasar"                                                                               
>         ///
>                                         2 "Menengah"                                                                            
> ///
>                                         3 "Tinggi", replace

.         lab val meduc4c meduc4c

.         tab meduc4c, m 

   Pendidikan |
    tertinggi |
         yang |
   ditamatkan |
          ibu |      Freq.     Percent        Cum.
--------------+-----------------------------------
Tidak sekolah |        904        1.82        1.82
        Dasar |     12,259       24.70       26.52
     Menengah |     27,340       55.09       81.61
       Tinggi |      9,124       18.39      100.00
--------------+-----------------------------------
        Total |     49,627      100.00

. 
. *\3 kategori (tidak sekolah, dasar, menengah/lebih tinggi)
. recode meduc4c (0 = 0 "Tidak sekolah")                                                                  ///
>                            (1 = 1 "Dasar")                                                                                      
> ///
>                            (2 3 = 2 "Menengah/lebih tinggi"), gen(meduc)
(9124 differences between meduc4c and meduc)

.         lab var meduc "Pendidikan tertinggi yang ditamatkan ibu"

.         tab meduc, m

 Pendidikan tertinggi |
  yang ditamatkan ibu |      Freq.     Percent        Cum.
----------------------+-----------------------------------
        Tidak sekolah |        904        1.82        1.82
                Dasar |     12,259       24.70       26.52
Menengah/lebih tinggi |     36,464       73.48      100.00
----------------------+-----------------------------------
                Total |     49,627      100.00

. 
. *\3 kategori (tidak/dasar, menengah, tinggi)
. recode meduc4c (0/1 = 0 "Tidak sekolah/dasar")                                                  ///
>                            (2 = 1 "Menengah")                                                                           ///
>                            (3 = 2 "Tinggi"), gen(meduc3c)
(48723 differences between meduc4c and meduc3c)

.         lab var meduc3c "Pendidikan tertinggi yang ditamatkan ibu"

.         tab meduc3c, m

         Pendidikan |
     tertinggi yang |
     ditamatkan ibu |      Freq.     Percent        Cum.
--------------------+-----------------------------------
Tidak sekolah/dasar |     13,163       26.52       26.52
           Menengah |     27,340       55.09       81.61
             Tinggi |      9,124       18.39      100.00
--------------------+-----------------------------------
              Total |     49,627      100.00

.         
. *\2 kategori (tidak sekolah, dasar/lebih tinggi)
. recode meduc4c (0 = 0 "Tidak sekolah")                                                                  ///
>                            (1/3 = 1 "Dasar/lebih tinggi"), gen(meduc2c)
(36464 differences between meduc4c and meduc2c)

.         lab var meduc2c "Pendidikan tertinggi yang ditamatkan ibu"

.         tab meduc2c, m

        Pendidikan |
    tertinggi yang |
    ditamatkan ibu |      Freq.     Percent        Cum.
-------------------+-----------------------------------
     Tidak sekolah |        904        1.82        1.82
Dasar/lebih tinggi |     48,723       98.18      100.00
-------------------+-----------------------------------
             Total |     49,627      100.00

.                 
. *\2 kategori (tidak/dasar, menengah/lebih tinggi)
. recode meduc (0 1 = 0 "Tidak sekolah/dasar")                                                    ///
>                          (2 3 = 1 "Menengah/lebih tinggi"),     gen(meduc2cs)
(48723 differences between meduc and meduc2cs)

.         lab var meduc2cs "Pendidikan tertinggi yang ditamatkan ibu"

.         tab meduc2cs, m

 Pendidikan tertinggi |
  yang ditamatkan ibu |      Freq.     Percent        Cum.
----------------------+-----------------------------------
  Tidak sekolah/dasar |     13,163       26.52       26.52
Menengah/lebih tinggi |     36,464       73.48      100.00
----------------------+-----------------------------------
                Total |     49,627      100.00

. 
. *\2 kategori (tidak/dasar/menengah, tinggi)
. recode meduc4c (0/2 = 0 "Tidak sekolah/dasar")                                                  ///
>                            (3 = 1 "Tinggi"), gen(meduc2ch)
(48723 differences between meduc4c and meduc2ch)

.         lab var meduc2ch "Pendidikan tertinggi yang ditamatkan ibu"

.         tab meduc2ch, m

         Pendidikan |
     tertinggi yang |
     ditamatkan ibu |      Freq.     Percent        Cum.
--------------------+-----------------------------------
Tidak sekolah/dasar |     40,503       81.61       81.61
             Tinggi |      9,124       18.39      100.00
--------------------+-----------------------------------
              Total |     49,627      100.00

. 
. *\kontinyu, lama tahun sekolah
. clonevar meducy = v133
(38 missing values generated)

.         replace meducy = . if inlist(v133,97,98)
(14 real changes made, 14 to missing)

.         lab var meducy "Lama tahun sekolah ibu"

.         summ meducy

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      meducy |     49,575    9.954473    4.025923          0         18

. 
. /*
> ******************************************************************
> Pendidikan ayah/pasangan dari ibu                                                       [done]
> ******************************************************************
> */
. 
. *\Raw, 4 kategori
. clonevar peduc4c = v701
(15,218 missing values generated)

.         replace peduc4c = . if peduc4c == 8                     /*don't know*/
(54 real changes made, 54 to missing)

.         lab var peduc4c "Pendidikan tertinggi yang ditamatkan ayah"

.         lab val peduc4c meduc4c

.         tab peduc4c, m

   Pendidikan |
    tertinggi |
         yang |
   ditamatkan |
         ayah |      Freq.     Percent        Cum.
--------------+-----------------------------------
Tidak sekolah |        620        1.25        1.25
        Dasar |     10,580       21.32       22.57
     Menengah |     18,463       37.20       59.77
       Tinggi |      4,692        9.45       69.23
            . |     15,272       30.77      100.00
--------------+-----------------------------------
        Total |     49,627      100.00

. 
. *\3 kategori (tidak sekolah, dasar, menengah/lebih tinggi)
. recode peduc4c (0 = 0 "Tidak sekolah")                                                                  ///
>                            (1 = 1 "Dasar")                                                                                      
> ///
>                            (2 3 = 2 "Menengah/lebih tinggi"), gen(peduc)
(4692 differences between peduc4c and peduc)

.         lab var peduc "Pendidikan tertinggi yang ditamatkan ayah"

.         tab peduc, m

 Pendidikan tertinggi |
 yang ditamatkan ayah |      Freq.     Percent        Cum.
----------------------+-----------------------------------
        Tidak sekolah |        620        1.25        1.25
                Dasar |     10,580       21.32       22.57
Menengah/lebih tinggi |     23,155       46.66       69.23
                    . |     15,272       30.77      100.00
----------------------+-----------------------------------
                Total |     49,627      100.00

. 
. *\3 kategori (tidak/dasar, menengah, tinggi)
. recode peduc4c (0/1 = 0 "Tidak sekolah/dasar")                                                  ///
>                            (2 = 1 "Menengah")                                                                           ///
>                            (3 = 2 "Tinggi"), gen(peduc3c)
(33735 differences between peduc4c and peduc3c)

.         lab var peduc3c "Pendidikan tertinggi yang ditamatkan ayah"

.         tab peduc3c, m

         Pendidikan |
     tertinggi yang |
    ditamatkan ayah |      Freq.     Percent        Cum.
--------------------+-----------------------------------
Tidak sekolah/dasar |     11,200       22.57       22.57
           Menengah |     18,463       37.20       59.77
             Tinggi |      4,692        9.45       69.23
                  . |     15,272       30.77      100.00
--------------------+-----------------------------------
              Total |     49,627      100.00

.         
. *\2 kategori (tidak sekolah, dasar/lebih tinggi)
. recode peduc4c (0 = 0 "Tidak sekolah")                                                                  ///
>                            (1/3 = 1 "Dasar/lebih tinggi"), gen(peduc2c)
(23155 differences between peduc4c and peduc2c)

.         lab var peduc2c "Pendidikan tertinggi yang ditamatkan ayah"

.         tab peduc2c, m

        Pendidikan |
    tertinggi yang |
   ditamatkan ayah |      Freq.     Percent        Cum.
-------------------+-----------------------------------
     Tidak sekolah |        620        1.25        1.25
Dasar/lebih tinggi |     33,735       67.98       69.23
                 . |     15,272       30.77      100.00
-------------------+-----------------------------------
             Total |     49,627      100.00

.                 
. *\2 kategori (tidak/dasar, menengah/lebih tinggi)
. recode peduc (0 1 = 0 "Tidak sekolah/dasar")                                                    ///
>                          (2 3 = 1 "Menengah/lebih tinggi"), gen(peduc2cs)
(33735 differences between peduc and peduc2cs)

.         lab var peduc2cs "Pendidikan tertinggi yang ditamatkan ayah"

.         tab peduc2cs, m

 Pendidikan tertinggi |
 yang ditamatkan ayah |      Freq.     Percent        Cum.
----------------------+-----------------------------------
  Tidak sekolah/dasar |     11,200       22.57       22.57
Menengah/lebih tinggi |     23,155       46.66       69.23
                    . |     15,272       30.77      100.00
----------------------+-----------------------------------
                Total |     49,627      100.00

. 
. *\2 kategori (tidak/dasar/menengah, tinggi)
. recode peduc4c (0/2 = 0 "Tidak sekolah/dasar")                                                  ///
>                            (3 = 1 "Tinggi"), gen(peduc2ch)
(33735 differences between peduc4c and peduc2ch)

.         lab var peduc2ch "Pendidikan tertinggi yang ditamatkan ayah"

.         tab peduc2ch, m

         Pendidikan |
     tertinggi yang |
    ditamatkan ayah |      Freq.     Percent        Cum.
--------------------+-----------------------------------
Tidak sekolah/dasar |     29,663       59.77       59.77
             Tinggi |      4,692        9.45       69.23
                  . |     15,272       30.77      100.00
--------------------+-----------------------------------
              Total |     49,627      100.00

. 
. *\kontinyu, lama tahun sekolah
. clonevar peducy = v715
(15,229 missing values generated)

.         replace peducy = . if inlist(v715,97,98)
(118 real changes made, 118 to missing)

.         lab var peducy "Lama tahun sekolah ayah"

.         summ peducy

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      peducy |     34,280    9.595099    4.143316          0         18

.         
. /*
> ******************************************************************
> Pendidikan ibu-ayah                                                                                     [done]
> ******************************************************************
> */
. 
. /*
> gen pareduc1 = .
>         replace pareduc1 = 0 if meduc2c == 0 & peduc2c == 0
>         replace pareduc1 = 1 if meduc2c == 0 & peduc2c == 1
>         replace pareduc1 = 2 if meduc2c == 1 & peduc2c == 0
>         replace pareduc1 = 3 if meduc2c == 1 & peduc2c == 1
>         lab var pareduc1 "Pendidikan orang tua (ibu-ayah)"
>         lab def pareduc1 0 "Tidak-tidak"                                                                        ///
>                                          1 "Tidak-berpendidikan"                                                        ///
>                                          2 "Berpendidikan-tidak"                                                        ///
>                                          3 "Berpendidikan",                                                                     
> ///
>                                         replace
>         lab val pareduc1 pareduc1
>         tab pareduc1, m
> */
. 
. gen pareduc = .
(49,627 missing values generated)

.         replace pareduc = 0 if meduc2cs == 0 & peduc2cs == 0
(7,397 real changes made)

.         replace pareduc = 1 if meduc2cs == 0 & peduc2cs == 1
(4,000 real changes made)

.         replace pareduc = 2 if meduc2cs == 1 & peduc2cs == 0
(3,803 real changes made)

.         replace pareduc = 3 if meduc2cs == 1 & peduc2cs == 1
(19,155 real changes made)

.         lab var pareduc "Pendidikan orang tua (ibu-ayah)"

.         lab def pareduc 0 "Rendah"                                                                                      ///
>                                     1 "Ibu < ayah"                                                                              
> ///
>                                     2 "Ibu > ayah"                                                                              
> ///
>                                     3  "Tinggi",                                                                                
> ///
>                                     replace

.         lab val pareduc pareduc

.         tab pareduc, m

 Pendidikan |
  orang tua |
 (ibu-ayah) |      Freq.     Percent        Cum.
------------+-----------------------------------
     Rendah |      7,397       14.91       14.91
 Ibu < ayah |      4,000        8.06       22.97
 Ibu > ayah |      3,803        7.66       30.63
     Tinggi |     19,155       38.60       69.23
          . |     15,272       30.77      100.00
------------+-----------------------------------
      Total |     49,627      100.00

. 
. 
. /*
> gen pareduc = .
>         replace pareduc = 0 if meduc2cs == 0 & peduc2cs == 0
>         replace pareduc = 1 if meduc2cs == 1 & peduc2cs == 1
>         replace pareduc = 2 if meduc2cs == 0 & peduc2cs == 1
>         replace pareduc = 3 if meduc2cs == 1 & peduc2cs == 0
>         lab var pareduc "Pendidikan orang tua (ibu-ayah)"
>         lab def pareduc 0 "Rendah"                                                                                      ///
>                                     1 "Tinggi"                                                                                  
> ///
>                                     2 "Ibu < ayah"                                                                              
> ///
>                                     3 "Ibu > ayah",                                                                             
> ///
>                                     replace
>         lab val pareduc pareduc
>         tab pareduc, m
> */
. 
. /*
> gen pareduc1 = .
>         replace pareduc1 = 0 if meduc2ch == 0 & peduc2ch == 0
>         replace pareduc1 = 1 if meduc2ch == 1 & peduc2ch == 1
>         replace pareduc1 = 2 if meduc2ch == 0 & peduc2ch == 1
>         replace pareduc1 = 3 if meduc2ch == 1 & peduc2ch == 0
>         lab var pareduc1 "Pendidikan orang tua (ibu-ayah)"
>         lab val pareduc1 pareduc
>         tab pareduc1, m
> 
> gen difmpeducy = meducy-peducy
>         lab var difmpeducy "Perbedaan lama tahun sekolah ibu-ayah"
> 
> gen ratmpeducy = meducy/peducy
>         lab var ratmpeducy "Rasio lama tahun sekolah ibu-ayah"
>         
> gen difpmeducy = peducy-meducy
>         lab var difpmeducy "Perbedaan lama tahun sekolah ibu-ayah"
> 
> gen ratpmeducy = peducy/meducy
>         lab var ratpmeducy "Rasio lama tahun sekolah ibu-ayah"
> */
.         
. /*
> gen mating = .
>         replace mating = 0 if meduc2cs == 0 & peduc2cs == 0
>         replace mating = 1 if meduc2cs == 1 & peduc2cs == 1
>         replace mating = 2 if meduc2cs == 0 & peduc2cs == 1
>         replace mating = 3 if meduc2cs == 1 & peduc2cs == 0
>         lab var mating "Assortative pendidikan orang tua"
>         lab def mating 0 "Homogami-rendah"                                                                      ///
>                                    1 "Homogami-tinggi"                                                                  ///
>                                    2 "Hipergami"                                                                                
> ///
>                                    3 "Hipogami",                                                                                
> ///
>                                    replace
>         lab val mating mating
>         tab mating, m
> */
.         
. /*
> ******************************************************************
> Jarak ke fasilitas kesehatan (persepsi)                                         [done]
> ******************************************************************
> */
. 
. recode v467d (2 = 0 "Tidak/tidak masalah")                                                              ///
>                          (1 = 1 "Masalah"), gen(mdisthfac)
(43814 differences between v467d and mdisthfac)

.         lab var mdisthfac "Jarak ke fasilitas kesehatan untuk mendapatkan pertolongan medis"

.         tab mdisthfac, m

 Jarak ke fasilitas |
    kesehatan untuk |
        mendapatkan |
  pertolongan medis |      Freq.     Percent        Cum.
--------------------+-----------------------------------
Tidak/tidak masalah |     43,814       88.29       88.29
            Masalah |      5,776       11.64       99.93
                  . |         37        0.07      100.00
--------------------+-----------------------------------
              Total |     49,627      100.00

. 
. 
.                 
. /*
> ================================================================================
> FINALISASI
> ================================================================================
> */
. 
. keep v001 v002 v003 wweight-mdisthfac                                                   

. order v001 v002 v003 wweight-mdisthfac

.          
. quietly compress

. datasignature set, reset
  49627:20(46772):2103933715:3649089393       (data signature set)

. lab data "Variabel perempuan \ `time_date'"

. note: `idhs'-mortstudy-women.dta \ `tag'

. save "`savenm'", replace
(file dta\3-vars-women-.dta not found)
file dta\3-vars-women-.dta saved

. 
end of do-file

. do "D:\RESEARCH & WRITING\master thesis_child mortality\stata\do\4-vars-birth.do"

. log close _all
      name:  log_3_vars_women_idhs17
       log:  D:\RESEARCH & WRITING\master thesis_child mortality\stata\log\3_vars_women_idhs17.log
  log type:  text
 closed on:  15 Dec 2021, 16:32:28
----------------------------------------------------------------------------------------------------------------------------------
