----------------------------------------------------------------------------------------------------------------------------------
      name:  log_8_data_model_idhs17
       log:  D:\RESEARCH & WRITING\master thesis_child mortality\stata\log\8_data_model_idhs17.log
  log type:  text
 opened on:  15 Dec 2021, 16:38:05

. 
. /*
> ================================================================================
> ********************************************************************************
> PROJECT:
> PENELITIAN TESIS
> DEPRIVASI LINGKUNGAN RUMAH TANGGA DAN KEMATIAN BAYI DAN ANAK DI INDONESIA
> 
> SYNTAX:
> 8a-MENYIAPKAN DATA UNTUK PEMODELAN
> 
> PENULIS:
> ARI PURWANTO SARWO PRASOJO (2006500321)
> MAGISTER EKONOMI KEPENDUDUKAN DAN KETENAGAKERJAAN
> FEB, UNIVERSITAS INDONESIA
> 2021
> ********************************************************************************
> ================================================================================
> */
. 
. 
. 
. /*
> ================================================================================
> PENYIAPAN
> ================================================================================
> */
. 
. clear all

. macro drop _all

. set maxvar 10000


. 
. *direktori kerja
. loc dtadir              "dta"

. *loc outdir             "output"
. 
. *tag
. loc date = c(current_date)

. loc time = c(current_time)

. loc time_date = "`date'" + "_" + "`time'"

. loc tag "`dfn'.do Ari Prasojo `time_date'"

. 
. *data
. loc dta                 "`dtadir'\6-chmort-`idhs'.dta"

. loc savenm              "`dtadir'\8-data-model-`idhs'.dta"

. 
. *set sampel
. loc sett                "precsvy10==1 & nomisvaruse==1"

. 
. *vars
. #delimit ;
delimiter now ;
. glo vars
>         /*lokasi*/
>         psu prov
>                 
>         /*bobot*/
>         wweight hhweight
>         
>         /*var terikat*/
>         nndeath agenndeath
>         ideath ageideathd
>         u5death ageu5deathd
>         
>         /*var bebas*/
>         depriv depriv2c chsex bordin
>         mageb pareduc wealth reside pwdisthfac
>         ;

. #delimit cr
delimiter now cr
. 
. *id
. #delimit ;
delimiter now ;
. glo id
>         /*id*/
>         bidx_str clust_str hid_str mid_str birthid
>         ;

. #delimit cr
delimiter now cr
. 
. 
. /*
> ================================================================================
> EKSPANSI DATA ANAK -> ANAK-PERIODE - NNDEATH
> ================================================================================
> */
. 
. /*
> ******************************************************************
> Set                                                                                                                     [done]
> ******************************************************************
> */
. 
. use `dta'
(Data merge\ 15 Dec 2021_16:33:10)

. 
. *cek missing
. foreach p in $vars {
  2.         nmissing `p'
  3. }

nndeath            35

agenndeath         35

ideath             35

ageideathd         35

u5death            35

ageu5deathd        35

depriv             37

depriv2c           37

pareduc          5737

. 
. *\Birth id
. tostring(bidx), g(bidx_str)
bidx_str generated as str2

. tostring(v001), g(clust_str)
clust_str generated as str4

. tostring(v002), g(hid_str)
hid_str generated as str2

. tostring(v003), g(mid_str)
mid_str generated as str2

. gen birthid = clust_str + "_" + hid_str + "_" + mid_str + "_" + bidx_str

. 
. *set sampel
. gen nomisvaruse = .
(86,265 missing values generated)

.         replace nomisvaruse = 1 if !(chalive == 0 & missing(agedeath)) &        ///
>                                                            !missing(depriv) &                                           ///
>                                                            !missing(pareduc)       
(80,458 real changes made)

. keep if `sett'
(51,457 observations deleted)

. 
. *cek missing
. foreach p in $vars $id {
  2.         nmissing `p'
  3. }

. 
. /*
> ******************************************************************
> Ekspansi                                                                                                        [done]
> ******************************************************************
> */
. 
. *\Diskritisasi
. egen survdis = cut(agenndeath), at(0 7 29) icodes

.         replace survdis = survdis + 1
(34,808 real changes made)

.         lab var survdis "Interval umur"

.         lab def survdis 1 "0-6 hari"                    ///
>                                         2 "7-28 hari"                   ///
>                                         3 "29 hari-5 bulan"     ///
>                                         4 "6-11 bulan"                  ///
>                                         5 "12-23 bulan"                 ///
>                                         6 "24-59 bulan" 

.         lab val survdis survdis

.         *table survdis, c(min agenndeath max agenndeath)
.         table survdis, stat(min agenndeath) stat(max agenndeath)

----------------------------------------------
              |  Minimum value   Maximum value
--------------+-------------------------------
Interval umur |                               
  0-6 hari    |              0               6
  7-28 hari   |              7              28
  Total       |              0              28
----------------------------------------------

.         
. *\Ekspansi data 
. expand survdis
(34,301 observations created)

. bysort birthid: gen interval = _n

. lab val interval survdis

. replace nndeath = 0 if nndeath == 1 & survdis != interval 
(134 real changes made)

. tab interval nndeath, row m

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                |    Meninggal saat
                |   periode neonatal
       interval |     Tidak         Ya |     Total
----------------+----------------------+----------
       0-6 hari |    34,301        507 |    34,808 
                |     98.54       1.46 |    100.00 
----------------+----------------------+----------
      7-28 hari |    34,167        134 |    34,301 
                |     99.61       0.39 |    100.00 
----------------+----------------------+----------
          Total |    68,468        641 |    69,109 
                |     99.07       0.93 |    100.00 

. 
. *\Simpan sementara
. keep interval survdis $vars $id chsingle lastbirth

. gen data = 1

. 
. quietly compress

. save "data-mdl-a.dta", replace
(file data-mdl-a.dta not found)
file data-mdl-a.dta saved

. 
. 
. 
. /*
> ================================================================================
> EKSPANSI DATA ANAK -> ANAK-PERIODE - IDEATH
> ================================================================================
> */
. 
. /*
> ******************************************************************
> Set                                                                                                                     [done]
> ******************************************************************
> */
. 
. clear all

. use `dta'
(Data merge\ 15 Dec 2021_16:33:10)

. 
. *cek missing
. foreach p in $vars {
  2.         nmissing `p'
  3. }

nndeath            35

agenndeath         35

ideath             35

ageideathd         35

u5death            35

ageu5deathd        35

depriv             37

depriv2c           37

pareduc          5737

. 
. *\Birth id
. tostring(bidx), g(bidx_str)
bidx_str generated as str2

. tostring(v001), g(clust_str)
clust_str generated as str4

. tostring(v002), g(hid_str)
hid_str generated as str2

. tostring(v003), g(mid_str)
mid_str generated as str2

. gen birthid = clust_str + "_" + hid_str + "_" + mid_str + "_" + bidx_str

. 
. *set sampel
. gen nomisvaruse = .
(86,265 missing values generated)

.         replace nomisvaruse = 1 if !(chalive == 0 & missing(agedeath)) &        ///
>                                                            !missing(depriv) &                                           ///
>                                                            !missing(pareduc)       
(80,458 real changes made)

. keep if `sett'
(51,457 observations deleted)

. 
. *cek missing
. foreach p in $vars $id {
  2.         nmissing `p'
  3. }

. 
. /*
> ******************************************************************
> Ekspansi                                                                                                        [done]
> ******************************************************************
> */
. 
. *\Diskritisasi
. egen survdis = cut(ageideathd), at(0 7 29 180 360) icodes

.         replace survdis = survdis + 1
(34,808 real changes made)

.         lab var survdis "Interval umur"

.         lab def survdis 1 "0-6 hari"                    ///
>                                         2 "7-28 hari"                   ///
>                                         3 "29 hari-5 bulan"     ///
>                                         4 "6-11 bulan"                  ///
>                                         5 "12-23 bulan"                 ///
>                                         6 "24-59 bulan"

.         lab val survdis survdis

.         *table survdis, c(min ageideathd max ageideathd)
.         table survdis, stat(min ageideathd) stat(max ageideathd)

--------------------------------------------------
                  |  Minimum value   Maximum value
------------------+-------------------------------
Interval umur     |                               
  0-6 hari        |              0               6
  7-28 hari       |              7              28
  29 hari-5 bulan |             29             150
  6-11 bulan      |            180             359
  Total           |              0             359
--------------------------------------------------

.         
. *\Ekspansi data 
. expand survdis
(102,406 observations created)

. bysort birthid: gen interval = _n

. lab val interval survdis

. replace ideath = 0 if ideath == 1 & survdis != interval 
(1,006 real changes made)

. tab interval ideath, row m

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                |    Meninggal saat
                |  periode 0-11 bulan
       interval |     Tidak         Ya |     Total
----------------+----------------------+----------
       0-6 hari |    34,301        507 |    34,808 
                |     98.54       1.46 |    100.00 
----------------+----------------------+----------
      7-28 hari |    34,167        134 |    34,301 
                |     99.61       0.39 |    100.00 
----------------+----------------------+----------
29 hari-5 bulan |    33,938        229 |    34,167 
                |     99.33       0.67 |    100.00 
----------------+----------------------+----------
     6-11 bulan |    33,800        138 |    33,938 
                |     99.59       0.41 |    100.00 
----------------+----------------------+----------
          Total |   136,206      1,008 |   137,214 
                |     99.27       0.73 |    100.00 

. 
. *\Simpan sementara
. keep interval survdis $vars $id chsingle lastbirth

. gen data = 2

. 
. quietly compress

. save "data-mdl-b.dta", replace
(file data-mdl-b.dta not found)
file data-mdl-b.dta saved

. 
. 
. 
. /*
> ================================================================================
> EKSPANSI DATA ANAK -> ANAK-PERIODE - U5DEATH
> ================================================================================
> */
. 
. /*
> ******************************************************************
> Set                                                                                                                     [done]
> ******************************************************************
> */
. 
. clear all

. use `dta'
(Data merge\ 15 Dec 2021_16:33:10)

. 
. *cek missing
. foreach p in $vars {
  2.         nmissing `p'
  3. }

nndeath            35

agenndeath         35

ideath             35

ageideathd         35

u5death            35

ageu5deathd        35

depriv             37

depriv2c           37

pareduc          5737

. 
. *\Birth id
. tostring(bidx), g(bidx_str)
bidx_str generated as str2

. tostring(v001), g(clust_str)
clust_str generated as str4

. tostring(v002), g(hid_str)
hid_str generated as str2

. tostring(v003), g(mid_str)
mid_str generated as str2

. gen birthid = clust_str + "_" + hid_str + "_" + mid_str + "_" + bidx_str

. 
. *set sampel
. gen nomisvaruse = .
(86,265 missing values generated)

.         replace nomisvaruse = 1 if !(chalive == 0 & missing(agedeath)) &        ///
>                                                            !missing(depriv) &                                           ///
>                                                            !missing(pareduc)       
(80,458 real changes made)

. keep if `sett'
(51,457 observations deleted)

. 
. *cek missing
. foreach p in $vars $id {
  2.         nmissing `p'
  3. }

. 
. /*
> ******************************************************************
> Ekspansi                                                                                                        [done]
> ******************************************************************
> */
. 
. *\Diskritisasi umur
. egen survdis = cut(ageu5deathd), at(0 7 29 180 360 720 1800) icodes

.         replace survdis = survdis + 1
(34,808 real changes made)

.         lab var survdis "Interval umur"

.         lab def survdis 1 "0-6 hari"                    ///
>                                         2 "7-28 hari"                   ///
>                                         3 "29 hari-5 bulan"     ///
>                                         4 "6-11 bulan"                  ///
>                                         5 "12-23 bulan"                 ///
>                                         6 "24-59 bulan"

.         lab val survdis survdis

.         *table survdis, c(min ageu5deathd max ageu5deathd)
.         table survdis, stat(min ageu5deathd) stat(max ageu5deathd)

--------------------------------------------------
                  |  Minimum value   Maximum value
------------------+-------------------------------
Interval umur     |                               
  0-6 hari        |              0               6
  7-28 hari       |              7              28
  29 hari-5 bulan |             29             150
  6-11 bulan      |            180             330
  12-23 bulan     |            360             690
  24-59 bulan     |            720            1799
  Total           |              0            1799
--------------------------------------------------

.         
. *\Ekspansi data 
. expand survdis
(169,898 observations created)

. bysort birthid: gen interval = _n

. lab val interval survdis

. replace u5death = 0 if u5death == 1 & survdis != interval 
(1,933 real changes made)

. tab interval u5death, row m

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                |    Meninggal saat
                |  periode 0-59 bulan
       interval |     Tidak         Ya |     Total
----------------+----------------------+----------
       0-6 hari |    34,301        507 |    34,808 
                |     98.54       1.46 |    100.00 
----------------+----------------------+----------
      7-28 hari |    34,167        134 |    34,301 
                |     99.61       0.39 |    100.00 
----------------+----------------------+----------
29 hari-5 bulan |    33,938        229 |    34,167 
                |     99.33       0.67 |    100.00 
----------------+----------------------+----------
     6-11 bulan |    33,800        138 |    33,938 
                |     99.59       0.41 |    100.00 
----------------+----------------------+----------
    12-23 bulan |    33,692        108 |    33,800 
                |     99.68       0.32 |    100.00 
----------------+----------------------+----------
    24-59 bulan |    33,593         99 |    33,692 
                |     99.71       0.29 |    100.00 
----------------+----------------------+----------
          Total |   203,491      1,215 |   204,706 
                |     99.41       0.59 |    100.00 

. 
. *\Simpan sementara
. keep interval survdis $vars $id chsingle lastbirth

. gen data = 3

. 
. quietly compress

. save "data-mdl-c.dta", replace
(file data-mdl-c.dta not found)
file data-mdl-c.dta saved

. 
. 
. 
. /*
> ================================================================================
> FINALISASI
> ================================================================================
> */
. 
. clear all

. use "data-mdl-a.dta"
(Data merge\ 15 Dec 2021_16:33:10)

. append using "data-mdl-b.dta"
(label survdis already defined)
(label yatidak already defined)
(label chsex already defined)
(label mageb already defined)
(label bordin already defined)
(label pareduc already defined)
(label wealth already defined)
(label depriv already defined)
(label depriv2c already defined)
(label reside already defined)
(label prov already defined)

. append using "data-mdl-c.dta"
(label survdis already defined)
(label yatidak already defined)
(label chsex already defined)
(label mageb already defined)
(label bordin already defined)
(label pareduc already defined)
(label wealth already defined)
(label depriv already defined)
(label depriv2c already defined)
(label reside already defined)
(label prov already defined)

. 
. lab var birthid "id kelahiran"

. lab var interval "Interval umur"

. 
. lab var data "Untuk pemodelan"

. lab def data 1 "Neonatal" 2 "Bayi" 3 "Di bawah 5 tahun"

. lab val data data

. 
. quietly compress

. datasignature set, reset
  411029:29(64750):1348220412:3734242686       (data signature reset)

. lab data "Dataset pemodelan \ `time_date'"

. note: `idhs'-mortstudy-data-model.dta \ `tag'

. save "`savenm'", replace
(file dta\8-data-model-.dta not found)
file dta\8-data-model-.dta saved

. 
. erase "data-mdl-a.dta"

. erase "data-mdl-b.dta"

. erase "data-mdl-c.dta"

. 
end of do-file

. do "D:\RESEARCH & WRITING\master thesis_child mortality\stata\do\9-risk-by-age.do"

. log close _all
      name:  log_8_data_model_idhs17
       log:  D:\RESEARCH & WRITING\master thesis_child mortality\stata\log\8_data_model_idhs17.log
  log type:  text
 closed on:  15 Dec 2021, 16:38:32
----------------------------------------------------------------------------------------------------------------------------------
