----------------------------------------------------------------------------------------------------------------------------------
      name:  log_8_data_model_idhs17
       log:  D:\RESEARCH & WRITING\master thesis_child mortality\stata\log\8_data_model_idhs17.log
  log type:  text
 opened on:  25 Jan 2022, 15:37:51

. 
. /*
> ================================================================================
> ********************************************************************************
> PROJECT:
> PENELITIAN TESIS
> HUBUNGAN ANTARA DEPRIVASI LINGKUNGAN RUMAH TANGGA DENGAN KEMATIAN BAYI DAN ANAK
> DI INDONESIA: BUKTI DARI MODEL LOGISTIK MULTILEVEL HAZARD DISKRIT
> 
> SYNTAX:
> 8-MENYIAPKAN DATA UNTUK PEMODELAN-ANAK PERIODE
> 
> PENULIS:
> ARI PURWANTO SARWO PRASOJO (2006500321)
> MAGISTER EKONOMI KEPENDUDUKAN DAN KETENAGAKERJAAN
> FAKULTAS EKONOMI DAN BISNIS, UNIVERSITAS INDONESIA
> 2022
> ********************************************************************************
> ================================================================================
> */
. 
. 
. 
. /*
> ================================================================================
> PENYIAPAN
> ================================================================================
> */
. 
. set maxvar 10000


. 
. *tag
. loc date = c(current_date)

. loc time = c(current_time)

. loc time_date = "`date'" + "_" + "`time'"

. loc tag "`dfn'.do Ari Prasojo `time_date'"

. 
. *data
. loc dta                 "dta\6-chmort-`idhs'.dta"

. loc savenm              "dta\8-data-model-`idhs'.dta"

. 
. *set sampel
. loc sett                "precsvy10==1 & nomisvaruse==1"

. 
. *vars
. #delimit ;
delimiter now ;
. glo vars
>         /*lokasi*/
>         psu
>                 
>         /*bobot*/
>         wweight hhweight
>         
>         /*var terikat*/
>         nndeath agenndeath
>         ideath ageideathd
>         u5death ageu5deathd
>         
>         /*var bebas*/
>         impdrinkwat impsan cookfldr
>         depriv chsex bordin
>         mageb pareduc wealth reside pwdisthfac
>         ;

. #delimit cr
delimiter now cr
. 
. *id
. #delimit ;
delimiter now ;
. glo id
>         /*id*/
>         bidx_str clust_str hid_str mid_str birthid
>         ;

. #delimit cr
delimiter now cr
. 
. 
. /*
> ================================================================================
> EKSPANSI DATA ANAK -> ANAK-PERIODE - NNDEATH
> ================================================================================
> */
. 
. /*
> ******************************************************************
> Set                                                                                                                     [done]
> ******************************************************************
> */
. 
. use `dta'
(Data merge\ 25 Jan 2022_11:39:17)

. 
. *cek missing
. foreach p in $vars {
  2.         nmissing `p'
  3. }

nndeath            35

agenndeath         35

ideath             35

ageideathd         35

u5death            35

ageu5deathd        35

impdrinkwat        11

impsan             29

cookfldr            4

depriv             37

pareduc          5737

. 
. *\Birth id
. tostring(bidx), g(bidx_str)
bidx_str generated as str2

. tostring(v001), g(clust_str)
clust_str generated as str4

. tostring(v002), g(hid_str)
hid_str generated as str2

. tostring(v003), g(mid_str)
mid_str generated as str2

. gen birthid = clust_str + "_" + hid_str + "_" + mid_str + "_" + bidx_str

. 
. *set sampel
. gen nomisvaruse = .
(86,265 missing values generated)

.         replace nomisvaruse = 1 if !(chalive == 0 & missing(agedeath)) &        ///
>                                                            !missing(depriv) &                                           ///
>                                                            !missing(pareduc)       
(80,458 real changes made)

. keep if `sett'
(51,457 observations deleted)

. 
. *cek missing
. foreach p in $vars $id {
  2.         nmissing `p'
  3. }

. 
. /*
> ******************************************************************
> Ekspansi                                                                                                        [done]
> ******************************************************************
> */
. 
. *\Diskritisasi
. egen agedis = cut(agenndeath), at(0 7 29) icodes

.         replace agedis = agedis + 1
(34,808 real changes made)

.         lab var agedis "Umur (periods)"

.         lab def agedis 1 "0-6 hari"                     ///
>                                         2 "7-28 hari"                   ///
>                                         3 "29 hari-5 bulan"     ///
>                                         4 "6-11 bulan"                  ///
>                                         5 "12-23 bulan"                 ///
>                                         6 "24-59 bulan" 

.         lab val agedis agedis

.         *table agedis, c(min agenndeath max agenndeath)
.         table agedis, stat(min agenndeath) stat(max agenndeath)

-----------------------------------------------
               |  Minimum value   Maximum value
---------------+-------------------------------
Umur (periods) |                               
  0-6 hari     |              0               6
  7-28 hari    |              7              28
  Total        |              0              28
-----------------------------------------------

.         
. *\Ekspansi data 
. expand agedis
(34,301 observations created)

. bysort birthid: gen periods = _n

. lab val periods agedis

. replace nndeath = 0 if nndeath == 1 & agedis != periods 
(134 real changes made)

. tab periods nndeath, row m

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                |    Meninggal saat
                |   periode neonatal
        periods |     Tidak         Ya |     Total
----------------+----------------------+----------
       0-6 hari |    34,301        507 |    34,808 
                |     98.54       1.46 |    100.00 
----------------+----------------------+----------
      7-28 hari |    34,167        134 |    34,301 
                |     99.61       0.39 |    100.00 
----------------+----------------------+----------
          Total |    68,468        641 |    69,109 
                |     99.07       0.93 |    100.00 

. 
. *\Simpan sementara
. keep periods agedis $vars $id

. gen data = 1

. 
. quietly compress

. save "data-mdl-a.dta", replace
(file data-mdl-a.dta not found)
file data-mdl-a.dta saved

. 
. 
. 
. /*
> ================================================================================
> EKSPANSI DATA ANAK -> ANAK-PERIODE - IDEATH
> ================================================================================
> */
. 
. /*
> ******************************************************************
> Set                                                                                                                     [done]
> ******************************************************************
> */
. 
. clear all

. use `dta'
(Data merge\ 25 Jan 2022_11:39:17)

. 
. *cek missing
. foreach p in $vars {
  2.         nmissing `p'
  3. }

nndeath            35

agenndeath         35

ideath             35

ageideathd         35

u5death            35

ageu5deathd        35

impdrinkwat        11

impsan             29

cookfldr            4

depriv             37

pareduc          5737

. 
. *\Birth id
. tostring(bidx), g(bidx_str)
bidx_str generated as str2

. tostring(v001), g(clust_str)
clust_str generated as str4

. tostring(v002), g(hid_str)
hid_str generated as str2

. tostring(v003), g(mid_str)
mid_str generated as str2

. gen birthid = clust_str + "_" + hid_str + "_" + mid_str + "_" + bidx_str

. 
. *set sampel
. gen nomisvaruse = .
(86,265 missing values generated)

.         replace nomisvaruse = 1 if !(chalive == 0 & missing(agedeath)) &        ///
>                                                            !missing(depriv) &                                           ///
>                                                            !missing(pareduc)       
(80,458 real changes made)

. keep if `sett'
(51,457 observations deleted)

. 
. *cek missing
. foreach p in $vars $id {
  2.         nmissing `p'
  3. }

. 
. /*
> ******************************************************************
> Ekspansi                                                                                                        [done]
> ******************************************************************
> */
. 
. *\Diskritisasi
. egen agedis = cut(ageideathd), at(0 7 29 180 360) icodes

.         replace agedis = agedis + 1
(34,808 real changes made)

.         lab var agedis "Umur (periods)"

.         lab def agedis 1 "0-6 hari"                     ///
>                                         2 "7-28 hari"                   ///
>                                         3 "29 hari-5 bulan"     ///
>                                         4 "6-11 bulan"                  ///
>                                         5 "12-23 bulan"                 ///
>                                         6 "24-59 bulan"

.         lab val agedis agedis

.         *table agedis, c(min ageideathd max ageideathd)
.         table agedis, stat(min ageideathd) stat(max ageideathd)

--------------------------------------------------
                  |  Minimum value   Maximum value
------------------+-------------------------------
Umur (periods)    |                               
  0-6 hari        |              0               6
  7-28 hari       |              7              28
  29 hari-5 bulan |             29             150
  6-11 bulan      |            180             359
  Total           |              0             359
--------------------------------------------------

.         
. *\Ekspansi data 
. expand agedis
(102,406 observations created)

. bysort birthid: gen periods = _n

. lab val periods agedis

. replace ideath = 0 if ideath == 1 & agedis != periods 
(1,006 real changes made)

. tab periods ideath, row m

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                |    Meninggal saat
                |  periode 0-11 bulan
        periods |     Tidak         Ya |     Total
----------------+----------------------+----------
       0-6 hari |    34,301        507 |    34,808 
                |     98.54       1.46 |    100.00 
----------------+----------------------+----------
      7-28 hari |    34,167        134 |    34,301 
                |     99.61       0.39 |    100.00 
----------------+----------------------+----------
29 hari-5 bulan |    33,938        229 |    34,167 
                |     99.33       0.67 |    100.00 
----------------+----------------------+----------
     6-11 bulan |    33,800        138 |    33,938 
                |     99.59       0.41 |    100.00 
----------------+----------------------+----------
          Total |   136,206      1,008 |   137,214 
                |     99.27       0.73 |    100.00 

. 
. *\Simpan sementara
. keep periods agedis $vars $id

. gen data = 2

. 
. quietly compress

. save "data-mdl-b.dta", replace
(file data-mdl-b.dta not found)
file data-mdl-b.dta saved

. 
. 
. 
. /*
> ================================================================================
> EKSPANSI DATA ANAK -> ANAK-PERIODE - U5DEATH
> ================================================================================
> */
. 
. /*
> ******************************************************************
> Set                                                                                                                     [done]
> ******************************************************************
> */
. 
. clear all

. use `dta'
(Data merge\ 25 Jan 2022_11:39:17)

. 
. *cek missing
. foreach p in $vars {
  2.         nmissing `p'
  3. }

nndeath            35

agenndeath         35

ideath             35

ageideathd         35

u5death            35

ageu5deathd        35

impdrinkwat        11

impsan             29

cookfldr            4

depriv             37

pareduc          5737

. 
. *\Birth id
. tostring(bidx), g(bidx_str)
bidx_str generated as str2

. tostring(v001), g(clust_str)
clust_str generated as str4

. tostring(v002), g(hid_str)
hid_str generated as str2

. tostring(v003), g(mid_str)
mid_str generated as str2

. gen birthid = clust_str + "_" + hid_str + "_" + mid_str + "_" + bidx_str

. 
. *set sampel
. gen nomisvaruse = .
(86,265 missing values generated)

.         replace nomisvaruse = 1 if !(chalive == 0 & missing(agedeath)) &        ///
>                                                            !missing(depriv) &                                           ///
>                                                            !missing(pareduc)       
(80,458 real changes made)

. keep if `sett'
(51,457 observations deleted)

. 
. *cek missing
. foreach p in $vars $id {
  2.         nmissing `p'
  3. }

. 
. /*
> ******************************************************************
> Ekspansi                                                                                                        [done]
> ******************************************************************
> */
. 
. *\Diskritisasi umur
. egen agedis = cut(ageu5deathd), at(0 7 29 180 360 720 1800) icodes

.         replace agedis = agedis + 1
(34,808 real changes made)

.         lab var agedis "Umur (periods)"

.         lab def agedis 1 "0-6 hari"                     ///
>                                         2 "7-28 hari"                   ///
>                                         3 "29 hari-5 bulan"     ///
>                                         4 "6-11 bulan"                  ///
>                                         5 "12-23 bulan"                 ///
>                                         6 "24-59 bulan"

.         lab val agedis agedis

.         *table agedis, c(min ageu5deathd max ageu5deathd)
.         table agedis, stat(min ageu5deathd) stat(max ageu5deathd)

--------------------------------------------------
                  |  Minimum value   Maximum value
------------------+-------------------------------
Umur (periods)    |                               
  0-6 hari        |              0               6
  7-28 hari       |              7              28
  29 hari-5 bulan |             29             150
  6-11 bulan      |            180             330
  12-23 bulan     |            360             690
  24-59 bulan     |            720            1799
  Total           |              0            1799
--------------------------------------------------

.         
. *\Ekspansi data 
. expand agedis
(169,898 observations created)

. bysort birthid: gen periods = _n

. lab val periods agedis

. replace u5death = 0 if u5death == 1 & agedis != periods 
(1,933 real changes made)

. tab periods u5death, row m

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                |    Meninggal saat
                |  periode 0-59 bulan
        periods |     Tidak         Ya |     Total
----------------+----------------------+----------
       0-6 hari |    34,301        507 |    34,808 
                |     98.54       1.46 |    100.00 
----------------+----------------------+----------
      7-28 hari |    34,167        134 |    34,301 
                |     99.61       0.39 |    100.00 
----------------+----------------------+----------
29 hari-5 bulan |    33,938        229 |    34,167 
                |     99.33       0.67 |    100.00 
----------------+----------------------+----------
     6-11 bulan |    33,800        138 |    33,938 
                |     99.59       0.41 |    100.00 
----------------+----------------------+----------
    12-23 bulan |    33,692        108 |    33,800 
                |     99.68       0.32 |    100.00 
----------------+----------------------+----------
    24-59 bulan |    33,593         99 |    33,692 
                |     99.71       0.29 |    100.00 
----------------+----------------------+----------
          Total |   203,491      1,215 |   204,706 
                |     99.41       0.59 |    100.00 

. 
. *\Simpan sementara
. keep periods agedis $vars $id

. gen data = 3

. 
. quietly compress

. save "data-mdl-c.dta", replace
(file data-mdl-c.dta not found)
file data-mdl-c.dta saved

. 
. 
. 
. /*
> ================================================================================
> FINALISASI
> ================================================================================
> */
. 
. clear all

. use "data-mdl-a.dta"
(Data merge\ 25 Jan 2022_11:39:17)

. append using "data-mdl-b.dta"
(label agedis already defined)
(label yatidak already defined)
(label chsex already defined)
(label mageb already defined)
(label bordin already defined)
(label pareduc already defined)
(label wealth already defined)
(label depriv already defined)
(label cookfldr already defined)
(label impsan already defined)
(label impdrinkwat already defined)
(label reside already defined)

. append using "data-mdl-c.dta"
(label agedis already defined)
(label yatidak already defined)
(label chsex already defined)
(label mageb already defined)
(label bordin already defined)
(label pareduc already defined)
(label wealth already defined)
(label depriv already defined)
(label cookfldr already defined)
(label impsan already defined)
(label impdrinkwat already defined)
(label reside already defined)

. 
. lab var birthid "id kelahiran"

. lab var periods "Periode/interval umur"

. 
. lab var data "Untuk pemodelan"

. lab def data 1 "Neonatal" 2 "Bayi" 3 "Di bawah 5 tahun"

. lab val data data

. 
. quietly compress

. datasignature set, reset
  411029:28(88784):2552181403:1534725182       (data signature reset)

. lab data "Dataset pemodelan \ `time_date'"

. note: `idhs'-mortstudy-data-model.dta \ `tag'

. save "`savenm'", replace
file dta\8-data-model-idhs17.dta saved

. 
. erase "data-mdl-a.dta"

. erase "data-mdl-b.dta"

. erase "data-mdl-c.dta"

. 
. drop agenndeath ageideathd ageu5deathd

. describe

Contains data from dta\8-data-model-idhs17.dta
 Observations:       411,029                  Dataset pemodelan \ 25 Jan 2022_15:37:51
    Variables:            25                  25 Jan 2022 15:37
                                              (_dta has notes)
----------------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
----------------------------------------------------------------------------------------------------------------------------------
bidx_str        str1    %9s                   birth column number
clust_str       str4    %9s                   cluster number
hid_str         str2    %9s                   household number
mid_str         str2    %9s                   respondent's line number
nndeath         byte    %9.0g      yatidak    Meninggal saat periode neonatal
ideath          byte    %9.0g      yatidak    Meninggal saat periode 0-11 bulan
u5death         byte    %9.0g      yatidak    Meninggal saat periode 0-59 bulan
chsex           byte    %9.0g      chsex      Jenis kelamin anak
mageb           byte    %9.0g      mageb      Umur ibu saat melahirkan
bordin          byte    %18.0g     bordin     Urutan dan jarak kelahiran sebelumnya
wweight         float   %9.0g                 Penimbang perempuan
pareduc         byte    %10.0g     pareduc    Pendidikan orang tua (ibu-ayah)
psu             int     %9.0g                 Primary sampling unit (proksi komunitas)
reside          byte    %9.0g      reside     Wilayah tempat tinggal
hhweight        float   %9.0g                 Penimbang rumah tangga
impdrinkwat     byte    %11.0g     impdrinkwat
                                              Kategori sumber utama air minum
impsan          byte    %11.0g     impsan     Kategori fasilitas toilet/sanitasi
cookfldr        byte    %24.0g     cookfldr   Kategori bahan bakar memasak
depriv          byte    %9.0g      depriv     Tingkat deprivasi lingkungan rumah tangga
wealth          byte    %9.0g      wealth     Indeks kekayaan rumah tangga
pwdisthfac      float   %9.0g                 Masalah aksesibilitas ke faskes
birthid         str12   %12s                  id kelahiran
agedis          byte    %15.0g     agedis     Umur (periods)
periods         byte    %15.0g     agedis     Periode/interval umur
data            byte    %16.0g     data       Untuk pemodelan
----------------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. 
. 
. *close log-file
. log close _all
      name:  log_8_data_model_idhs17
       log:  D:\RESEARCH & WRITING\master thesis_child mortality\stata\log\8_data_model_idhs17.log
  log type:  text
 closed on:  25 Jan 2022, 15:37:58
----------------------------------------------------------------------------------------------------------------------------------
