----------------------------------------------------------------------------------------------------------------------------------
      name:  log_9_risk_by_age_idhs17
       log:  D:\RESEARCH & WRITING\master thesis_child mortality\stata\log\9_risk_by_age_idhs17.log
  log type:  text
 opened on:  25 Jan 2022, 15:41:33

. 
. /*
> ================================================================================
> ********************************************************************************
> PROJECT:
> PENELITIAN TESIS
> HUBUNGAN ANTARA DEPRIVASI LINGKUNGAN RUMAH TANGGA DENGAN KEMATIAN BAYI DAN ANAK
> DI INDONESIA: BUKTI DARI MODEL LOGISTIK MULTILEVEL HAZARD DISKRIT
> 
> SYNTAX:
> 9-DESKRIPTIF HAZARD-RISK BERDASARKAN UMUR
> 
> PENULIS:
> ARI PURWANTO SARWO PRASOJO (2006500321)
> MAGISTER EKONOMI KEPENDUDUKAN DAN KETENAGAKERJAAN
> FAKULTAS EKONOMI DAN BISNIS, UNIVERSITAS INDONESIA
> 2022
> ********************************************************************************
> ================================================================================
> */
. 
. 
. 
. /*
> ================================================================================
> PENYIAPAN
> ================================================================================
> */
. 
. set maxvar 10000


. 
. *baca data
. loc dta                 "dta\8-data-model-`idhs'.dta"

. use `dta'
(Dataset pemodelan \ 25 Jan 2022_15:37:51)

. 
. 
. 
. /*
> ================================================================================
> HITUNG                                                                                          
> ================================================================================
> */
. 
. *\Pendekatan logit         
. logit u5death i.periods i.periods#depriv if data==3

Iteration 0:   log likelihood = -7440.4865  
Iteration 1:   log likelihood = -7306.3265  
Iteration 2:   log likelihood = -7155.2469  
Iteration 3:   log likelihood = -7154.0748  
Iteration 4:   log likelihood = -7154.0736  
Iteration 5:   log likelihood = -7154.0736  

Logistic regression                                    Number of obs = 204,706
                                                       LR chi2(17)   =  572.83
                                                       Prob > chi2   =  0.0000
Log likelihood = -7154.0736                            Pseudo R2     =  0.0385

-----------------------------------------------------------------------------------------
                u5death | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                periods |
             7-28 hari  |  -1.361672   .1462426    -9.31   0.000    -1.648303   -1.075042
       29 hari-5 bulan  |  -.9685523   .1262231    -7.67   0.000    -1.215945   -.7211596
            6-11 bulan  |  -1.539955   .1576272    -9.77   0.000    -1.848899   -1.231012
           12-23 bulan  |  -1.818825   .1773846   -10.25   0.000    -2.166493   -1.471158
           24-59 bulan  |   -1.59857   .1617947    -9.88   0.000    -1.915682   -1.281458
                        |
         periods#depriv |
       0-6 hari#Rendah  |   .2832729   .1026878     2.76   0.006     .0820085    .4845373
       0-6 hari#Tinggi  |   .3941919   .1164468     3.39   0.001     .1659604    .6224235
      7-28 hari#Rendah  |   .2065038   .2067509     1.00   0.318    -.1987205     .611728
      7-28 hari#Tinggi  |   .6359034   .2120141     3.00   0.003     .2203634    1.051443
29 hari-5 bulan#Rendah  |   .5399847   .1554062     3.47   0.001     .2353941    .8445752
29 hari-5 bulan#Tinggi  |   .7969056   .1668783     4.78   0.000     .4698302    1.123981
     6-11 bulan#Rendah  |   .6054755   .2034674     2.98   0.003     .2066868    1.004264
     6-11 bulan#Tinggi  |   .9617555   .2121906     4.53   0.000     .5458696    1.377641
    12-23 bulan#Rendah  |   .6003648   .2344414     2.56   0.010      .140868    1.059861
    12-23 bulan#Tinggi  |   1.088424   .2362753     4.61   0.000     .6253332    1.551515
    24-59 bulan#Rendah  |   .2656274   .2305376     1.15   0.249     -.186218    .7174728
    24-59 bulan#Tinggi  |    .360974   .2637926     1.37   0.171    -.1560499    .8779979
                        |
                  _cons |  -4.378829   .0662064   -66.14   0.000    -4.508591   -4.249067
-----------------------------------------------------------------------------------------

. margins i.periods i.periods#depriv

Predictive margins                                     Number of obs = 204,706
Model VCE: OIM

Expression: Pr(u5death), predict()

-----------------------------------------------------------------------------------------
                        |            Delta-method
                        |     Margin   std. err.      z    P>|z|     [95% conf. interval]
------------------------+----------------------------------------------------------------
                periods |
              0-6 hari  |   .0145546   .0006416    22.69   0.000     .0132972     .015812
             7-28 hari  |   .0039044   .0003366    11.60   0.000     .0032447    .0045641
       29 hari-5 bulan  |   .0066997   .0004411    15.19   0.000     .0058352    .0075642
            6-11 bulan  |    .004068   .0003455    11.78   0.000     .0033909    .0047452
           12-23 bulan  |   .0031993   .0003073    10.41   0.000     .0025971    .0038015
           24-59 bulan  |   .0029403   .0002951     9.96   0.000      .002362    .0035186
                        |
         periods#depriv |
        0-6 hari#Tidak  |   .0123847   .0008098    15.29   0.000     .0107976    .0139719
       0-6 hari#Rendah  |   .0163739   .0012642    12.95   0.000     .0138961    .0188518
       0-6 hari#Tinggi  |   .0182596   .0017172    10.63   0.000     .0148939    .0216253
       7-28 hari#Tidak  |   .0032029   .0004163     7.69   0.000     .0023869    .0040188
      7-28 hari#Rendah  |   .0039346   .0006288     6.26   0.000     .0027022    .0051671
      7-28 hari#Tinggi  |   .0060322   .0010023     6.02   0.000     .0040677    .0079967
 29 hari-5 bulan#Tidak  |    .004738   .0005068     9.35   0.000     .0037448    .0057313
29 hari-5 bulan#Rendah  |   .0081029   .0009023     8.98   0.000     .0063345    .0098713
29 hari-5 bulan#Tinggi  |   .0104518   .0013204     7.92   0.000     .0078638    .0130398
      6-11 bulan#Tidak  |   .0026813   .0003825     7.01   0.000     .0019315     .003431
     6-11 bulan#Rendah  |   .0049015   .0007057     6.95   0.000     .0035183    .0062847
     6-11 bulan#Tinggi  |   .0069847    .001087     6.43   0.000     .0048542    .0091152
     12-23 bulan#Tidak  |   .0020301   .0003334     6.09   0.000     .0013766    .0026835
    12-23 bulan#Rendah  |   .0036942   .0006146     6.01   0.000     .0024897    .0048987
    12-23 bulan#Tinggi  |   .0060045   .0010119     5.93   0.000     .0040212    .0079877
     24-59 bulan#Tidak  |    .002529   .0003724     6.79   0.000     .0017991    .0032589
    24-59 bulan#Rendah  |   .0032959   .0005817     5.67   0.000     .0021558     .004436
    24-59 bulan#Tinggi  |   .0036244   .0007895     4.59   0.000     .0020771    .0051718
-----------------------------------------------------------------------------------------

. marginsplot, noci                                                                                                               
>         ///
>         title("") ytitle("Hazard") xtitle("Periode umur")                                               ///
>         ylab(0 "0" 0.005 "0.50" 0.01 "1.00" 0.015 "1.50" 0.02 "2.00")                   ///
>         xlab(1 "0-6 hari"   2 "7-28 hari"   3 "29 hari-5 bulan"                                 ///
>                    4 "6-11 bulan" 5 "12-23 bulan" 6 "24-59 bulan", angle(45))           ///
>         legend(order (1 2 3 4)                                                                                                  
> ///
>                    label(1 "Deprivasi-Tidak")                                                                           ///
>                    label(2 "Deprivasi-Rendah")                                                                          ///
>                    label(3 "Deprivasi-Tinggi")                                                                          ///
>                    label(4 "Total")                                                                                             
> ///
>                    position(6) rows(1))                                                                                         
> ///
>         scheme(gg_tableau)

Variables that uniquely identify margins: periods depriv

. graph export ".\output\risk_by_age.png", replace
(file .\output\risk_by_age.png not found)
file .\output\risk_by_age.png saved as PNG format

. 
. 
. *\Tabel
. *total
. keep if data == 3
(206,323 observations deleted)

. gen u5death100 = 100*u5death

. collapse (mean) u5death100, by(periods)

. rename u5death100 Total

. save "risk-total.dta", replace
(file risk-total.dta not found)
file risk-total.dta saved

. 
. *by depriv
. clear all

. use `dta'
(Dataset pemodelan \ 25 Jan 2022_15:37:51)

. keep if data == 3
(206,323 observations deleted)

. gen u5death100 = 100*u5death

. collapse (mean) u5death100, by(periods depriv)

. reshape wide u5death100, i(periods) j(depriv)
(j = 0 1 2)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations               18   ->   6           
Number of variables                   3   ->   4           
j variable (3 values)            depriv   ->   (dropped)
xij variables:
                             u5death100   ->   u5death1000 u5death1001 u5death1002
-----------------------------------------------------------------------------

. rename u5death1000 Tidak

. rename u5death1001 Rendah

. rename u5death1002 Tinggi

. gen Rendah_Tidak = Rendah/Tidak

. gen Tinggi_Tidak = Tinggi/Tidak

. merge m:1 periods using "risk-total.dta", keep(match) keepus() nogen
(label agedis already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                 6  
    -----------------------------------------

. export excel ".\output\risk_by_age.xls", firstrow(variables) replace
file .\output\risk_by_age.xls saved

. erase "risk-total.dta"

. 
. 
. 
. *close log-file
. log close _all
      name:  log_9_risk_by_age_idhs17
       log:  D:\RESEARCH & WRITING\master thesis_child mortality\stata\log\9_risk_by_age_idhs17.log
  log type:  text
 closed on:  25 Jan 2022, 15:41:58
----------------------------------------------------------------------------------------------------------------------------------
